################################################################################
##
##  Licensed to the Apache Software Foundation (ASF) under one or more
##  contributor license agreements.  See the NOTICE file distributed with
##  this work for additional information regarding copyright ownership.
##  The ASF licenses this file to You under the Apache License, Version 2.0
##  (the "License"); you may not use this file except in compliance with
##  the License.  You may obtain a copy of the License at
##
##      http://www.apache.org/licenses/LICENSE-2.0
##
##  Unless required by applicable law or agreed to in writing, software
##  distributed under the License is distributed on an "AS IS" BASIS,
##  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
##  See the License for the specific language governing permissions and
##  limitations under the License.
##
################################################################################

benchmark=referencia de rendimiento de salida
compiler.accessible=genere un SWF al que se tenga acceso
compiler.source-path=lista de elementos de ruta de acceso que forman las ra\u00edces de las jerarqu\u00edas de clases de ActionScript
compiler.actionscript-file-encoding=especifica la codificaci\u00f3n de archivo de actionscript. No hay BOM en los archivos de c\u00f3digo fuente AS3, el compilador usar\u00e1 esta codificaci\u00f3n de archivo.
compiler.isolate-styles=permite que el m\u00f3dulo o la aplicaci\u00f3n compilada definan estilos que s\u00f3lo afectan a tal m\u00f3dulo/aplicaci\u00f3n y a sus elementos secundarios
compiler.context-root=ruta de acceso para reemplazar tokens {context.root} de puntos finales de canales de servicio
compiler.external-library-path=lista de archivos o directorios de SWC en los que compilar, pero que se pasan por alto al vincular
compiler.fonts.languages.language-range=intervalo para restringir el n\u00famero de glifos de fuentes incrustados en el SWF
compiler.fonts.managers=Clases del administrador de fuentes del compilador, en orden de resoluci\u00f3n de directiva
compiler.fonts.local-fonts-snapshot=Archivo que contiene la informaci\u00f3n de fuentes del sistema generada por flex2.tools.FontSnapshot.
compiler.headless-server=indicador que se va a establecer cuando se ejecute Flex en un servidor sin pantalla
compiler.include-libraries=lista de bibliotecas (SWC) para incluir totalmente en el SWF
compiler.incremental=habilita la compilaci\u00f3n incremental
compiler.keep-all-type-selectors=deshabilita la eliminaci\u00f3n de los selectores de tipo CSS sin usar
compiler.keep-generated-actionscript=guarde los archivos de origen temporales generados durante la compilaci\u00f3n MXML
compiler.keep-generated-signatures=guarde los archivos de firma generados durante la compilaci\u00f3n AS3
compiler.keep-as3-metadata=conserve los metadatos especificados en el SWF
compiler.library-path=muestre una lista de los archivos o directorios SWC que contienen archivos SWC
compiler.locale=especifica la configuraci\u00f3n regional de la internacionalizaci\u00f3n
compiler.mobile=especifica que el tiempo de ejecuci\u00f3n de destino es un dispositivo m\u00f3vil
compiler.mxml.compatibility-version=especifica una versi\u00f3n de compatibilidad, por ejemplo, -compatibility-version=2.0.1
compiler.namespaces.namespace=Especifica un URI al que asociar un manifiesto de los componentes para su uso como elementos MXML
compiler.optimize=Habilite la optimizaci\u00f3n de SWF posterior a la vinculaci\u00f3n
compiler.preloader=Especifica el valor predeterminado para el atributo precargador de la aplicaci\u00f3n. Si no se especifica, el valor de precargador predeterminado es mx.preloaders.SparkDownloadProgressBar cuando -compatibilidad-versi\u00f3n >= 4.0 y mx.preloaders.DownloadProgressBar cuando -compatibilidad-versi\u00f3n < 4.0.
compiler.profile=cree una pel\u00edcula adecuada para la generaci\u00f3n de perfiles de rendimiento y memoria
compiler.services=ruta de acceso al archivo de configuraci\u00f3n de los servicios de datos Flex
compiler.omit-trace-statements=cambia si se omiten las sentencias trace
compiler.report-invalid-styles-as-warnings=habilita la notificaci\u00f3n de estilos no v\u00e1lidos como advertencias
compiler.report-missing-required-skin-parts-as-warnings=Use esta opci\u00f3n para generar una advertencia en lugar de un error cuando se detecte que falta una parte de aspecto obligatoria.
compiler.show-invalid-css-property-warnings=cambia si se notifican advertencias de propiedad css no v\u00e1lidas
compiler.show-binding-warnings=cambie si se muestran las advertencias generadas del c\u00f3digo de enlace de datos
compiler.show-actionscript-warnings=ejecuta el compilador AS3 en un modo que detecta c\u00f3digo v\u00e1lido pero potencialmente incorrecto
compiler.show-dependency-warnings=muestra advertencias cuando las dependencias no se pueden determinar en tiempo de compilaci\u00f3n
compiler.show-deprecation-warnings=cambia si el uso de las API obsoletas genera una advertencia
compiler.show-shadowed-device-font-warnings=cambia si se muestran advertencias cuando un nombre de fuente prevalece sobre el nombre de una fuente de dispositivo
compiler.show-unused-type-selector-warnings=cambia si se muestran las advertencias generadas a partir de selectores de tipo CSS sin usar
compiler.signature-directory=directorio [relative/absolute] donde se guardan las firmas as3 generadas
compiler.strict=ejecuta el compilador AS3 en modo estricto de comprobaci\u00f3n de errores.
compiler.as3=use el modelo de objetos basado en clases de ActionScript 3 para mejorar el rendimiento y la notificaci\u00f3n de errores. En este modelo de objetos, la mayor\u00eda de las funciones integradas se implementan como m\u00e9todos fijos de clases.
compiler.es=use el prototipo de ECMAScript edition 3 basado en el modelo de objetos para permitir la invalidaci\u00f3n din\u00e1mica de las propiedades del prototipo. Las funciones integradas del modelo de objetos basado en el prototipo se implementan como propiedades din\u00e1micas de objetos del prototipo.
compiler.theme=lista de archivos CSS o SWC que se van a aplicar como tema
compiler.verbose-stacktraces=guarde la informaci\u00f3n de la pila de llamadas al SWF para su depuraci\u00f3n
compiler.memory-usage-factor=especifica el factor de uso de la memoria del compilador, el valor predeterminado es 1000.
compiler.conservative=usa el algoritmo conservador para compilar. No se recomienda para aplicaciones grandes. El valor predeterminado es false.
compiler.warn-array-tostring-changes=Ha cambiado el formato Array.toString().
compiler.warn-assignment-within-conditional=Asignaci\u00f3n en condicional.
compiler.warn-bad-array-cast=Posible operaci\u00f3n de conversi\u00f3n de matriz no v\u00e1lida.
compiler.warn-bad-bool-assignment=Se us\u00f3 un valor que no es booleano cuando se esperaba un valor booleano.
compiler.warn-bad-date-cast=Operaci\u00f3n de conversi\u00f3n de fecha no v\u00e1lida.
compiler.warn-bad-es3-type-method=M\u00e9todo desconocido.
compiler.warn-bad-es3-type-prop=Propiedad desconocida.
compiler.warn-bad-nan-comparison=La comparaci\u00f3n no es l\u00f3gica con NaN. Cualquier operaci\u00f3n de comparaci\u00f3n que incluya NaN se evaluar\u00e1 como falsa ya que NaN != NaN.
compiler.warn-bad-null-assignment=No es posible la asignaci\u00f3n al valor null.
compiler.warn-bad-null-comparison=La comparaci\u00f3n no es l\u00f3gica con el valor null.
compiler.warn-bad-undefined-comparison=La comparaci\u00f3n no es l\u00f3gica con indefinidos. S\u00f3lo las variables sin tipo (o variables de tipo *) se pueden dejar sin definir.
compiler.warn-boolean-constructor-with-no-args=El valor de tipo Boolean() sin argumentos devuelve el valor false en ActionScript 3.0. Valor de tipo Boolean() devuelto sin definir en ActionScript 2.0.
compiler.warn-changes-in-resolve=Ya no se admite __resolve.
compiler.warn-class-is-sealed=La clase est\u00e1 sellada. No puede tener miembros agregados a ella din\u00e1micamente.
compiler.warn-const-not-initialized=Constante no inicializada.
compiler.warn-constructor-returns-value=La funci\u00f3n usada en la nueva expresi\u00f3n devuelve un valor. El resultado ser\u00e1 lo que devuelva la funci\u00f3n, en vez de una nueva instancia de dicha funci\u00f3n.
compiler.warn-deprecated-event-handler-error=No se agreg\u00f3 EventHandler al agente de escucha.
compiler.warn-deprecated-function-error=Funci\u00f3n de ActionScript 2.0 no admitida.
compiler.warn-deprecated-property-error=Propiedad de ActionScript 2.0 no admitida.
compiler.warn-duplicate-argument-names=Existen varios argumentos con el mismo nombre.
compiler.warn-for-var-in-changes=ActionScript 3.0 recorre en iteraci\u00f3n las propiedades de un objeto en una instrucci\u00f3n "de x en destino" en orden aleatorio.
compiler.warn-import-hides-class=Si se importa un paquete con el mismo nombre que la clase actual, ocultar\u00e1 el identificador de esa clase en este \u00e1mbito.
compiler.warn-instance-of-changes=Uso del operador instanceof.
compiler.warn-internal-error=Error interno del compilador.
compiler.warn-level-not-supported=Ya no se admite __level. Para obtener m\u00e1s informaci\u00f3n, vea el paquete flash.display.
compiler.warn-missing-namespace-decl=Falta la declaraci\u00f3n del espacio de nombres (p. ej. no se define la variable como p\u00fablica, privada, etc.).
compiler.warn-negative-uint-literal=El valor negativo se convertir\u00e1 en un valor positivo grande cuando se asigne a un tipo de datos uint.
compiler.warn-no-constructor=Falta el constructor.
compiler.warn-no-explicit-super-call-in-constructor=No se llam\u00f3 a la instrucci\u00f3n super() en el constructor.
compiler.warn-no-type-decl=Falta la declaraci\u00f3n de tipos.
compiler.warn-number-from-string-changes=En ActionScript 3.0, se pasa por alto el espacio en blanco y '' devuelve 0. Number() devuelve NaN en ActionScript 2.0 cuando el par\u00e1metro es '' o contiene un espacio en blanco.
compiler.warn-scoping-change-in-this=Cambio en el \u00e1mbito de esta palabra clave. Los m\u00e9todos de clase extra\u00eddos de una instancia de una clase siempre la resolver\u00e1n en esa instancia. En ActionScript 2.0, se busca din\u00e1micamente bas\u00e1ndose en el punto desde el que se invoca el m\u00e9todo.
compiler.warn-slow-text-field-addition=Uso ineficaz de += en un TextField.
compiler.warn-unlikely-function-value=Posiblemente faltan los par\u00e9ntesis.
compiler.warn-xml-class-has-changed=Uso posible de la clase XML de ActionScript 2.0.
debug-password=contrase\u00f1a que se va a incluir en los SWF que se pueden depurar
default-background-color=color de fondo predeterminado (el c\u00f3digo de la aplicaci\u00f3n lo puede sobrescribir)
default-frame-rate=velocidad de fotograma predeterminada que se va a usar en el SWF.
default-script-limits=l\u00edmites de ejecuci\u00f3n del script predeterminado (los atributos ra\u00edz los pueden sobrescribir)
default-size=tama\u00f1o de aplicaci\u00f3n predeterminado (los atributos ra\u00edz de la aplicaci\u00f3n lo pueden sobrescribir)
dependency-info=informaci\u00f3n de dependencia de clase de resultado
dependency.minimize-dependency-set=elimina un archivo SWC del conjunto de dependencias si los scripts resueltos en dicho archivo son un subconjunto de los scripts resueltos en otro archivo SWC dependiente.  
dependency.show-external-classes=establecer en true para mostrar las clases de scripts que causan dependencias entre archivos SWC (false de forma predeterminada).
dependency.show-swcs=lista de nombres SWC; no se requiere una ruta completa. S\u00f3lo se mostrar\u00e1 la informaci\u00f3n de dependencias de los archivos SWC especificados; no afecta al an\u00e1lisis de dependencias.
dependency.show-types=establecer en true para ver los tipos de dependencia de las clases de scripts (false de forma predeterminada).
dependency.types=lista de tipos de dependencias que se puede usar para limitar las clases que se utilizan para determinar dependencias de SWC. Los valores que se pueden utilizar son i,s,n, y e. De forma predeterminada, se usan todos los tipos de dependencias.
digest.rsl-file=ubicaci\u00f3n del RSL para calcular el compendio de
digest.swc-path=ruta del archivo swc o directorio donde se actualizar\u00e1 el compendio
directory=tiene como resultado que la biblioteca sea un directorio abierto en lugar de un archivo SWC
dump-config=escriba un archivo con todos los valores de configuraci\u00f3n establecidos actualmente en un formato adecuado para su uso como archivo de configuraci\u00f3n de Flex
externs=lista de s\u00edmbolos que ignorar al vincular cuando se genera un SWF
includes=lista de s\u00edmbolos para vincular siempre al generar un SWF
include-classes=una lista de clases para incluir en el SWC resultante
include-file=una lista de los archivos con nombre para incluir en el SWC resultante
include-lookup-only=si el valor es true, las entradas de manifiesto con lookupOnly=true se incluyen en el cat\u00e1logo SWC. El valor predeterminado es false.
include-namespaces=todas las clases de espacios de nombres enumerados se incluyen en el SWC resultante
include-resource-bundles=una lista de paquetes de recursos para incluir en el SWC resultante
include-sources=una lista de los directorios y archivos de origen para incluir en el SWC resultante
include-stylesheet=una lista de los recursos de hojas de estilo con nombre para incluir en el SWC resultante
file-specs=lista de archivos de origen que se va a compilar, el \u00faltimo archivo especificado se usar\u00e1 como la aplicaci\u00f3n de destino
frames.frame=Etiqueta de fotograma de SWF con una secuencia de nombres de clase que se vincular\u00e1 al fotograma.
generate-frame-loader=cambie la generaci\u00f3n de una clase de cargador derivada de IFlexModuleFactory
help=Para obtener informaci\u00f3n sobre la sintaxis de l\u00ednea de comandos y descripciones de las variables de configuraci\u00f3n, especifique una cadena de b\u00fasqueda o una de las siguientes palabras claves especiales:\n   syntax   - para describir la sintaxis general de la l\u00ednea de comandos\n   list     - para mostrar una lista de todas las variables de configuraci\u00f3n b\u00e1sicas\n   advanced - para tambi\u00e9n hacer coincidir las variables de configuraci\u00f3n avanzadas\n   aliases  - para ordenar mediante el alias abreviado de la variable\n   details  - para siempre mostrar los detalles completos de cada elemento\nCualquier otra palabra clave de ayuda que se proporcione se utiliza para hacer coincidir una variable de configuraci\u00f3n total o parcial, alias o texto que se va a buscar en la descripci\u00f3n de la variable de configuraci\u00f3n..\n\nPor ejemplo, '-help advanced aliases foo' mostrar\u00eda todas las opciones de configuraci\u00f3n (tanto b\u00e1sicas como avanzadas) que contengan el texto 'foo', ordenadas por el nombre de alias.\n\nEn la descripci\u00f3n de las variables de configuraci\u00f3n individuales, los valores obligatorios se marcan con corchetes angulares y los opcionales con corchetes. La notaci\u00f3n [...] se utiliza para indicar que los valores constituyen una lista de longitud arbitraria.
lazy-init=Habilitar/Inhabilitar la inicializaci\u00f3n lenta de c\u00f3digos de bytes ABC
link-report=Muestre un informe con formato XML de todas las definiciones vinculadas en la aplicaci\u00f3n.
load-config=cargue un archivo que contenga opciones de configuraci\u00f3n
load-externs=archivo XML que contiene los s\u00edmbolos <def>, <pre> y <ext> que se van a ignorar a partir de la vinculaci\u00f3n cuando se compile un SWF
metadata.contributor=Nombre de un colaborador que se va a almacenar en los metadatos de SWF
metadata.creator=Nombre de un creador que se va a almacenar en los metadatos de SWF
metadata.date=Fecha de creaci\u00f3n que se va a almacenar en los metadatos de SWF
metadata.description=Descripci\u00f3n predeterminada que se va a almacenar en los metadatos de SWF
metadata.language=Idioma que se va a almacenar en los metadatos de SWF (p. ej. EN, FR)
metadata.localized-description=Descripci\u00f3n de RDF/XMP traducida que se va a almacenar en los metadatos de SWF
metadata.localized-title=T\u00edtulo de RDF/XMP traducido que se va a almacenar en los metadatos de SWF
metadata.publisher=Nombre de un editor que se va a almacenar en los metadatos de SWF
metadata.title=T\u00edtulo predeterminado que se va a almacenar en los metadatos de SWF
output=nombre de archivo de la pel\u00edcula de SWF que se va a crear
raw-metadata=Texto XML que se va a almacenar en los metadatos de SWF (sobrescribe la configuraci\u00f3n de metadata.*)
runtime-shared-libraries=lista de direcciones URL de bibliotecas compartidas en tiempo de ejecuci\u00f3n que se van a cargar antes de que se inicie la aplicaci\u00f3n
size-report=Generar un informe con formato XML que detalle el tama\u00f1o de todo el c\u00f3digo y datos vinculados en la aplicaci\u00f3n.
use-network=cambie si el SWF est\u00e1 marcado para tener acceso a los recursos de la red
version=muestre la versi\u00f3n compilada del programa
warnings=cambie la presentaci\u00f3n de las advertencias

Syntax=Uso: ${program} [opciones de configuraci\u00f3n] [argumentos predeterminados]\n\nLas opciones de configuraci\u00f3n se pueden establecer en la l\u00ednea de comando como '-variable=value,value,value' o '-variable value value'. (El n\u00famero de valores exigido depende de la variable concreta). Las opciones de tipo booleano se pueden activar con '-variable=true' y desactivar con '-variable=false', con '-variable' como abreviaci\u00f3n de '-variable=true'. Las variables pueden eliminarse si se configura '-variable=' sin ning\u00fan valor despu\u00e9s del signo igual.\n\nLa lista de argumentos predeterminados es equivalente a establecer la variable '${defaultVar}'. La cadena especial '--' puede utilizarse para finalizar el proceso de las opciones de configuraci\u00f3n con nombre y para forzar la interpretaci\u00f3n de los valores restantes en la l\u00ednea de comandos como argumentos predeterminados.\n\nEn general, una variable determinada puede configurarse s\u00f3lo una vez, aunque un grupo de variables puede configurarse varias veces si se las incluye como 'repeatable' en su descripci\u00f3n; es decir, '-a=x,y,z' puede configurarse tambi\u00e9n como '-a=x -a=y -a=z' si 'a' se puede repetir. Una caracter\u00edstica m\u00e1s \u00fatil de las variables que se pueden repetir es que al utilizar la sintaxis especial '-variable+=value,value', los nuevos valores establecidos se anexar\u00e1n al valor actual, en lugar de reemplazar la lista de valores actual.\n\nLas variables de configuraci\u00f3n a veces tienen alias abreviados para que sean m\u00e1s f\u00e1ciles de escribir. Los nombres de variables con puntos jer\u00e1rquicos tendr\u00e1n autom\u00e1ticamente un alias generado para su nombre 'de hoja', si es \u00fanico.\n\nLos nombres de archivos especificados en la l\u00ednea de comandos deben ser una ruta de acceso absoluta o relativa al directorio actual.\n\nUtilice '${program} -help list' para mostrar las variables de configuraci\u00f3n disponibles.

AdvancedSyntax=Uso: ${program} [opciones de configuraci\u00f3n] [argumentos predeterminados]\n\nLas opciones de configuraci\u00f3n se pueden establecer en la l\u00ednea de comando como '-variable=value,value,value' o '-variable value value'. (El n\u00famero de valores exigido depende de la variable concreta). Las opciones de tipo booleano se pueden activar con '-variable=true' y desactivar con '-variable=false', con '-variable' como abreviaci\u00f3n de '-variable=true'. Las variables pueden eliminarse si se configura '-variable=' sin ning\u00fan valor despu\u00e9s del signo igual.\n\nLa lista de argumentos predeterminados es equivalente a establecer la variable '${defaultVar}'. La cadena especial '--' puede utilizarse para finalizar el proceso de las opciones de configuraci\u00f3n con nombre y para forzar la interpretaci\u00f3n de los valores restantes en la l\u00ednea de comandos como argumentos predeterminados.\n\nEn general, una variable determinada puede configurarse s\u00f3lo una vez, aunque un grupo de variables puede configurarse varias veces si se las incluye como 'repeatable' en su descripci\u00f3n; es decir, '-a=x,y,z' puede configurarse tambi\u00e9n como '-a=x -a=y -a=z' si 'a' se puede repetir. Una caracter\u00edstica m\u00e1s \u00fatil de las variables que se pueden repetir es que al utilizar la sintaxis especial '-variable+=value,value', los nuevos valores establecidos se anexar\u00e1n al valor actual, en lugar de reemplazar la lista de valores actual.\n\nLas variables de configuraci\u00f3n a veces tienen alias abreviados para que sean m\u00e1s f\u00e1ciles de escribir. Los nombres de variables con puntos jer\u00e1rquicos tendr\u00e1n autom\u00e1ticamente un alias generado para su nombre 'de hoja', si es \u00fanico.\n\nSi se encuentra una secuencia con formato $${token} en un valor de configuraci\u00f3n, \u00e9ste se expandir\u00e1 al valor del token. Todas las propiedades Java se tratan como tokens, pero los tokens tambi\u00e9n pueden establecerse mediante '+token=value' en la l\u00ednea de comandos.  La sustituci\u00f3n de tokens se limita a las cadenas simples aunque puede definirse recursivamente.\n\nLos nombres de archivos especificados en la l\u00ednea de comandos deben ser una ruta de acceso absoluta o relativa al directorio actual.\n\nUtilice '${program} -help list' para mostrar las variables de configuraci\u00f3n disponibles.

HelpKeywords=las palabras clave son 'syntax', 'list', 'advanced', 'aliases', 'details' o un t\u00e9rmino de b\u00fasqueda
Advanced=avanzado
Repeatable=que se puede repetir
Default=variable predeterminada
Alias=alias
FullName=nombre completo
NoKeywordsMatched=no existe coincidencia de palabras clave.
# note: do not localize the string -help, it has syntactic significance
Brief=${program} [opciones] [varPredeterminada]\nUse '${program}: ayuda' para obtener m\u00e1s informaci\u00f3n.\n\n

compiler.allow-source-path-overlap=comprueba si la entrada de la ruta de acceso de origen es un subdirectorio de otra entrada de ruta de acceso de origen. Ayuda a generar los nombres de paquete de los componentes MXML ambiguos.
compiler.debug=genera una pel\u00edcula adecuada para la depuraci\u00f3n
compiler.define=establezca una definici\u00f3n de compilaci\u00f3n condicional AS3\u00b7global, por ejemplo, -define=CONFIG::debugging,true o -define+=CONFIG::debugging,true (para anexar a definiciones existentes en flex-config.xml) 
compiler.defaults-css-url=define la ubicaci\u00f3n de la hoja de estilos predeterminada. Si se establece esta opci\u00f3n, se invalida el uso impl\u00edcito de la hoja de estilos defaults.css del archivo framework.swc.
compiler.fonts.max-cached-fonts=establece el n\u00famero m\u00e1ximo de fuentes que se va a conservar en la memoria cach\u00e9 del servidor. El valor predeterminado es 20.
compiler.fonts.max-glyphs-per-face=establece el n\u00famero m\u00e1ximo de esquemas de glifos de car\u00e1cter con el fin de conservar la memoria cach\u00e9 del servidor para cada tipo de fuente. El valor predeterminado es 1000.
compiler.fonts.flash-type=habilita FlashType para fuentes incrustadas. De esta forma, las fuentes peque\u00f1as son m\u00e1s claras.
compiler.fonts.advanced-anti-aliasing=Habilita el suavizado avanzado para fuentes incrustadas. De esta forma, las fuentes peque\u00f1as son m\u00e1s claras.
compiler.use-resource-bundle-metadata=determina si se incluyen los paquetes de recursos en la aplicaci\u00f3n.
compiler.warn-duplicate-variable-def=Duplique la definici\u00f3n de variable 
include-inheritance-dependencies-only=incluir s\u00f3lo dependencias de herencia de clases especificadas con include-classes 
resource-bundle-list=imprime una lista de los paquetes de recursos en un archivo para su inclusi\u00f3n en el compilador de compc con el fin de crear un archivo SWC de paquetes de recursos. 
licenses.license=especifica un producto y un n\u00famero de serie. 
remove-unused-rsls=quitar las RSL que la aplicaci\u00f3n no est\u00e9 usando
runtime-shared-library-path=especifica SWC con que vincular, una URL de RSL que cargar, con una URL de archivo de norma opcional y URL de conmutaci\u00f3n por error opcionales 
runtime-shared-library-settings.application-domain=se sustituye el dominio de aplicaci\u00f3n en que se carga una RSL. Los valores admitidos son 'current', 'default', 'parent' y 'top-level'.
runtime-shared-library-settings.force-rsls=obligar a que se cargue una RSL y se invalide la eliminaci\u00f3n provocada por el uso de la opci\u00f3n remove-unused-rsls
compute-digest=escribe un compendio en el catalog.xml de una biblioteca. Es necesario si la biblioteca se utilizar\u00e1 en la opci\u00f3n -runtime-shared-libraries-path.
static-link-runtime-shared-libraries=vincula estad\u00edsticamente las biblioteca especificadas por la opci\u00f3n -runtime-shared-libraries-path.
verify-digests=verifica si las bibliotecas cargadas en el tiempo de ejecuci\u00f3n son correctas.
target-player=especifica la versi\u00f3n del reproductor a la que est\u00e1 destinada la aplicaci\u00f3n. Las funciones que requieran una versi\u00f3n anterior no se compilar\u00e1n en la aplicaci\u00f3n. El valor m\u00ednimo admitido es "9.0.0".
swf-version=especifica la versi\u00f3n del archivo SWF compilado.
use-direct-blit=Use aceleraci\u00f3n de hardware, de estar disponible, para transferir los gr\u00e1ficos por bloques a la pantalla.
use-gpu=Use funciones de composici\u00f3n con GPU al dibujar gr\u00e1ficos, de estar disponible dicha aceleraci\u00f3n.
tools-locale=especifica la configuraci\u00f3n regional usada por el compilador al notificar errores y advertencias.

# asdoc options
doc-classes=lista de clases que deben incluirse en la documentaci\u00f3n.
doc-namespaces=lista de espacios de nombres que deben incluirse en la documentaci\u00f3n.
doc-sources=lista de archivos de origen que deben incluirse en la documentaci\u00f3n.
exclude-classes=lista de clases que deben excluirse de la documentaci\u00f3n.
exclude-dependencies=valor booleano que especifica si se deben excluir las dependencias.
footer=cadena de pie de p\u00e1gina que se mostrar\u00e1 en la documentaci\u00f3n.
left-frameset-width=anchura del marco izquierdo.
main-title=t\u00edtulo que se mostrar\u00e1 en la barra de t\u00edtulo.
templates-path=ruta para las plantillas personalizadas.
window-title=t\u00edtulo que se mostrar\u00e1 en la ventana del explorador.
lenient=Mostrar errores de HTML con formato correcto como advertencias.
packages.package=especifica una descripci\u00f3n para un nombre de paquete.
exclude-sources=lista de archivos de origen que deben excluirse de la documentaci\u00f3n.
examples-path=ruta de b\u00fasqueda para los archivos de ejemplo.
date-in-footer=especifica si se incluye la fecha en el pie de p\u00e1gina.
package-description-file=el archivo con la descripci\u00f3n de los paquetes.
