################################################################################
##
##  Licensed to the Apache Software Foundation (ASF) under one or more
##  contributor license agreements.  See the NOTICE file distributed with
##  this work for additional information regarding copyright ownership.
##  The ASF licenses this file to You under the Apache License, Version 2.0
##  (the "License"); you may not use this file except in compliance with
##  the License.  You may obtain a copy of the License at
##
##      http://www.apache.org/licenses/LICENSE-2.0
##
##  Unless required by applicable law or agreed to in writing, software
##  distributed under the License is distributed on an "AS IS" BASIS,
##  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
##  See the License for the specific language governing permissions and
##  limitations under the License.
##
################################################################################

benchmark=avalia\u00e7\u00e3o de desempenho de sa\u00edda
compiler.accessible=gerar um SWF acess\u00edvel
compiler.source-path=lista de elementos do caminho que formam as ra\u00edzes de hierarquias de classes ActionScript
compiler.actionscript-file-encoding=especifica a codifica\u00e7\u00e3o do arquivo actionscript. Se n\u00e3o houver um BOM nos arquivos de origem do AS3, o compilador usar\u00e1 essa codifica\u00e7\u00e3o de arquivo.
compiler.isolate-styles=permite que o aplicativo ou m\u00f3dulo compilado defina estilos que somente afetem a si mesmos e a seus filhos
compiler.context-root=caminho para substituir {context.root} tokens de extremidades de canais de servi\u00e7o
compiler.external-library-path=lista de arquivos ou diret\u00f3rios SWC a serem compilados ao v\u00ednculo, mas omitidos dele
compiler.fonts.languages.language-range=um intervalo para restringir o n\u00famero de glifos da fonte incorporados no SWF
compiler.fonts.managers=Classes do gerenciador de fontes do compilador, na ordem de resolu\u00e7\u00e3o da pol\u00edtica
compiler.fonts.local-fonts-snapshot=O arquivo que cont\u00e9m os dados de fontes do sistema produzidos por flex2.tools.FontSnapshot.
compiler.headless-server=um sinalizador para definir quando o Flex est\u00e1 em execu\u00e7\u00e3o em um servidor sem uma exibi\u00e7\u00e3o
compiler.include-libraries=uma lista de bibliotecas (SWCs) a serem totalmente inclu\u00eddas no SWF
compiler.incremental=ativa a compila\u00e7\u00e3o incremental
compiler.keep-all-type-selectors=desativa a remo\u00e7\u00e3o de seletores de tipos CSS n\u00e3o utilizados
compiler.keep-generated-actionscript=salvar arquivos de origem tempor\u00e1rios gerados durante a compila\u00e7\u00e3o do MXML
compiler.keep-generated-signatures=salva arquivos de assinatura gerados durante compila\u00e7\u00e3o AS3
compiler.keep-as3-metadata=mant\u00e9m os metadados especificados no SWF
compiler.library-path=lista de arquivos SWC ou diret\u00f3rios que cont\u00eam arquivos SWC
compiler.locale=especifica a localidade para internacionaliza\u00e7\u00e3o
compiler.mobile=especifica se o tempo de execu\u00e7\u00e3o de destino \u00e9 um dispositivo m\u00f3vel
compiler.mxml.compatibility-version=especifica uma vers\u00e3o compat\u00edvel, por exemplo, -compatibility-version=2.0.1
compiler.namespaces.namespace=Especificar um URI a ser associado a um manifesto de componentes para ser usado como elementos MXML
compiler.optimize=Ativar otimiza\u00e7\u00e3o do SWF p\u00f3s-link
compiler.preloader=Especifica o valor padr\u00e3o para o atributo do pr\u00e9-carregador do aplicativo. Se n\u00e3o especificado, o valor padr\u00e3o do pr\u00e9-carregador \u00e9 mx.preloaders.SparkDownloadProgressBar quando -compatibility-version for maior que ou igual a 4.0 e mx.preloaders.DownloadProgressBar quando -compatibility-version for menor que 4.0.
compiler.profile=gera um filme adequado para cria\u00e7\u00e3o de perfil de desempenho e mem\u00f3ria
compiler.services=caminho para o arquivo de configura\u00e7\u00e3o do Flex Data Services
compiler.omit-trace-statements=alternar se as declara\u00e7\u00f5es de acompanhamento s\u00e3o omitidas
compiler.report-invalid-styles-as-warnings=permite relatar estilos inv\u00e1lidos como avisos
compiler.report-missing-required-skin-parts-as-warnings=Use esta op\u00e7\u00e3o para gerar um aviso, em vez de um erro, quando \u00e9 detectada a aus\u00eancia de uma parte de capa necess\u00e1ria.
compiler.show-invalid-css-property-warnings=alternar se avisos de propriedade css inv\u00e1lida forem relatados
compiler.show-binding-warnings=alternar se os avisos gerados do c\u00f3digo do v\u00ednculo de dados forem exibidos
compiler.show-actionscript-warnings=executa o compilador AS3 em um modo que detecta c\u00f3digo legal, mas possivelmente incorreto
compiler.show-dependency-warnings=mostrar avisos quando as depend\u00eancias n\u00e3o puderem ser determinadas no momento da compila\u00e7\u00e3o
compiler.show-deprecation-warnings=alternar se o uso de APIs obsoletas gerar um aviso
compiler.show-shadowed-device-font-warnings=alterna a exibi\u00e7\u00e3o ou n\u00e3o de avisos quando um nome de fonte incorporada cria uma sombra em um nome de fonte de dispositivo
compiler.show-unused-type-selector-warnings=alterna a exibi\u00e7\u00e3o ou n\u00e3o dos avisos gerados por seletores de tipos CSS n\u00e3o utilizados
compiler.signature-directory=diret\u00f3rio [relative/absolute] no qual assinaturas as3 geradas s\u00e3o salvas
compiler.strict=executa o compilador AS3 em modo de verifica\u00e7\u00e3o de erro restrita.
compiler.as3=use o modelo de objeto baseado na classe ActionScript 3 para obter melhor desempenho e melhor cria\u00e7\u00e3o de relat\u00f3rio de erros. No modelo de objeto baseado na classe, a maioria das fun\u00e7\u00f5es incorporadas \u00e9 implementada como m\u00e9todos de classes fixos.
compiler.es=use o modelo do objeto baseado no prot\u00f3tipo do ECMAScript edi\u00e7\u00e3o 3 para permitir a substitui\u00e7\u00e3o din\u00e2mica de propriedades do prot\u00f3tipo. No modelo do objeto baseado no prot\u00f3tipo, as fun\u00e7\u00f5es incorporadas s\u00e3o implementadas como propriedades din\u00e2micas de objetos do prot\u00f3tipo.
compiler.theme=lista de arquivos CSS ou SWC a serem aplicados como um tema
compiler.verbose-stacktraces=salvar informa\u00e7\u00f5es sobre a pilha de chamadas no SWF para depura\u00e7\u00e3o
compiler.memory-usage-factor=especifica o fator de uso da mem\u00f3ria do compilador; o padr\u00e3o \u00e9 1.000.
compiler.conservative=usa o algoritmo conservador para compilar. N\u00e3o recomendado para aplicativos grandes. O padr\u00e3o \u00e9 falso.
compiler.warn-array-tostring-changes=O formato Array.toString() foi alterado.
compiler.warn-assignment-within-conditional=Atribui\u00e7\u00e3o na condicional.
compiler.warn-bad-array-cast=Opera\u00e7\u00e3o de convers\u00e3o de matriz possivelmente inv\u00e1lida.
compiler.warn-bad-bool-assignment=Valor n\u00e3o-booliano usado onde um valor booliano era esperado.
compiler.warn-bad-date-cast=Opera\u00e7\u00e3o de convers\u00e3o da data inv\u00e1lida.
compiler.warn-bad-es3-type-method=M\u00e9todo desconhecido.
compiler.warn-bad-es3-type-prop=Propriedade desconhecida.
compiler.warn-bad-nan-comparison=Compara\u00e7\u00e3o il\u00f3gica com NaN. Qualquer opera\u00e7\u00e3o de compara\u00e7\u00e3o que envolva NaN ser\u00e1 avaliada como falsa, pois NaN != NaN.
compiler.warn-bad-null-assignment=Imposs\u00edvel atribuir como nulo.
compiler.warn-bad-null-comparison=Compara\u00e7\u00e3o il\u00f3gica com nulo.
compiler.warn-bad-undefined-comparison=Compara\u00e7\u00e3o il\u00f3gica com indefinido. Somente vari\u00e1veis sem tipo (ou vari\u00e1veis do tipo *) podem ser indefinidas.
compiler.warn-boolean-constructor-with-no-args=Boolean() sem argumentos retorna false no ActionScript 3.0. Boolean() retornou undefined no ActionScript 2.0.
compiler.warn-changes-in-resolve=N\u00e3o h\u00e1 mais suporte para __resolve.
compiler.warn-class-is-sealed=A classe est\u00e1 lacrada. N\u00e3o \u00e9 poss\u00edvel adicionar membros dinamicamente a ela.
compiler.warn-const-not-initialized=Constante n\u00e3o inicializada.
compiler.warn-constructor-returns-value=A fun\u00e7\u00e3o usada na nova express\u00e3o retorna um valor. O resultado ser\u00e1 o que a fun\u00e7\u00e3o retornar, em vez de uma nova inst\u00e2ncia dessa fun\u00e7\u00e3o.
compiler.warn-deprecated-event-handler-error=EventHandler n\u00e3o foi adicionado como uma escuta.
compiler.warn-deprecated-function-error=N\u00e3o h\u00e1 suporte para a fun\u00e7\u00e3o do ActionScript 2.0.
compiler.warn-deprecated-property-error=N\u00e3o h\u00e1 suporte para a propriedade do ActionScript 2.0.
compiler.warn-duplicate-argument-names=Mais de um argumento com o mesmo nome.
compiler.warn-for-var-in-changes=O ActionScript 3.0 repete aleatoriamente as propriedades de um objeto em uma declara\u00e7\u00e3o "for x in target".
compiler.warn-import-hides-class=Importar um pacote com o mesmo nome que a classe atual ocultar\u00e1 o identificador da classe nesse escopo.
compiler.warn-instance-of-changes=Uso do operador instanceof.
compiler.warn-internal-error=Erro interno no compilador.
compiler.warn-level-not-supported=N\u00e3o h\u00e1 mais suporte para _level. Para obter mais informa\u00e7\u00f5es, consulte o pacote flash.display.
compiler.warn-missing-namespace-decl=Declara\u00e7\u00e3o de namespace ausente (por exemplo, a vari\u00e1vel n\u00e3o est\u00e1 definida como p\u00fablica, particular etc.).
compiler.warn-negative-uint-literal=Valor negativo se tornar\u00e1 um valor positivo grande quando atribu\u00eddo a um tipo de dados da unidade.
compiler.warn-no-constructor=Construtor ausente.
compiler.warn-no-explicit-super-call-in-constructor=A declara\u00e7\u00e3o super() n\u00e3o foi chamada dentro do construtor.
compiler.warn-no-type-decl=Declara\u00e7\u00e3o de tipo ausente.
compiler.warn-number-from-string-changes=No ActionScript 3.0, o espa\u00e7o em branco ser\u00e1 ignorado e '' retornar\u00e1 0. Number() retornar\u00e1 NaN no ActionScript 2.0 quando o par\u00e2metro for '' ou contiver espa\u00e7o em branco.
compiler.warn-scoping-change-in-this=Altera\u00e7\u00e3o no escopo desta palavra-chave. Os m\u00e9todos de classe extra\u00eddos da inst\u00e2ncia de uma classe sempre resolver\u00e3o isso voltando a essa inst\u00e2ncia. No ActionScript 2.0, isso \u00e9 consultado dinamicamente com base no m\u00e9todo a partir do qual ele \u00e9 chamado.
compiler.warn-slow-text-field-addition=Uso ineficaz de += em um TextField.
compiler.warn-unlikely-function-value=Par\u00eanteses possivelmente ausentes.
compiler.warn-xml-class-has-changed=Uso poss\u00edvel da classe XML do ActionScript 2.0.
debug-password=a senha a ser inclu\u00edda nos SWFs depur\u00e1veis
default-background-color=cor de fundo padr\u00e3o (pode ser substitu\u00edda pelo c\u00f3digo do aplicativo)
default-frame-rate=taxa de quadros padr\u00e3o a ser usada no SWF.
default-script-limits=limites de execu\u00e7\u00e3o do script padr\u00e3o (pode ser substitu\u00eddo por atributos raiz)
default-size=tamanho do aplicativo padr\u00e3o (pode ser substitu\u00eddo por atributos raiz no aplicativo)
dependency-info=informa\u00e7\u00f5es sobre depend\u00eancia da classe de sa\u00edda
dependency.minimize-dependency-set=remove um SWC do conjunto de depend\u00eancias se os scripts resolvidos no SWC forem um subconjunto dos scripts resolvidos em outro SWC dependente.  
dependency.show-external-classes=definido como true para exibir as classes de script que causam depend\u00eancias de inter-SWC (o padr\u00e3o \u00e9 false).
dependency.show-swcs=lista de nomes SWC, um caminho completo n\u00e3o \u00e9 obrigat\u00f3rio. As informa\u00e7\u00f5es de depend\u00eancia somente ser\u00e3o exibidas para os SWC especificados e n\u00e3o afetam a an\u00e1lise da depend\u00eancia.
dependency.show-types=definido como true para exibir os tipos de depend\u00eancia de classes de script (o padr\u00e3o \u00e9 false).
dependency.types=uma lista de tipos de depend\u00eancia para restringir as classes usadas para determinar depend\u00eancias do SWC. Os valores poss\u00edveis s\u00e3o i,s,n e e. O padr\u00e3o \u00e9 o uso de todos os tipos de depend\u00eancia.
digest.rsl-file=localiza\u00e7\u00e3o do RSL para computar a compila\u00e7\u00e3o de
digest.swc-path=caminho do arquivo ou diret\u00f3rio swc onde a compila\u00e7\u00e3o ser\u00e1 atualizada
directory=sa\u00edda da biblioteca como um diret\u00f3rio aberto e n\u00e3o um arquivo SWC
dump-config=gravar um arquivo que cont\u00e9m todos os valores de configura\u00e7\u00e3o definidos atualmente em um formato adequado para uso como um arquivo de configura\u00e7\u00e3o flex
externs=uma lista de s\u00edmbolos a serem omitidos do v\u00ednculo ao construir um SWF
includes=uma lista de s\u00edmbolos a serem sempre vinculados ao construir um SWF
include-classes=uma lista de classes a ser inclu\u00edda na sa\u00edda SWC
include-file=uma lista de arquivos nomeados a ser inclu\u00edda na sa\u00edda SWC
include-lookup-only=se true, entradas de manifesto com lookupOnly=true s\u00e3o inclu\u00eddas no cat\u00e1logo SWC. O padr\u00e3o \u00e9 false.
include-namespaces=todas as classes nos namespaces listados s\u00e3o inclu\u00eddas na sa\u00edda SWC
include-resource-bundles=uma lista de pacotes de recursos a ser inclu\u00edda na sa\u00edda SWC
include-sources=uma lista diret\u00f3rios e arquivos de origem a ser inclu\u00edda na sa\u00edda SWC
include-stylesheet=uma lista de recursos de stylesheet nomeados a ser inclu\u00edda na sa\u00edda SWC
file-specs=uma lista de arquivos de origem a serem compilados; o \u00faltimo arquivo especificado ser\u00e1 usado como o aplicativo de destino
frames.frame=Um r\u00f3tulo do quadro SWF com uma sequ\u00eancia de nomes de classes que ser\u00e1 vinculada ao quadro.
generate-frame-loader=alternar gera\u00e7\u00e3o de uma classe do carregador derivada de IFlexModuleFactory
help=Para obter informa\u00e7\u00f5es sobre sintaxe de linhas de comando e descri\u00e7\u00f5es de vari\u00e1veis de configura\u00e7\u00e3o, especifique uma sequ\u00eancia de pesquisa ou uma das palavras-chave a seguir:\n   syntax - descrever a sintaxe geral da linha de comando\n   list - mostrar uma lista de todas as vari\u00e1veis de configura\u00e7\u00e3o dispon\u00edveis\n   advanced - corresponder tamb\u00e9m vari\u00e1veis de configura\u00e7\u00e3o avan\u00e7adas\n   aliases - classificar usando o alias abreviado da vari\u00e1vel\n   details - sempre exibir os detalhes completos de cada item\nQualquer outra palavra-chave de ajuda fornecida \u00e9 usada para corresponder uma vari\u00e1vel de configura\u00e7\u00e3o total ou parcial, alias ou texto a serem pesquisados na descri\u00e7\u00e3o da vari\u00e1vel de configura\u00e7\u00e3o.\n\nPor exemplo, '-help advanced aliases foo' mostraria todas as op\u00e7\u00f5es de configura\u00e7\u00e3o (b\u00e1sicas e avan\u00e7adas) que contenham o texto 'foo', classificadas pelo nome do alias.\n\nNa descri\u00e7\u00e3o de vari\u00e1veis de configura\u00e7\u00e3o individuais, os valores necess\u00e1rios s\u00e3o marcados com sinais de maior e menor, e os valores opcionais s\u00e3o marcados com colchetes. A nota\u00e7\u00e3o [...] \u00e9 usada para indicar que os valores s\u00e3o uma lista de tamanho arbitr\u00e1rio.
lazy-init=Ativar/desativar inicializa\u00e7\u00e3o lenta do c\u00f3digo de bytes ABC
link-report=Emite a sa\u00edda de um relat\u00f3rio formatado como XML de todas as defini\u00e7\u00f5es vinculadas ao aplicativo.
load-config=carregar um arquivo que contenha op\u00e7\u00f5es de configura\u00e7\u00e3o
load-externs=um arquivo XML que contenha os s\u00edmbolos <def>, <pre> e <ext> a serem omitidos do v\u00ednculo ao construir um SWF
metadata.contributor=O nome de um contribuinte a ser armazenado nos metadados do SWF
metadata.creator=O nome de um criador a ser armazenado nos metadados do SWF
metadata.date=A data de cria\u00e7\u00e3o a ser armazenada nos metadados do SWF
metadata.description=A descri\u00e7\u00e3o padr\u00e3o a ser armazenada nos metadados do SWF
metadata.language=O idioma a ser armazenado nos metadados do SWF (ou seja, EN, FR)
metadata.localized-description=Uma descri\u00e7\u00e3o de RDF/XMP localizada a ser armazenada nos metadados do SWF
metadata.localized-title=Um t\u00edtulo de RDF/XMP localizado a ser armazenado nos metadados do SWF
metadata.publisher=O nome de um editor a ser armazenado nos metadados do SWF
metadata.title=O t\u00edtulo padr\u00e3o a ser armazenado nos metadados do SWF
output=o nome do arquivo do filme do SWF a ser criado
raw-metadata=Texto XML a ser armazenado nos metadados do SWF (substitui a configura\u00e7\u00e3o de metadados.*)
runtime-shared-libraries=uma lista de URLs da biblioteca compartilhada de tempo de execu\u00e7\u00e3o a ser carregada antes de iniciar o aplicativo
size-report=Produz um relat\u00f3rio no formato XML detalhando o tamanho de todos os c\u00f3digos e dados vinculados ao aplicativo.
use-network=alternar se o SWF estiver sinalizado para acessar recursos da rede
version=exibir a vers\u00e3o de compila\u00e7\u00e3o do programa
warnings=alternar a exibi\u00e7\u00e3o de avisos

Syntax=Uso: ${program} [op\u00e7\u00f5es de configura\u00e7\u00e3o] [argumentos padr\u00e3o]\n\nAs op\u00e7\u00f5es de configura\u00e7\u00e3o podem ser definidas na linha de comando como '-vari\u00e1vel=valor,valor,valor'. (O n\u00famero de valores necess\u00e1rio depende da vari\u00e1vel.) Op\u00e7\u00f5es boolianas podem ser ativadas com '-vari\u00e1vel=true' e desativadas com '-vari\u00e1vel=false', sendo '-vari\u00e1vel' a abrevia\u00e7\u00e3o de '-vari\u00e1vel=true'. Vari\u00e1veis podem ser limpas definindo-se '-vari\u00e1vel=' sem valor seguida de um sinal de igual.\n\nA lista de argumentos padr\u00e3o \u00e9 equivalente a definir a vari\u00e1vel '${defaultVar}'. A sequ\u00eancia especial '--' pode ser usada para terminar o processamento de op\u00e7\u00f5es de configura\u00e7\u00e3o nomeadas e para for\u00e7ar os valores restantes na linha de comando a serem interpretados como argumentos padr\u00e3o.\n\nEm geral, uma determinada vari\u00e1vel pode ser definida somente uma vez, mas algumas vari\u00e1veis podem ser definidas v\u00e1rias vezes se anotadas como 'repet\u00edveis' na descri\u00e7\u00e3o, ou seja '-a=x,y,z' tamb\u00e9m pode ser definida como '-a=x -a=y -a=z' se 'a' for repet\u00edvel. Uma caracter\u00edstica mais \u00fatil de vari\u00e1veis repet\u00edveis \u00e9 que, usando-se a sintaxe especial '-vari\u00e1vel+=valor,valor', os novos valores definidos ser\u00e3o acrescentados ao valor atual, em vez de substitu\u00edrem a lista de valores atuais.\n\nVari\u00e1veis de configura\u00e7\u00e3o \u00e0s vezes t\u00eam aliases abreviados para facilitar sua digita\u00e7\u00e3o. Nomes de vari\u00e1veis pontilhados hier\u00e1rquicas receber\u00e3o automaticamente um alias para o nome de 'folha', se forem exclusivos.\n\nNomes de arquivos especificados na linha de comando devem ser um caminho absoluto ou relativo para o diret\u00f3rio atual.\n\nUse '${program} -help list' para listar vari\u00e1veis de configura\u00e7\u00e3o dispon\u00edveis.

AdvancedSyntax=Uso: ${program} [op\u00e7\u00f5es de configura\u00e7\u00e3o] [argumentos padr\u00e3o]\n\nAs op\u00e7\u00f5es de configura\u00e7\u00e3o podem ser definidas na linha de comando como '-vari\u00e1vel=valor,valor,valor' ou '-vari\u00e1vel valor valor'. O n\u00famero de valores necess\u00e1rios depende da vari\u00e1vel.) Express\u00f5es boolianas podem ser ativadas com '-vari\u00e1vel=true' e desativadas com '-vari\u00e1vel=false', sendo '-vari\u00e1vel' abrevia\u00e7\u00e3o de '-vari\u00e1vel=true'. As vari\u00e1veis podem ser limpas definindo-se '-vari\u00e1vel=' sem valor ap\u00f3s o sinal de igual.\n\nA lista padr\u00e3o de argumentos equivale a definir a vari\u00e1vel '${defaultVar}'. A sequ\u00eancia especial '--' pode ser usada para terminar o processamento de op\u00e7\u00f5es de configura\u00e7\u00e3o nomeadas e para for\u00e7ar os valores restantes na linha de comando a serem interpretados como argumentos padr\u00e3o.\n\nEm geral, uma vari\u00e1vel pode ser definida somente uma vez, mas algumas vari\u00e1veis podem ser definidas v\u00e1rias vezes se anotadas como 'repet\u00edveis' em sua descri\u00e7\u00e3o; ou seja, '-a=x,y,z' tamb\u00e9m pode ser definida como '-a=x -a=y -a=z' se 'a' for repet\u00edvel. Uma caracter\u00edstica mais \u00fatil de vari\u00e1veis repet\u00edveis \u00e9 que, usando-se a sintaxe especial '-vari\u00e1vel+=valor,valor', o novo conjunto de valores ser\u00e1 acrescentado ao valor atual, em vez de substituir a lista de valores atual.\n\nVari\u00e1veis de configura\u00e7\u00e3o \u00e0s vezes t\u00eam aliases abreviados para facilitar a digita\u00e7\u00e3o. Nomes de vari\u00e1veis pontilhados hier\u00e1rquicos receber\u00e3o um alias gerado automaticamente para seu nome de 'folha', se for exclusivo.\n\nSe uma sequ\u00eancia formatada como $${token} encontrar-se em um valor de configura\u00e7\u00e3o, ela ser\u00e1 expandida para o valor do token. Todas as propriedades de Java s\u00e3o tratadas como tokens, mas tokens tamb\u00e9m podem ser definidos usando-se '+token=valor' na linha de comando. A substitui\u00e7\u00e3o de tokens limita-se a sequ\u00eancias \u00fanicas, mas pode ser definida recursivamente.\n\nNomes de arquivos especificados na linha de comando devem ser um caminho absoluto ou relativo ao diret\u00f3rio atual.\n\nUse '${program} -help list' para listar vari\u00e1veis de configura\u00e7\u00e3o dispon\u00edveis.

HelpKeywords=as palavras-chaves s\u00e3o 'syntax', 'list', 'advanced', 'aliases', 'details' ou um termo de pesquisa
Advanced=avan\u00e7ado
Repeatable=repet\u00edvel
Default=vari\u00e1vel padr\u00e3o
Alias=alias
FullName=nome completo
NoKeywordsMatched=nenhuma palavra-chave correspondente.
# note: do not localize the string -help, it has syntactic significance
Brief=${program} [options] [defaultVar]\nUse '${program} -help' para obter mais informa\u00e7\u00f5es.\n\n

compiler.allow-source-path-overlap=verifica se uma entrada de caminho de origem \u00e9 um subdiret\u00f3rio de outra entrada de caminho. Ela ajuda a criar os nomes de pacotes de componentes MXML sem ambiguidade.
compiler.debug=gera um filme adequado para depura\u00e7\u00e3o
compiler.define=estabelece uma defini\u00e7\u00e3o de compila\u00e7\u00e3o condicional AS3 global, por exemplo -define=CONFIG::debugging,true or -define+=CONFIG::debugging,true (para anexar a defini\u00e7\u00f5es existentes em flex-config.xml) 
compiler.defaults-css-url=define o local da folha de estilos padr\u00e3o. A defini\u00e7\u00e3o dessa op\u00e7\u00e3o substitui o uso impl\u00edcito da folha de estilos defaults.css no arquivo framework.swc.
compiler.fonts.max-cached-fonts=define o n\u00famero m\u00e1ximo de fontes a serem mantidas no cache do servidor. O valor padr\u00e3o \u00e9 20.
compiler.fonts.max-glyphs-per-face=define o n\u00famero m\u00e1ximo de esbo\u00e7os de glifos de caracteres a serem mantidos no cache do servidor para cada face da fonte. O valor padr\u00e3o \u00e9 1.000.
compiler.fonts.flash-type=ativa o FlashType para fontes incorporadas, o que proporciona maior clareza para fontes pequenas.
compiler.fonts.advanced-anti-aliasing=ativa antialiases avan\u00e7ados para fontes incorporadas, o que proporciona maior clareza para fontes pequenas.
compiler.use-resource-bundle-metadata=determina se os pacotes de recursos est\u00e3o inclu\u00eddos no aplicativo.
compiler.warn-duplicate-variable-def=Defini\u00e7\u00e3o de vari\u00e1vel duplicada 
include-inheritance-dependencies-only=somente inclui depend\u00eancias de heran\u00e7a de classes especificadas com include-classes 
resource-bundle-list=imprime uma lista de pacotes de recursos em um arquivo para entrada no compilador compc para criar um arquivo SWC do pacote de recursos. 
licenses.license=especifica um produto e um n\u00famero de s\u00e9rie. 
remove-unused-rsls=remove RSLs que n\u00e3o est\u00e3o sendo usados pelo aplicativo
runtime-shared-library-path=especifica um SWC para ser vinculado contra, o carregamento de um URL de RSL, com um URL de arquivo de diretiva opcional e URLs de failover opcionais 
runtime-shared-library-settings.application-domain=substitui o dom\u00ednio do aplicativo no qual um RSL \u00e9 carregado. Os valores com suporte s\u00e3o 'current', 'default', 'parent' ou 'top-level'.
runtime-shared-library-settings.force-rsls=for\u00e7a o carregamento de um RSL, substituindo a remo\u00e7\u00e3o causada pelo uso da op\u00e7\u00e3o remove-unused-rsls
compute-digest=grava uma compila\u00e7\u00e3o em catalog.xml de uma biblioteca. Isso \u00e9 necess\u00e1rio quando a biblioteca \u00e9 usada na op\u00e7\u00e3o -runtime-shared-libraries-path.
static-link-runtime-shared-libraries=vincular estaticamente as bibliotecas especificadas pela op\u00e7\u00e3o -runtime-shared-libraries-path.
verify-digests=confirma as bibliotecas carregadas no tempo de execu\u00e7\u00e3o como corretas.
target-player=especifica a vers\u00e3o do player de destino do aplicativo. Recursos que exijam uma vers\u00e3o posterior n\u00e3o ser\u00e3o compilados no aplicativo. O valor m\u00ednimo suportado \u00e9 "9.0.0".
swf-version=especifica a vers\u00e3o do arquivo SWF compilado.
use-direct-blit=Use a acelera\u00e7\u00e3o de hardware para transferir gr\u00e1ficos de blit para a tela, onde tal acelera\u00e7\u00e3o est\u00e1 dispon\u00edvel.
use-gpu=Use recursos de composi\u00e7\u00e3o de GPU ao desenhar gr\u00e1ficos, onde tal acelera\u00e7\u00e3o est\u00e1 dispon\u00edvel.
tools-locale=especifica a localidade usada pelo compilador quando relata erros e avisos.

# asdoc options
doc-classes=lista de classes a ser inclu\u00edda na documenta\u00e7\u00e3o.
doc-namespaces=lista de namespaces a ser inclu\u00edda na documenta\u00e7\u00e3o.
doc-sources=lista de arquivos de origem a ser inclu\u00edda na documenta\u00e7\u00e3o.
exclude-classes=lista de classes a ser exclu\u00edda da documenta\u00e7\u00e3o.
exclude-dependencies=booliano que especifica se depend\u00eancias s\u00e3o exclu\u00eddas.
footer=string de rodap\u00e9 a ser exibida na documenta\u00e7\u00e3o.
left-frameset-width=largura do quadro esquerdo.
main-title=t\u00edtulo a ser exibido na barra de t\u00edtulo.
templates-path=caminho para modelos personalizados.
window-title=t\u00edtulo a ser exibido na janela do navegador.
lenient=Relatar erros de HTML bem-formados como avisos.
packages.package=especifica uma descri\u00e7\u00e3o para um nome de pacote.
exclude-sources=lista de arquivos de origem a ser exclu\u00edda da documenta\u00e7\u00e3o.
examples-path=caminho para procurar os arquivos de exemplo.
date-in-footer=especifica se uma data \u00e9 inclu\u00edda no rodap\u00e9.
package-description-file=arquivo que cont\u00e9m descri\u00e7\u00e3o de pacotes.
