################################################################################
##
##  Licensed to the Apache Software Foundation (ASF) under one or more
##  contributor license agreements.  See the NOTICE file distributed with
##  this work for additional information regarding copyright ownership.
##  The ASF licenses this file to You under the Apache License, Version 2.0
##  (the "License"); you may not use this file except in compliance with
##  the License.  You may obtain a copy of the License at
##
##      http://www.apache.org/licenses/LICENSE-2.0
##
##  Unless required by applicable law or agreed to in writing, software
##  distributed under the License is distributed on an "AS IS" BASIS,
##  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
##  See the License for the specific language governing permissions and
##  limitations under the License.
##
################################################################################

benchmark=\ucd9c\ub825 \uc131\ub2a5 \ubca4\uce58\ub9c8\ud06c
compiler.accessible=\uc561\uc138\uc2a4 \uac00\ub2a5\ud55c SWF \uc0dd\uc131
compiler.source-path=ActionScript \ud074\ub798\uc2a4 \uacc4\uce35 \uad6c\uc870\uc758 \ub8e8\ud2b8\ub97c \ud615\uc131\ud558\ub294 \uacbd\ub85c \uc694\uc18c \ubaa9\ub85d
compiler.actionscript-file-encoding=ActionScript \ud30c\uc77c \uc778\ucf54\ub529\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. AS3 \uc18c\uc2a4 \ud30c\uc77c\uc5d0 BOM\uc774 \uc5c6\ub294 \uacbd\uc6b0 \ucef4\ud30c\uc77c\ub7ec\uc5d0\uc11c \uc774 \ud30c\uc77c \uc778\ucf54\ub529\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4.
compiler.isolate-styles=\ucef4\ud30c\uc77c\ub41c \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub610\ub294 \ubaa8\ub4c8\uc5d0\uc11c \uc790\uc2e0\uacfc \ud558\uc704 \ud56d\ubaa9\uc5d0\uac8c\ub9cc \uc601\ud5a5\uc744 \uc8fc\ub294 \uc2a4\ud0c0\uc77c\uc744 \uc124\uc815\ud560 \uc218 \uc788\ub3c4\ub85d \ud569\ub2c8\ub2e4.
compiler.context-root=\uc11c\ube44\uc2a4 \ucc44\ub110 \uc885\uc810\uc5d0 \ub300\ud55c {context.root} \ud1a0\ud070\uc744 \ub300\uccb4\ud558\uae30 \uc704\ud55c \uacbd\ub85c
compiler.external-library-path=\ucef4\ud30c\uc77c\ud558\uc9c0\ub9cc \ub9c1\ud06c\ud558\uc9c0 \uc54a\uc744 SWC \ud30c\uc77c \ub610\ub294 \ub514\ub809\ud1a0\ub9ac \ubaa9\ub85d
compiler.fonts.languages.language-range=SWF\uc5d0 \ud3ec\ud568\ub41c \uae00\uaf34 \uae00\ub9ac\ud504 \uc218\ub97c \uc81c\ud55c\ud558\uae30 \uc704\ud55c \ubc94\uc704
compiler.fonts.managers=\ucef4\ud30c\uc77c\ub7ec \uae00\uaf34 \uad00\ub9ac\uc790 \ud074\ub798\uc2a4(\uc815\ucc45 \uacb0\uc815 \uc21c)
compiler.fonts.local-fonts-snapshot=flex2.tools.FontSnapshot\uc5d0\uc11c \uc0dd\uc131\ub41c \uc2dc\uc2a4\ud15c \uae00\uaf34 \ub370\uc774\ud130\ub97c \ud3ec\ud568\ud55c \ud30c\uc77c
compiler.headless-server=Flex\uac00 \ub514\uc2a4\ud50c\ub808\uc774 \uc5c6\uc774 \uc11c\ubc84\uc5d0\uc11c \uc2e4\ud589\ub418\ub294 \uacbd\uc6b0 \uc124\uc815\ud558\uae30 \uc704\ud55c \ud50c\ub798\uadf8
compiler.include-libraries=SWF\uc5d0 \uc644\uc804\ud788 \ud3ec\ud568\ud560 \ub77c\uc774\ube0c\ub7ec\ub9ac(SWC) \ubaa9\ub85d
compiler.incremental=\uc99d\ubd84 \ucef4\ud30c\uc77c\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4.
compiler.keep-all-type-selectors=\uc0ac\uc6a9\ub418\uc9c0 \uc54a\ub294 CSS \uc720\ud615 \uc120\ud0dd\uae30 \uc81c\uc678\ub97c \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
compiler.keep-generated-actionscript=MXML \ucef4\ud30c\uc77c \uc911\uc5d0 \uc0dd\uc131\ub41c \uc784\uc2dc \uc18c\uc2a4 \ud30c\uc77c\uc744 \uc800\uc7a5\ud569\ub2c8\ub2e4.
compiler.keep-generated-signatures=AS3 \ucef4\ud30c\uc77c \uc911\uc5d0 \uc0dd\uc131\ub41c \uc11c\uba85 \ud30c\uc77c\uc744 \uc800\uc7a5\ud569\ub2c8\ub2e4.
compiler.keep-as3-metadata=\uc9c0\uc815\ub41c \uba54\ud0c0\ub370\uc774\ud130\ub97c SWF\uc5d0 \uc800\uc7a5\ud569\ub2c8\ub2e4.
compiler.library-path=SWC \ud30c\uc77c \ub610\ub294 SWC \ud30c\uc77c\uc744 \ud3ec\ud568\ud55c \ub514\ub809\ud1a0\ub9ac \ubaa9\ub85d
compiler.locale=\ub2e4\uad6d\uc5b4 \uae30\ub2a5\uc744 \uc704\ud55c \ub85c\ucf00\uc77c\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4.
compiler.mobile=\ub300\uc0c1 \ub7f0\ud0c0\uc784\uc744 \ubaa8\ubc14\uc77c \uc7a5\uce58\ub85c \uc9c0\uc815\ud569\ub2c8\ub2e4.
compiler.mxml.compatibility-version=\ud638\ud658\uc131 \ubc84\uc804\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc608: -compatibility-version=2.0.1
compiler.namespaces.namespace=MXML\uc5d0 \uc0ac\uc6a9\ud558\uae30 \uc704\ud574 \uad6c\uc131 \uc694\uc18c \ub9e4\ub2c8\ud398\uc2a4\ud2b8\uc5d0 \uc5f0\uacb0\ud560 URI\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4.
compiler.optimize=\ub9c1\ud06c \ud6c4 SWF \ucd5c\uc801\ud654\ub97c \uc0ac\uc6a9\ud569\ub2c8\ub2e4.
compiler.preloader=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc758 \ud504\ub9ac\ub85c\ub354 \ud2b9\uc131\uc5d0 \ub300\ud55c \uae30\ubcf8\uac12\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc9c0\uc815\ud558\uc9c0 \uc54a\uc73c\uba74 \uae30\ubcf8 \ud504\ub9ac\ub85c\ub354 \uac12\uc740 -compatibility-version >= 4.0\uc778 \uacbd\uc6b0 mx.preloaders.SparkDownloadProgressBar\uc774\uace0, -compatibility-version < 4.0\uc778 \uacbd\uc6b0 mx.preloaders.DownloadProgressBar\uc785\ub2c8\ub2e4.
compiler.profile=\uc131\ub2a5 \ubc0f \uba54\ubaa8\ub9ac \ud504\ub85c\ud30c\uc77c\ub9c1\uc5d0 \uc801\ud569\ud55c \ub3d9\uc601\uc0c1\uc744 \uc0dd\uc131\ud569\ub2c8\ub2e4.
compiler.services=Flex Data Services \uad6c\uc131 \ud30c\uc77c \uacbd\ub85c
compiler.omit-trace-statements=\ucd94\uc801 \uba85\ub839\ubb38\uc744 \uc81c\uc678\ud560\uc9c0 \uc5ec\ubd80\ub97c \ud1a0\uae00\ud569\ub2c8\ub2e4.
compiler.report-invalid-styles-as-warnings=\uc798\ubabb\ub41c \uc2a4\ud0c0\uc77c\uc744 \uacbd\uace0\ub85c \ubcf4\uace0\ud560 \uc218 \uc788\ub3c4\ub85d \ud569\ub2c8\ub2e4.
compiler.report-missing-required-skin-parts-as-warnings=\ub204\ub77d\ub41c \ud544\uc218 \uc2a4\ud0a8 \ubd80\ubd84\uc774 \ubc1c\uacac\ub420 \uacbd\uc6b0 \uc624\ub958 \ub300\uc2e0 \uacbd\uace0\ub97c \uc0dd\uc131\ud558\ub824\uba74 \uc774 \uc635\uc158\uc744 \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.
compiler.show-invalid-css-property-warnings=\uc798\ubabb\ub41c css \uc18d\uc131 \uacbd\uace0\ub97c \ubcf4\uace0\ud560\uc9c0 \uc5ec\ubd80\ub97c \ud1a0\uae00\ud569\ub2c8\ub2e4.
compiler.show-binding-warnings=\ub370\uc774\ud130 \ubc14\uc778\ub529 \ucf54\ub4dc\uc5d0\uc11c \uc0dd\uc131\ub41c \uacbd\uace0\ub97c \ud45c\uc2dc\ud560\uc9c0 \uc5ec\ubd80\ub97c \ud1a0\uae00\ud569\ub2c8\ub2e4.
compiler.show-actionscript-warnings=AS3 \ucef4\ud30c\uc77c\ub7ec\ub97c \uc720\ud6a8\ud558\uc9c0\ub9cc \ubd80\uc815\ud655\ud560 \uc218 \uc788\ub294 \ucf54\ub4dc\ub97c \uac10\uc9c0\ud558\ub294 \ubaa8\ub4dc\uc5d0\uc11c \uc2e4\ud589\ud569\ub2c8\ub2e4.
compiler.show-dependency-warnings=\ucef4\ud30c\uc77c \ud0c0\uc784\uc5d0 \uc885\uc18d\uc131\uc744 \ud655\uc778\ud560 \uc218 \uc5c6\ub294 \uacbd\uc6b0 \uacbd\uace0\ub97c \ud45c\uc2dc\ud569\ub2c8\ub2e4.
compiler.show-deprecation-warnings=\uc0ac\uc6a9\ub418\uc9c0 \uc54a\ub294 API\ub97c \uc0ac\uc6a9\ud560 \uacbd\uc6b0 \uacbd\uace0\ub97c \uc0dd\uc131\ud560\uc9c0 \uc5ec\ubd80\ub97c \ud1a0\uae00\ud569\ub2c8\ub2e4.
compiler.show-shadowed-device-font-warnings=\ud3ec\ud568\ub41c \uae00\uaf34 \uc774\ub984\uc774 \uc7a5\uce58 \uae00\uaf34 \uc774\ub984\uc744 \uc228\uae30\ub294 \uacbd\uc6b0 \uacbd\uace0\ub97c \ud45c\uc2dc\ud560\uc9c0 \uc5ec\ubd80\ub97c \ud1a0\uae00\ud569\ub2c8\ub2e4.
compiler.show-unused-type-selector-warnings=\uc0ac\uc6a9\ub418\uc9c0 \uc54a\ub294 CSS \uc720\ud615 \uc120\ud0dd\uae30\uc5d0\uc11c \uc0dd\uc131\ub418\ub294 \uacbd\uace0\ub97c \ud45c\uc2dc\ud560\uc9c0 \uc5ec\ubd80\ub97c \ud1a0\uae00\ud569\ub2c8\ub2e4.
compiler.signature-directory=\uc0dd\uc131\ub41c AS3 \uc11c\uba85\uc774 \uc800\uc7a5\ub418\ub294 [\uc0c1\ub300/\uc808\ub300] \uacbd\ub85c
compiler.strict=AS3 \ucef4\ud30c\uc77c\ub7ec\ub97c \uc5c4\uaca9\ud55c \uc624\ub958 \uac80\uc0ac \ubaa8\ub4dc\ub85c \uc2e4\ud589\ud569\ub2c8\ub2e4.
compiler.as3=\ud5a5\uc0c1\ub41c \uc131\ub2a5\uacfc \uac1c\uc120\ub41c \uc624\ub958 \ubcf4\uace0\ub97c \uc704\ud574 ActionScript 3 \ud074\ub798\uc2a4 \uae30\ubc18 \uac1c\uccb4 \ubaa8\ub378\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4. \uc774 \ud074\ub798\uc2a4 \uae30\ubc18 \uac1c\uccb4 \ubaa8\ub378\uc5d0\uc11c\ub294 \ub300\ubd80\ubd84\uc758 \ub0b4\uc7a5 \ud568\uc218\uac00 \ud074\ub798\uc2a4\uc758 \uace0\uc815 \uba54\uc11c\ub4dc\ub85c \uad6c\ud604\ub418\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.
compiler.es=\ud504\ub85c\ud1a0\ud0c0\uc785 \uc18d\uc131\uc758 \ub3d9\uc801 \uc7ac\uc815\uc758\uac00 \uac00\ub2a5\ud558\ub3c4\ub85d ECMAScript edition 3 \ud504\ub85c\ud1a0\ud0c0\uc785 \uae30\ubc18 \uac1c\uccb4 \ubaa8\ub378\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4. \ud504\ub85c\ud1a0\ud0c0\uc785 \uae30\ubc18 \uac1c\uccb4 \ubaa8\ub378\uc5d0\uc11c\ub294 \ub0b4\uc7a5 \ud568\uc218\uac00 \ud504\ub85c\ud1a0\ud0c0\uc785 \uac1c\uccb4\uc758 \ub3d9\uc801 \uc18d\uc131\uc73c\ub85c \uad6c\ud604\ub429\ub2c8\ub2e4.
compiler.theme=\ud14c\ub9c8\ub85c \uc801\uc6a9\ud560 CSS \ub610\ub294 SWC \ud30c\uc77c \ubaa9\ub85d
compiler.verbose-stacktraces=\ub514\ubc84\uae45\uc744 \uc704\ud574 \ud638\ucd9c \uc2a4\ud0dd \uc815\ubcf4\ub97c SWF\uc5d0 \uc800\uc7a5\ud569\ub2c8\ub2e4.
compiler.memory-usage-factor=\ucef4\ud30c\uc77c\ub7ec\uc758 \uba54\ubaa8\ub9ac \uc0ac\uc6a9 \uc778\uc218\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. \uae30\ubcf8\uac12\uc740 1000\uc785\ub2c8\ub2e4.
compiler.conservative=\ubcf4\uc218\uc801 \uc54c\uace0\ub9ac\uc998\uc744 \uc0ac\uc6a9\ud558\uc5ec \ucef4\ud30c\uc77c\ud569\ub2c8\ub2e4. \ub300\uaddc\ubaa8 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0\ub294 \uad8c\uc7a5\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uae30\ubcf8\uac12\uc740 false\uc785\ub2c8\ub2e4.
compiler.warn-array-tostring-changes=Array.toString() \ud615\uc2dd\uc774 \ubcc0\uacbd\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
compiler.warn-assignment-within-conditional=\uc870\uac74\uc2dd \ub0b4\uc5d0 \ud560\ub2f9\uc774 \uc788\uc2b5\ub2c8\ub2e4.
compiler.warn-bad-array-cast=Array \ud615 \ubcc0\ud658 \uc5f0\uc0b0\uc774 \uc798\ubabb\ub418\uc5c8\uc744 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
compiler.warn-bad-bool-assignment=\ubd80\uc6b8 \uac12\uc774 \uc788\uc5b4\uc57c \ud558\ub294 \uc704\uce58\uc5d0 \ubd80\uc6b8 \uc774\uc678\uc758 \uac12\uc774 \uc0ac\uc6a9\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
compiler.warn-bad-date-cast=\ub0a0\uc9dc \uce90\uc2a4\ud2b8 \uc791\uc5c5\uc774 \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
compiler.warn-bad-es3-type-method=\uc54c \uc218 \uc5c6\ub294 \uba54\uc11c\ub4dc\uc785\ub2c8\ub2e4.
compiler.warn-bad-es3-type-prop=\uc54c \uc218 \uc5c6\ub294 \uc18d\uc131\uc785\ub2c8\ub2e4.
compiler.warn-bad-nan-comparison=NaN\uacfc\uc758 \ube44\uad50\uac00 \ub17c\ub9ac\uc801\uc73c\ub85c \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4. NaN\uacfc \uad00\ub828\ub41c \ubaa8\ub4e0 \ube44\uad50 \uc5f0\uc0b0\uc740 NaN != NaN\uc774\ubbc0\ub85c false\ub85c \ud3c9\uac00\ub429\ub2c8\ub2e4.
compiler.warn-bad-null-assignment=null\uc5d0 \ub300\uc785\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
compiler.warn-bad-null-comparison=null\uacfc\uc758 \ube44\uad50\uac00 \ub17c\ub9ac\uc801\uc73c\ub85c \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
compiler.warn-bad-undefined-comparison=undefined\uc640\uc758 \ube44\uad50\uac00 \ub17c\ub9ac\uc801\uc73c\ub85c \uc798\ubabb\ub418\uc5c8\uc2b5\ub2c8\ub2e4.  \uc720\ud615\uc774 \uc9c0\uc815\ub418\uc9c0 \uc54a\uc740 \ubcc0\uc218(\ub610\ub294 * \uc720\ud615 \ubcc0\uc218)\ub9cc undefined\uc77c \uc218 \uc788\uc2b5\ub2c8\ub2e4.
compiler.warn-boolean-constructor-with-no-args=ActionScript 3.0\uc5d0\uc11c\ub294 \uc778\uc218 \uc5c6\uc774 Boolean()\uc744 \ud638\ucd9c\ud558\uba74 false\uac00 \ubc18\ud658\ub429\ub2c8\ub2e4.  ActionScript 2.0\uc5d0\uc11c\ub294 Boolean()\uc5d0\uc11c undefined\uac00 \ubc18\ud658\ub429\ub2c8\ub2e4.
compiler.warn-changes-in-resolve=__resolve\ub294 \ub354 \uc774\uc0c1 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
compiler.warn-class-is-sealed=\ud074\ub798\uc2a4\uac00 \ubd09\uc778\ub418\uc5c8\uc2b5\ub2c8\ub2e4.  \ud074\ub798\uc2a4\uc5d0 \uad6c\uc131\uc6d0\uc774 \ub3d9\uc801\uc73c\ub85c \ucd94\uac00\ub420 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.
compiler.warn-const-not-initialized=\uc0c1\uc218\uac00 \ucd08\uae30\ud654\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
compiler.warn-constructor-returns-value=\uc0c8 \ud45c\ud604\uc2dd\uc5d0 \uc0ac\uc6a9\ub41c \ud568\uc218\uc5d0\uc11c \uac12\uc744 \ubc18\ud658\ud569\ub2c8\ub2e4.  \uacb0\uacfc\ub294 \ud574\ub2f9 \ud568\uc218\uc758 \uc0c8 \uc778\uc2a4\ud134\uc2a4\uac00 \uc544\ub2cc \ud568\uc218\uc758 \ubc18\ud658\uac12\uc785\ub2c8\ub2e4.
compiler.warn-deprecated-event-handler-error=EventHandler\uac00 \uc218\uc2e0\uae30\ub85c \ucd94\uac00\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
compiler.warn-deprecated-function-error=\uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 ActionScript 2.0 \ud568\uc218\uc785\ub2c8\ub2e4.
compiler.warn-deprecated-property-error=\uc9c0\uc6d0\ub418\uc9c0 \uc54a\ub294 ActionScript 2.0 \uc18d\uc131\uc785\ub2c8\ub2e4.
compiler.warn-duplicate-argument-names=\ub3d9\uc77c\ud55c \uc774\ub984\uc744 \uac00\uc9c4 \uc778\uc218\uac00 \ub450 \uac1c \uc774\uc0c1 \uc788\uc2b5\ub2c8\ub2e4.
compiler.warn-for-var-in-changes=ActionScript 3.0\uc5d0\uc11c\ub294 "for x in target" \ubb38\uc5d0 \uc788\ub294 \uac1c\uccb4\uc758 \uc18d\uc131\uc774 \uc784\uc758\uc758 \uc21c\uc11c\ub85c \ubc18\ubcf5 \uc2e4\ud589\ub429\ub2c8\ub2e4.
compiler.warn-import-hides-class=\ud604\uc7ac \ud074\ub798\uc2a4\uc640 \ub3d9\uc77c\ud55c \uc774\ub984\uc744 \uc0ac\uc6a9\ud558\uc5ec \ud328\ud0a4\uc9c0\ub97c \uac00\uc838\uc624\uba74 \ud574\ub2f9 \ud074\ub798\uc2a4 \uc2dd\ubcc4\uc790\uac00 \uc774 \ubc94\uc704\uc5d0\uc11c \uc228\uaca8\uc9d1\ub2c8\ub2e4.
compiler.warn-instance-of-changes=instanceof \uc5f0\uc0b0\uc790\ub97c \uc0ac\uc6a9\ud588\uc2b5\ub2c8\ub2e4.
compiler.warn-internal-error=\ucef4\ud30c\uc77c\ub7ec \ub0b4\ubd80 \uc624\ub958\uc785\ub2c8\ub2e4.
compiler.warn-level-not-supported=_level\uc740 \ub354 \uc774\uc0c1 \uc9c0\uc6d0\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc790\uc138\ud55c \uc815\ubcf4\ub294 flash.display package\ub97c \ucc38\uc870\ud558\uc2ed\uc2dc\uc624.
compiler.warn-missing-namespace-decl=\ub124\uc784\uc2a4\ud398\uc774\uc2a4 \uc120\uc5b8\uc774 \ub204\ub77d\ub418\uc5c8\uc2b5\ub2c8\ub2e4. \uc989, \ubcc0\uc218\uac00 \uacf5\uc6a9, \uc804\uc6a9 \ub4f1\uc73c\ub85c \uc815\uc758\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
compiler.warn-negative-uint-literal=\uc74c\uc218 \uac12\uc744 uint \ub370\uc774\ud130 \uc720\ud615\uc5d0 \ud560\ub2f9\ud558\uba74 \ud070 \uc591\uc218 \uac12\uc774 \ub429\ub2c8\ub2e4.
compiler.warn-no-constructor=\uc0dd\uc131\uc790\uac00 \ub204\ub77d\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
compiler.warn-no-explicit-super-call-in-constructor=super() \ubb38\uc774 \uc0dd\uc131\uc790 \ub0b4\uc5d0\uc11c \ud638\ucd9c\ub418\uc9c0 \uc54a\uc558\uc2b5\ub2c8\ub2e4.
compiler.warn-no-type-decl=\uc720\ud615 \uc120\uc5b8\uc774 \uc5c6\uc2b5\ub2c8\ub2e4.
compiler.warn-number-from-string-changes=ActionScript 3.0\uc5d0\uc11c\ub294 \uacf5\ubc31\uc774 \ubb34\uc2dc\ub418\uace0 ''\uc5d0 \uc758\ud574 0\uc774 \ubc18\ud658\ub429\ub2c8\ub2e4. ActionScript 2.0\uc5d0\uc11c\ub294 \ub9e4\uac1c \ubcc0\uc218\uac00 ''\uc774\uac70\ub098 \uacf5\ubc31\uc774 \ud3ec\ud568\ub418\uba74 Number()\uac00 NaN\uc744 \ubc18\ud658\ud569\ub2c8\ub2e4.
compiler.warn-scoping-change-in-this=\uc774 \ud0a4\uc6cc\ub4dc\uc758 \ubc94\uc704\uac00 \ubcc0\uacbd\ub418\uc5c8\uc2b5\ub2c8\ub2e4.  \ud074\ub798\uc2a4\uc758 \uc778\uc2a4\ud134\uc2a4\uc5d0\uc11c \ucd94\ucd9c\ud55c \ud074\ub798\uc2a4 \uba54\uc11c\ub4dc\ub294 \ud56d\uc0c1 \uc774 \ubcc0\uacbd \uc0ac\ud56d\uc744 \ub2e4\uc2dc \uc6d0\ub798 \uc778\uc2a4\ud134\uc2a4\ub85c \ud655\uc778\ud569\ub2c8\ub2e4.  ActionScript 2.0\uc5d0\uc11c\ub294 \uba54\uc11c\ub4dc\uac00 \ud638\ucd9c\ub41c \uc704\uce58\ub97c \uae30\ubc18\uc73c\ub85c \uc774 \ubcc0\uacbd \uc0ac\ud56d\uc744 \ub3d9\uc801\uc73c\ub85c \uc870\ud68c\ud569\ub2c8\ub2e4.
compiler.warn-slow-text-field-addition=TextField\uc5d0\uc11c +=\ub97c \uc0ac\uc6a9\ud558\ub294 \uac83\uc740 \ube44\ud6a8\uc728\uc801\uc785\ub2c8\ub2e4.
compiler.warn-unlikely-function-value=\uad04\ud638\uac00 \ub204\ub77d\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
compiler.warn-xml-class-has-changed=ActionScript 2.0 XML \ud074\ub798\uc2a4\uac00 \uc0ac\uc6a9\ub418\uc5c8\uc2b5\ub2c8\ub2e4.
debug-password=\ub514\ubc84\uae45 \uac00\ub2a5\ud55c SWF\uc5d0 \ud3ec\ud568\ud560 \uc554\ud638
default-background-color=\uae30\ubcf8 \ubc30\uacbd \uc0c9\uc0c1(\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ucf54\ub4dc\uc5d0 \uc758\ud574 \uc7ac\uc124\uc815\ub420 \uc218 \uc788\uc74c)
default-frame-rate=SWF\uc5d0\uc11c \uc0ac\uc6a9\ud560 \uae30\ubcf8 \ud504\ub808\uc784 \uc18d\ub3c4\uc785\ub2c8\ub2e4.
default-script-limits=\uae30\ubcf8 \uc2a4\ud06c\ub9bd\ud2b8 \uc2e4\ud589 \uc81c\ud55c(\ub8e8\ud2b8 \ud2b9\uc131\uc5d0 \uc758\ud574 \uc7ac\uc124\uc815\ub420 \uc218 \uc788\uc74c)
default-size=\uae30\ubcf8 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ud06c\uae30(\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc758 \ub8e8\ud2b8 \ud2b9\uc131\uc5d0 \uc758\ud574 \uc7ac\uc124\uc815\ub420 \uc218 \uc788\uc74c)
dependency-info=\ucd9c\ub825 \ud074\ub798\uc2a4 \uc885\uc18d\uc131 \uc815\ubcf4
dependency.minimize-dependency-set=SWC\uc5d0\uc11c \ud655\uc778\ub41c \uc2a4\ud06c\ub9bd\ud2b8\uac00 \ub2e4\ub978 \uc885\uc18d SWC\uc5d0\uc11c \ud655\uc778\ub41c \uc2a4\ud06c\ub9bd\ud2b8\uc758 \ud558\uc704 \uc9d1\ud569\uc774\uba74 \uc885\uc18d\uc131 \uc9d1\ud569\uc5d0\uc11c SWC\ub97c \uc81c\uac70\ud569\ub2c8\ub2e4.
dependency.show-external-classes=true\ub85c \uc124\uc815\ud558\uba74 SWC \uac04 \uc885\uc18d\uc131\uc744 \uc0dd\uc131\ud558\ub294 \uc2a4\ud06c\ub9bd\ud2b8 \ud074\ub798\uc2a4\uac00 \ud45c\uc2dc\ub429\ub2c8\ub2e4(\uae30\ubcf8\uac12: false).
dependency.show-swcs=SWC \uc774\ub984 \ubaa9\ub85d\uc73c\ub85c, \uc804\uccb4 \uacbd\ub85c\ub294 \ud544\uc694\ud558\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc885\uc18d\uc131 \uc815\ubcf4\ub294 \uc9c0\uc815\ub41c SWC\uc5d0 \ub300\ud574\uc11c\ub9cc \ud45c\uc2dc\ub418\uba70 \uc885\uc18d\uc131 \ubd84\uc11d\uc5d0\ub294 \uc601\ud5a5\uc744 \uc8fc\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4.
dependency.show-types=true\ub85c \uc124\uc815\ud558\uba74 \uc2a4\ud06c\ub9bd\ud2b8 \ud074\ub798\uc2a4\uc758 \uc885\uc18d\uc131 \uc720\ud615\uc774 \ud45c\uc2dc\ub429\ub2c8\ub2e4(\uae30\ubcf8\uac12: false).
dependency.types=SWC \uc885\uc18d\uc131 \uacb0\uc815\uc5d0 \uc0ac\uc6a9\ub418\ub294 \ud074\ub798\uc2a4\uc758 \ubc94\uc704\ub97c \uc881\ud788\uae30 \uc704\ud55c \uc885\uc18d\uc131 \uc720\ud615 \ubaa9\ub85d\uc785\ub2c8\ub2e4. i, s, n, e \ub4f1\uc758 \uac12\uc744 \uc0ac\uc6a9\ud560 \uc218 \uc788\uc73c\uba70 \uae30\ubcf8\uc801\uc73c\ub85c\ub294 \ubaa8\ub4e0 \uc885\uc18d\uc131 \uc720\ud615\uc774 \uc0ac\uc6a9\ub429\ub2c8\ub2e4.
digest.rsl-file=\ub2e4\uc74c\uc758 \ub2e4\uc774\uc81c\uc2a4\ud2b8\ub97c \uacc4\uc0b0\ud560 RSL\uc758 \uc704\uce58
digest.swc-path=\ub2e4\uc774\uc81c\uc2a4\ud2b8\uac00 \uc5c5\ub370\uc774\ud2b8\ub420 SWC \ud30c\uc77c \ub610\ub294 \ub514\ub809\ud1a0\ub9ac \uacbd\ub85c
directory=\ub77c\uc774\ube0c\ub7ec\ub9ac\ub97c SWC \ud30c\uc77c \ub300\uc2e0 \uc5f4\ub9b0 \ub514\ub809\ud1a0\ub9ac\ub85c \ucd9c\ub825
dump-config=\ud604\uc7ac \uc124\uc815\ub41c \ubaa8\ub4e0 \uad6c\uc131 \uac12\uc744 \ud3ec\ud568\ud558\uba70 Flex config \ud30c\uc77c\ub85c \uc0ac\uc6a9\ud558\uae30 \uc801\ud569\ud55c \ud30c\uc77c \uc4f0\uae30
externs=SWF \uc791\uc131 \uc2dc \uc5f0\uacb0\uc5d0\uc11c \uc81c\uc678\ud560 \uae30\ud638 \ubaa9\ub85d
includes=SWF \uc791\uc131 \uc2dc \ud56d\uc0c1 \uc5f0\uacb0\ud560 \uae30\ud638 \ubaa9\ub85d
include-classes=\ucd9c\ub825 SWC\uc5d0 \ud3ec\ud568\ud560 \ud074\ub798\uc2a4 \ubaa9\ub85d
include-file=\ucd9c\ub825 SWC\uc5d0 \ud3ec\ud568\ud560 \uba85\uba85\ub41c \ud30c\uc77c \ubaa9\ub85d
include-lookup-only=true\uc778 \uacbd\uc6b0 lookupOnly=true\uc778 \ub9e4\ub2c8\ud398\uc2a4\ud2b8 \ud56d\ubaa9\uc774 SWC \uce74\ud0c8\ub85c\uadf8\uc5d0 \ud3ec\ud568\ub429\ub2c8\ub2e4. \uae30\ubcf8\uac12\uc740 false\uc785\ub2c8\ub2e4.
include-namespaces=\ub098\uc5f4\ub41c \ub124\uc784\uc2a4\ud398\uc774\uc2a4\uc758 \ubaa8\ub4e0 \ud074\ub798\uc2a4\uac00 \ucd9c\ub825 SWC\uc5d0 \ud3ec\ud568\ub428
include-resource-bundles=\ucd9c\ub825 SWC\uc5d0 \ud3ec\ud568\ud560 \ub9ac\uc18c\uc2a4 \ubc88\ub4e4 \ubaa9\ub85d
include-sources=\ucd9c\ub825 SWC\uc5d0 \ud3ec\ud568\ud560 \ub514\ub809\ud1a0\ub9ac \ubc0f \uc18c\uc2a4 \ud30c\uc77c \ubaa9\ub85d
include-stylesheet=\ucd9c\ub825 SWC\uc5d0 \ud3ec\ud568\ud560 \uba85\uba85\ub41c \uc2a4\ud0c0\uc77c\uc2dc\ud2b8 \ub9ac\uc18c\uc2a4 \ubaa9\ub85d
file-specs=\ucef4\ud30c\uc77c\ud560 \uc18c\uc2a4 \ud30c\uc77c \ubaa9\ub85d(\uc9c0\uc815\ub41c \ub9c8\uc9c0\ub9c9 \ud30c\uc77c\uc740 \ub300\uc0c1 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc73c\ub85c \uc0ac\uc6a9\ub428)
frames.frame=\ud504\ub808\uc784\uc5d0 \uc5f0\uacb0\ub420 \uc77c\ub828\uc758 \ud074\ub798\uc2a4 \uc774\ub984\uc774 \uc788\ub294 SWF \ud504\ub808\uc784 \ub808\uc774\ube14\uc785\ub2c8\ub2e4.
generate-frame-loader=IFlexModuleFactory \ud30c\uc0dd \ub85c\ub354 \ud074\ub798\uc2a4 \uc0dd\uc131 \ubc18\ubcf5 \uad50\uccb4
help=\uba85\ub839\uc904 \uad6c\ubb38\uc5d0 \ub300\ud55c \uc790\uc138\ud55c \ub0b4\uc6a9 \ubc0f \uad6c\uc131 \ubcc0\uc218\uc5d0 \ub300\ud55c \uc124\uba85\uc744 \ubcf4\ub824\uba74 \uac80\uc0c9 \ubb38\uc790\uc5f4\uc744 \uc9c0\uc815\ud558\uac70\ub098 \ub2e4\uc74c\uacfc \uac19\uc740 \ud2b9\uc218 \ud0a4\uc6cc\ub4dc \uc911 \ud558\ub098\ub97c \uc9c0\uc815\ud558\uc2ed\uc2dc\uc624.\n   syntax   - \uba85\ub839\uc904\uc758 \uc77c\ubc18\uc801\uc778 \uad6c\ubb38 \uc124\uba85\n   list     - \ubaa8\ub4e0 \uae30\ubcf8 \uad6c\uc131 \ubcc0\uc218 \ubaa9\ub85d \ud45c\uc2dc\n   advanced - \ucd94\uac00\ub85c \uace0\uae09 \uad6c\uc131 \ubcc0\uc218\uc640 \uc77c\uce58\n   aliases  - \ubcc0\uc218\uc5d0 \ub300\ud55c \uc9e7\uc740 \ubcc4\uce6d\uc744 \uc0ac\uc6a9\ud558\uc5ec \uc815\ub82c\n   details  - \ud56d\ubaa9\ubcc4 \uc804\uccb4 \uc138\ubd80 \uc0ac\ud56d\uc744 \ud56d\uc0c1 \ud45c\uc2dc\n\uc81c\uacf5\ub41c \uae30\ud0c0 \ubaa8\ub4e0 \ub3c4\uc6c0\ub9d0 \ud0a4\uc6cc\ub4dc\ub294 \uad6c\uc131 \ubcc0\uc218 \uc124\uba85\uc5d0\uc11c \uac80\uc0c9\ud560 \uc804\uccb4 \uad6c\uc131 \ubcc0\uc218\ub098 \ubd80\ubd84 \uad6c\uc131 \ubcc0\uc218, \ubcc4\uce6d \ub610\ub294 \ud14d\uc2a4\ud2b8\uc640 \uc77c\uce58\ud558\ub3c4\ub85d \uc0ac\uc6a9\ud569\ub2c8\ub2e4.\n\n\uc608\ub97c \ub4e4\uc5b4 '-help advanced aliases foo'\ub294 'foo'\ub77c\ub294 \ud14d\uc2a4\ud2b8\uac00 \ud3ec\ud568\ub41c \uae30\ubcf8 \ubc0f \uace0\uae09 \uad6c\uc131 \uc635\uc158 \ubaa8\ub450\ub97c \ubcc4\uce6d \uc774\ub984\ubcc4\ub85c \uc815\ub82c\ud558\uc5ec \ud45c\uc2dc\ud569\ub2c8\ub2e4.\n\n\uac1c\ubcc4 \uad6c\uc131 \ubcc0\uc218\uc5d0 \ub300\ud55c \uc124\uba85\uc5d0\uc11c \ud544\uc218 \uac12\uc740 \uaebe\uc1e0 \uad04\ud638\ub85c \ud45c\uc2dc\ub418\uba70, \uc120\ud0dd\uc801\uc778 \uac12\uc740 \ub300\uad04\ud638\ub85c \ud45c\uc2dc\ub429\ub2c8\ub2e4.  \uac12\uc774 \uc784\uc758\uc758 \uae38\uc774\uc758 \ubaa9\ub85d\uc774\ub77c\ub294 \uac83\uc744 \ub098\ud0c0\ub0b4\ub294 \ub370 [...] \ud45c\uae30\ubc95\uc774 \uc0ac\uc6a9\ub429\ub2c8\ub2e4.
lazy-init=ABC \ubc14\uc774\ud2b8\ucf54\ub4dc \ucd08\uae30\ud654 \uc9c0\uc5f0 \ud65c\uc131\ud654/\ube44\ud65c\uc131\ud654
link-report=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc73c\ub85c \uc5f0\uacb0\ub41c \ubaa8\ub4e0 \uc815\uc758\uc5d0 \ub300\ud55c XML \ud615\uc2dd \ubcf4\uace0\uc11c\ub97c \ucd9c\ub825\ud569\ub2c8\ub2e4.
load-config=\uad6c\uc131 \uc635\uc158\uc774 \ud3ec\ud568\ub41c \ud30c\uc77c \ubd88\ub7ec\uc624\uae30
load-externs=SWF \uc791\uc131 \uc2dc \uc5f0\uacb0\uc5d0\uc11c \uc81c\uc678\ud560 <def>, <pre> \ubc0f <ext> \uae30\ud638\uac00 \ud3ec\ud568\ub41c XML \ud30c\uc77c
metadata.contributor=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \uae30\uc5ec\uc790 \uc774\ub984
metadata.creator=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \uc791\uc131\uc790 \uc774\ub984
metadata.date=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \ub9cc\ub4e0 \ub0a0\uc9dc
metadata.description=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \uae30\ubcf8 \uc124\uba85
metadata.language=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \uc5b8\uc5b4(\uc608: EN, FR)
metadata.localized-description=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \uc9c0\uc5ed\ud654\ub41c RDF/XMP \uc124\uba85
metadata.localized-title=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \uc9c0\uc5ed\ud654\ub41c RDF/XMP \uc81c\ubaa9
metadata.publisher=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \uac8c\uc2dc\uc790 \uc774\ub984
metadata.title=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 \uae30\ubcf8 \uc81c\ubaa9
output=\uc791\uc131\ud560 SWF \ub3d9\uc601\uc0c1 \ud30c\uc77c \uc774\ub984
raw-metadata=SWF \uba54\ud0c0\ub370\uc774\ud130\uc5d0 \uc800\uc7a5\ud560 XML \ud14d\uc2a4\ud2b8(metadata.* \uad6c\uc131\uc744 \uc7ac\uc124\uc815\ud568)
runtime-shared-libraries=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \uc2dc\uc791 \uc804\uc5d0 \ubcfc\ub7ec\uc62c \ub7f0\ud0c0\uc784 \uacf5\uc720 \ub77c\uc774\ube0c\ub7ec\ub9ac URL \ubaa9\ub85d
size-report=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \uc5f0\uacb0\ub41c \ub370\uc774\ud130 \ubc0f \ubaa8\ub4e0 \ucf54\ub4dc\uc758 \ud06c\uae30\ub97c \uc790\uc138\ud788 \ubcf4\uc5ec \uc8fc\ub294 XML \ud615\uc2dd\uc758 \ubcf4\uace0\uc11c\ub97c \ucd9c\ub825\ud569\ub2c8\ub2e4.
use-network=SWF\uc5d0 \ub124\ud2b8\uc6cc\ud06c \ub9ac\uc18c\uc2a4 \uc561\uc138\uc2a4\uc5d0 \ub300\ud55c \ud50c\ub798\uadf8 \uc9c0\uc815 \ubc18\ubcf5 \uad50\uccb4
version=\ud504\ub85c\uadf8\ub7a8 \ube4c\ub4dc \ubc84\uc804 \ud45c\uc2dc
warnings=\uacbd\uace0 \ud45c\uc2dc \ubc18\ubcf5 \uad50\uccb4

Syntax=\uc0ac\uc6a9\ubc95: ${program} [\uad6c\uc131 \uc635\uc158] [\uae30\ubcf8 \uc778\uc218]\n\n\uad6c\uc131 \uc635\uc158\uc740 \uba85\ub839\uc904\uc5d0 '-variable=value,value,value'\ub85c \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \ud544\uc694\ud55c \uac12\uc758 \uc218\ub294 \ud2b9\uc815 \ubcc0\uc218\uc5d0 \ub530\ub77c \ub2ec\ub77c\uc9d1\ub2c8\ub2e4. \ubd80\uc6b8 \uc635\uc158\uc740 '-variable=true'\uc778 \uacbd\uc6b0 \uc0ac\uc6a9\ud560 \uc218 \uc788\uace0 '-variable=false'\uc778 \uacbd\uc6b0 \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. '-variable'\uc740 '-variable=true'\ub97c \ub2e8\ucd95\ud558\uc5ec \ud45c\ud604\ud55c \uac83\uc785\ub2c8\ub2e4. \ubcc0\uc218\ub294 '-variable='\uc5d0\uc11c \ub4f1\ud638 \uae30\ud638 \ub2e4\uc74c\uc5d0 \uac12\uc744 \ud560\ub2f9\ud558\uc9c0 \uc54a\ub294 \ubc29\ubc95\uc73c\ub85c \uc9c0\uc6b8 \uc218 \uc788\uc2b5\ub2c8\ub2e4.\n\n\uae30\ubcf8 \uc778\uc218 \ubaa9\ub85d\uc740 '${defaultVar}' \ubcc0\uc218 \uc124\uc815\uacfc \uc77c\uce58\ud569\ub2c8\ub2e4. \ud2b9\uc218 \ubb38\uc790\uc5f4 '--'\uc744 \uc0ac\uc6a9\ud558\uba74 \uba85\uba85\ub41c \uad6c\uc131 \uc635\uc158 \ucc98\ub9ac\uac00 \uc885\ub8cc\ub418\uace0 \uba85\ub839\uc904\uc5d0 \ub0a8\uc544\uc788\ub294 \uac12\uc774 \uae30\ubcf8 \uc778\uc218\ub85c \ud574\uc11d\ub429\ub2c8\ub2e4.\n\n\uc77c\ubc18\uc801\uc73c\ub85c \uc9c0\uc815\ub41c \ubcc0\uc218\ub294 \ud55c \ubc88\ub9cc \uc124\uc815\ud560 \uc218 \uc788\uc9c0\ub9cc, '\ubc18\ubcf5 \uac00\ub2a5'\uc774\ub77c\ub294 \uc124\uba85\uc774 \ud45c\uc2dc\ub41c \uc77c\ubd80 \ubcc0\uc218\ub294 \uc5ec\ub7ec \ubc88 \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \uc608\ub97c \ub4e4\uc5b4 'a'\uac00 \ubc18\ubcf5 \uac00\ub2a5 \ubcc0\uc218\uc778 \uacbd\uc6b0, '-a=x,y,z'\ub97c '-a=x -a=y -a=z'\uc640 \uac19\uc774 \uc124\uc815\ud560 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4. \ubc18\ubcf5 \uac00\ub2a5 \ubcc0\uc218\uc5d0\uc11c \ubb34\uc5c7\ubcf4\ub2e4 \uc720\uc6a9\ud55c \ud2b9\uc131\uc740 \ud2b9\uc218 \uad6c\ubb38 '-variable+=value,value'\ub97c \uc0ac\uc6a9\ud558\uba74 \uc0c8\ub85c\uc6b4 \uc124\uc815 \uac12\uc774 \ud604\uc7ac \uac12 \ubaa9\ub85d\uc744 \ub300\uccb4\ud558\uc9c0 \uc54a\uace0 \ud604\uc7ac \uac12\uc5d0 \ucd94\uac00\ub41c\ub2e4\ub294 \uc810\uc785\ub2c8\ub2e4.\n\n\uad6c\uc131 \ubcc0\uc218\uc5d0\ub294 \uc785\ub825\ud558\uae30 \uc27d\uac8c \ub2e8\ucd95\ub41c \ubcc4\uce6d\uc744 \uc0ac\uc6a9\ud558\uae30\ub3c4 \ud569\ub2c8\ub2e4. \uc810 \uad6c\ubb38\uc73c\ub85c \ud45c\uc2dc\ub41c \uacc4\uce35\uc801 \ubcc0\uc218 \uc774\ub984\uc740 \uace0\uc720\ud55c \uacbd\uc6b0 '\ub9ac\ud504' \uc774\ub984\uc73c\ub85c \uc0dd\uc131\ub41c \ubcc4\uce6d\uc744 \uc790\ub3d9\uc73c\ub85c \uac00\uc9c0\uac8c \ub429\ub2c8\ub2e4.\n\n\uba85\ub839\uc904\uc5d0 \uc9c0\uc815\ub41c \ud30c\uc77c \uc774\ub984\uc740 \uc808\ub300 \uacbd\ub85c\uc774\uac70\ub098 \ud604\uc7ac \ub514\ub809\ud1a0\ub9ac\uc758 \uc0c1\ub300 \uacbd\ub85c\uc5ec\uc57c \ud569\ub2c8\ub2e4.\n\n\uc0ac\uc6a9 \uac00\ub2a5\ud55c \uad6c\uc131 \ubcc0\uc218 \ubaa9\ub85d\uc744 \ubcf4\ub824\uba74 '${program} -help list'\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.

AdvancedSyntax=\uc0ac\uc6a9\ubc95: ${program} [\uad6c\uc131 \uc635\uc158] [\uae30\ubcf8 \uc778\uc218]\n\n\uad6c\uc131 \uc635\uc158\uc740 \uba85\ub839\uc904\uc5d0 '-variable=value,value,value' \ub610\ub294 '-variable value value'\ub85c \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \ud544\uc694\ud55c \uac12\uc758 \uc218\ub294 \ud2b9\uc815 \ubcc0\uc218\uc5d0 \ub530\ub77c \ub2ec\ub77c\uc9d1\ub2c8\ub2e4. \ubd80\uc6b8 \uc635\uc158\uc740 '-variable=true'\uc778 \uacbd\uc6b0 \uc0ac\uc6a9\ud560 \uc218 \uc788\uace0 '-variable=false'\uc778 \uacbd\uc6b0 \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. '-variable'\uc740 '-variable=true'\ub97c \ub2e8\ucd95\ud558\uc5ec \ud45c\ud604\ud55c \uac83\uc785\ub2c8\ub2e4. \ubcc0\uc218\ub294 '-variable='\uc5d0\uc11c \ub4f1\ud638 \uae30\ud638 \ub2e4\uc74c\uc5d0 \uac12\uc744 \ud560\ub2f9\ud558\uc9c0 \uc54a\ub294 \ubc29\ubc95\uc73c\ub85c \uc9c0\uc6b8 \uc218 \uc788\uc2b5\ub2c8\ub2e4.\n\n\uae30\ubcf8 \uc778\uc218 \ubaa9\ub85d\uc740 '${defaultVar}' \ubcc0\uc218 \uc124\uc815\uacfc \uc77c\uce58\ud569\ub2c8\ub2e4. \ud2b9\uc218 \ubb38\uc790\uc5f4 '--'\uc744 \uc0ac\uc6a9\ud558\uba74 \uba85\uba85\ub41c \uad6c\uc131 \uc635\uc158 \ucc98\ub9ac\uac00 \uc885\ub8cc\ub418\uace0 \uba85\ub839\uc904\uc5d0 \ub0a8\uc544\uc788\ub294 \uac12\uc774 \uae30\ubcf8 \uc778\uc218\ub85c \ud574\uc11d\ub429\ub2c8\ub2e4.\n\n\uc77c\ubc18\uc801\uc73c\ub85c \uc9c0\uc815\ub41c \ubcc0\uc218\ub294 \ud55c \ubc88\ub9cc \uc124\uc815\ud560 \uc218 \uc788\uc9c0\ub9cc, '\ubc18\ubcf5 \uac00\ub2a5'\uc774\ub77c\ub294 \uc124\uba85\uc774 \ud45c\uc2dc\ub41c \uc77c\ubd80 \ubcc0\uc218\ub294 \uc5ec\ub7ec \ubc88 \uc124\uc815\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4. \uc608\ub97c \ub4e4\uc5b4 'a'\uac00 \ubc18\ubcf5 \uac00\ub2a5 \ubcc0\uc218\uc778 \uacbd\uc6b0, '-a=x,y,z'\ub97c '-a=x -a=y -a=z'\uc640 \uac19\uc774 \uc124\uc815\ud560 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4. \ubc18\ubcf5 \uac00\ub2a5 \ubcc0\uc218\uc5d0\uc11c \ubb34\uc5c7\ubcf4\ub2e4 \uc720\uc6a9\ud55c \ud2b9\uc9d5\uc740 \ud2b9\uc218 \uad6c\ubb38 '-variable+=value,value'\ub97c \uc0ac\uc6a9\ud558\uba74 \uc0c8\ub85c\uc6b4 \uc124\uc815 \uac12\uc774 \ud604\uc7ac \uac12 \ubaa9\ub85d\uc744 \ub300\uccb4\ud558\uc9c0 \uc54a\uace0 \ud604\uc7ac \uac12\uc5d0 \ucd94\uac00\ub41c\ub2e4\ub294 \uc810\uc785\ub2c8\ub2e4.\n\n\uad6c\uc131 \ubcc0\uc218\uc5d0\ub294 \uc785\ub825\ud558\uae30 \uc27d\uac8c \ub2e8\ucd95\ub41c \ubcc4\uce6d\uc744 \uc0ac\uc6a9\ud558\uae30\ub3c4 \ud569\ub2c8\ub2e4. \uc810 \uad6c\ubb38\uc73c\ub85c \ud45c\uc2dc\ub41c \uacc4\uce35\uc801 \ubcc0\uc218 \uc774\ub984\uc740 \uace0\uc720\ud55c \uacbd\uc6b0 '\ub9ac\ud504' \uc774\ub984\uc73c\ub85c \uc0dd\uc131\ub41c \ubcc4\uce6d\uc744 \uc790\ub3d9\uc73c\ub85c \uac00\uc9c0\uac8c \ub429\ub2c8\ub2e4.\n\n\uad6c\uc131 \uac12\uc5d0 $${token} \ud615\uc2dd\uc758 \uc2dc\ud000\uc2a4\uac00 \uc788\ub294 \uacbd\uc6b0 \ud574\ub2f9 \ud1a0\ud070 \uac12\uc73c\ub85c \uc2dc\ud000\uc2a4\uac00 \ud655\uc7a5\ub429\ub2c8\ub2e4. \ubaa8\ub4e0 Java \ud2b9\uc9d5\uc740 \ud1a0\ud070\uc73c\ub85c \ucc98\ub9ac\ub418\uc9c0\ub9cc \uba85\ub839\uc904\uc5d0 '+token=value'\ub97c \uc0ac\uc6a9\ud558\uc5ec \ud1a0\ud070\uc744 \uc124\uc815\ud560 \uc218\ub3c4 \uc788\uc2b5\ub2c8\ub2e4.  \ud1a0\ud070 \ub300\uccb4\ub294 \uac04\ub2e8\ud55c \ubb38\uc790\uc5f4\ub85c \uc81c\ud55c\ub418\uc9c0\ub9cc, \ubc18\ubcf5\uc801\uc73c\ub85c \uc815\uc758\ub420 \uc218 \uc788\uc2b5\ub2c8\ub2e4.\n\n\uba85\ub839\uc904\uc5d0 \uc9c0\uc815\ub41c \ud30c\uc77c \uc774\ub984\uc740 \uc808\ub300 \uacbd\ub85c\uc774\uac70\ub098 \ud604\uc7ac \ub514\ub809\ud1a0\ub9ac\uc758 \uc0c1\ub300 \uacbd\ub85c\uc5ec\uc57c \ud569\ub2c8\ub2e4.\n\n\uc0ac\uc6a9 \uac00\ub2a5\ud55c \uad6c\uc131 \ubcc0\uc218 \ubaa9\ub85d\uc744 \ubcf4\ub824\uba74 '${program} -help list'\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.

HelpKeywords=\ud0a4\uc6cc\ub4dc\uac00 'syntax', 'list', 'advanced', 'aliases', 'details'\uc774\uac70\ub098 \uac80\uc0c9 \ud56d\ubaa9\uc784
Advanced=\uace0\uae09
Repeatable=\ubc18\ubcf5 \uac00\ub2a5
Default=\uae30\ubcf8 \ubcc0\uc218
Alias=\ubcc4\uce6d
FullName=\uc804\uccb4 \uc774\ub984
NoKeywordsMatched=\uc77c\uce58\ud558\ub294 \ud0a4\uc6cc\ub4dc\uac00 \uc5c6\uc2b5\ub2c8\ub2e4.
# note: do not localize the string -help, it has syntactic significance
Brief=${program} [options] [defaultVar]\n\uc790\uc138\ud55c \uc815\ubcf4\ub97c \ubcf4\ub824\uba74 '${program} -help'\ub97c \uc0ac\uc6a9\ud558\uc2ed\uc2dc\uc624.\n\n

compiler.allow-source-path-overlap=\uc18c\uc2a4 \uacbd\ub85c \ud56d\ubaa9\uc774 \ub2e4\ub978 \uc18c\uc2a4 \uacbd\ub85c \ud56d\ubaa9\uc758 \ud558\uc704 \ub514\ub809\ud1a0\ub9ac\uc778\uc9c0 \ud655\uc778\ud569\ub2c8\ub2e4. \uc774\ub97c \ud1b5\ud574 MXML \uad6c\uc131 \uc694\uc18c\uc758 \ud328\ud0a4\uc9c0 \uc774\ub984\uc744 \ubd84\uba85\ud558\uac8c \uad6c\ubd84\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.
compiler.debug=\ub514\ubc84\uae45\ud558\uae30 \uc801\ud569\ud55c \ub3d9\uc601\uc0c1\uc744 \ub9cc\ub4ed\ub2c8\ub2e4. 
compiler.define=\uc804\uc5ed AS3 \uc870\uac74\ubd80 \ucef4\ud30c\uc77c \uc815\uc758\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc608: -define=CONFIG::debugging,true \ub610\ub294 -define+=CONFIG::debugging,true(flex-config.xml\uc5d0 \uc788\ub294 \uae30\uc874 \uc815\uc758 \ucd94\uac00) 
compiler.defaults-css-url=\uae30\ubcf8 \uc2a4\ud0c0\uc77c \uc2dc\ud2b8\uc758 \uc704\uce58\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc774 \uc635\uc158\uc744 \uc124\uc815\ud558\uba74 framework.swc \ud30c\uc77c\uc758 defaults.css \uc2a4\ud0c0\uc77c \uc2dc\ud2b8\ub97c \uc554\uc2dc\uc801 \ubb34\uc2dc\ud558\uac8c \ub429\ub2c8\ub2e4.
compiler.fonts.max-cached-fonts=\uc11c\ubc84 \uce90\uc2dc\uc5d0 \uc800\uc7a5\ud560 \ucd5c\ub300 \uae00\uaf34 \uc218\ub97c \uc124\uc815\ud569\ub2c8\ub2e4.  \uae30\ubcf8\uac12\uc740 20\uc785\ub2c8\ub2e4.
compiler.fonts.max-glyphs-per-face=\uac01 \uae00\uaf34 \uc774\ub984\uc5d0 \ub300\ud574 \uc11c\ubc84 \uce90\uc2dc\uc5d0 \uc800\uc7a5\ud560 \ubb38\uc790 \uae00\ub9ac\ud504 \uc724\uacfd\uc120\uc758 \ucd5c\ub300 \uc218\ub97c \uc124\uc815\ud569\ub2c8\ub2e4. \uae30\ubcf8\uac12\uc740 1000\uc785\ub2c8\ub2e4.
compiler.fonts.flash-type=\ud3ec\ud568\ub41c \uae00\uaf34\uc5d0 \ub300\ud574 FlashType\uc744 \uc0ac\uc6a9\ud558\uc5ec \uc791\uc740 \uae00\uaf34\uc744 \ubcf4\ub2e4 \uc120\uba85\ud558\uac8c \ud45c\uc2dc\ud569\ub2c8\ub2e4.
compiler.fonts.advanced-anti-aliasing=\ud3ec\ud568\ub41c \uae00\uaf34\uc5d0 \ub300\ud574 \uace0\uae09 \uc564\ud2f0\uc568\ub9ac\uc5b4\uc2f1\uc744 \uc0ac\uc6a9\ud558\uc5ec \uc791\uc740 \uae00\uaf34\uc744 \ubcf4\ub2e4 \uc120\uba85\ud558\uac8c \ud45c\uc2dc\ud569\ub2c8\ub2e4.
compiler.use-resource-bundle-metadata=\ub9ac\uc18c\uc2a4 \ubc88\ub4e4\uc774 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \ud3ec\ud568\ub418\uc5c8\ub294\uc9c0 \ud655\uc778\ud569\ub2c8\ub2e4.
compiler.warn-duplicate-variable-def=\ubcc0\uc218 \uc815\uc758\uac00 \uc911\ubcf5\ub418\uc5c8\uc2b5\ub2c8\ub2e4. 
include-inheritance-dependencies-only=include-classes\ub85c \uc9c0\uc815\ud55c \ud074\ub798\uc2a4\uc758 \uc0c1\uc18d \uc885\uc18d\uc131\ub9cc \ud3ec\ud568 
resource-bundle-list=compc \ucef4\ud30c\uc77c\ub7ec\uc5d0 \uc785\ub825\ud558\uc5ec \ub9ac\uc18c\uc2a4 \ubc88\ub4e4 SWC \ud30c\uc77c\uc774 \ub9cc\ub4e4\uc5b4\uc9c0\ub3c4\ub85d \ub9ac\uc18c\uc2a4 \ubc88\ub4e4 \ubaa9\ub85d\uc744 \ud30c\uc77c\uc5d0 \uc778\uc1c4\ud569\ub2c8\ub2e4. 
licenses.license=\uc81c\ud488 \ubc0f \uc77c\ub828 \ubc88\ud638\ub97c \uc9c0\uc815\ud569\ub2c8\ub2e4. 
remove-unused-rsls=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0\uc11c \uc0ac\uc6a9\ud558\uc9c0 \uc54a\ub294 RSL \uc81c\uac70
runtime-shared-library-path=\uc5f0\uacb0\ud560 SWC \ubc0f \ub85c\ub4dc\ud560 RSL URL(\uc120\ud0dd\uc801\uc778 \uc815\ucc45 \ud30c\uc77c URL \ubc0f \uc120\ud0dd\uc801\uc778 \uc7a5\uc560 \uc870\uce58 URL \ud3ec\ud568) \uc9c0\uc815 
runtime-shared-library-settings.application-domain=RSL\uc774 \ub85c\ub4dc\ub41c \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8 \ub3c4\uba54\uc778\uc744 \uc7ac\uc815\uc758\ud569\ub2c8\ub2e4. \uc9c0\uc6d0\ub418\ub294 \uac12\uc740 'current', 'default', 'parent' \ub610\ub294 'top-level'\uc785\ub2c8\ub2e4.
runtime-shared-library-settings.force-rsls=RSL\uc744 \uac15\uc81c\ub85c \ub85c\ub4dc\ud558\uc5ec, remove-unused-rsls \uc635\uc158\uc744 \uc0ac\uc6a9\ud558\uc5ec \ubc1c\uc0dd\ud55c \uc81c\uac70 \uc791\uc5c5 \uc7ac\uc815\uc758
compute-digest=\ub77c\uc774\ube0c\ub7ec\ub9ac\uc758 catalog.xml\uc5d0 \ub2e4\uc774\uc81c\uc2a4\ud2b8\ub97c \uc501\ub2c8\ub2e4. \uc774 \uc791\uc5c5\uc740 \ub77c\uc774\ube0c\ub7ec\ub9ac\uac00 -runtime-shared-libraries-path \uc635\uc158\uc5d0\uc11c \uc0ac\uc6a9\ub420 \ub54c \ud544\uc694\ud569\ub2c8\ub2e4.
static-link-runtime-shared-libraries=-runtime-shared-libraries-path \uc635\uc158\uc5d0\uc11c \uc9c0\uc815\ub41c \ub77c\uc774\ube0c\ub7ec\ub9ac\ub97c \uc815\uc801\uc73c\ub85c \uc5f0\uacb0\ud569\ub2c8\ub2e4.
verify-digests=\ub7f0\ud0c0\uc784\uc5d0 \ubd88\ub7ec\uc628 \ub77c\uc774\ube0c\ub7ec\ub9ac\uac00 \uc62c\ubc14\ub978 \uac83\uc778\uc9c0\ub97c \ud655\uc778\ud569\ub2c8\ub2e4.
target-player=\uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc758 \ub300\uc0c1\uc778 \ud50c\ub808\uc774\uc5b4 \ubc84\uc804\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4. \uc774\ud6c4 \ubc84\uc804\uc5d0\uc11c \uac00\ub2a5\ud55c \uae30\ub2a5\uc740 \uc751\uc6a9 \ud504\ub85c\uadf8\ub7a8\uc5d0 \ucef4\ud30c\uc77c\ub418\uc9c0 \uc54a\uc2b5\ub2c8\ub2e4. \uc9c0\uc6d0\ub418\ub294 \ucd5c\uc18c \ubc84\uc804\uc740 "9.0.0"\uc785\ub2c8\ub2e4.
swf-version=\ucef4\ud30c\uc77c\ud55c SWF \ud30c\uc77c\uc758 \ubc84\uc804\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4.
use-direct-blit=\uac00\ub2a5\ud55c \uacbd\uc6b0 \ud558\ub4dc\uc6e8\uc5b4 \uac00\uc18d \uae30\ub2a5\uc744 \uc0ac\uc6a9\ud574\uc11c \uadf8\ub798\ud53d\uc744 \ud654\uba74\uc73c\ub85c \ube14\ub9bf(blit)\ud569\ub2c8\ub2e4.
use-gpu=\uac00\ub2a5\ud55c \uacbd\uc6b0 \uadf8\ub798\ud53d\uc744 \uadf8\ub9b4 \ub54c GPU \ud569\uc131 \uae30\ub2a5\uc744 \uc0ac\uc6a9\ud569\ub2c8\ub2e4.
tools-locale=\uc624\ub958 \ubc0f \uacbd\uace0\ub97c \ubcf4\uace0\ud560 \ub54c \ucef4\ud30c\uc77c\ub7ec\uc5d0\uc11c \uc0ac\uc6a9\ud560 \ub85c\ucf00\uc77c\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4.

# asdoc options
doc-classes=\uc124\uba85\uc11c\uc5d0 \ud3ec\ud568\ud560 \ud074\ub798\uc2a4 \ubaa9\ub85d\uc785\ub2c8\ub2e4.
doc-namespaces=\uc124\uba85\uc11c\uc5d0 \ud3ec\ud568\ud560 \ub124\uc784\uc2a4\ud398\uc774\uc2a4 \ubaa9\ub85d\uc785\ub2c8\ub2e4.
doc-sources=\uc124\uba85\uc11c\uc5d0 \ud3ec\ud568\ud560 \uc18c\uc2a4 \ud30c\uc77c \ubaa9\ub85d\uc785\ub2c8\ub2e4.
exclude-classes=\uc124\uba85\uc11c\uc5d0\uc11c \uc81c\uc678\ud560 \ud074\ub798\uc2a4 \ubaa9\ub85d\uc785\ub2c8\ub2e4.
exclude-dependencies=\uc885\uc18d\uc131 \uc81c\uc678 \uc5ec\ubd80\ub97c \uc9c0\uc815\ud558\ub294 \ubd80\uc6b8\uc785\ub2c8\ub2e4.
footer=\uc124\uba85\uc11c\uc5d0 \ud45c\uc2dc\ud560 \ubc14\ub2e5\uae00 \ubb38\uc790\uc5f4\uc785\ub2c8\ub2e4.
left-frameset-width=\uc67c\ucabd \ud504\ub808\uc784 \ub108\ube44\uc785\ub2c8\ub2e4.
main-title=\uc81c\ubaa9 \ud45c\uc2dc\uc904\uc5d0 \ud45c\uc2dc\ud560 \uc81c\ubaa9\uc785\ub2c8\ub2e4.
templates-path=\uc0ac\uc6a9\uc790 \uc815\uc758 \ud15c\ud50c\ub9bf \uacbd\ub85c\uc785\ub2c8\ub2e4.
window-title=\ube0c\ub77c\uc6b0\uc800 \ucc3d\uc5d0 \ud45c\uc2dc\ud560 \uc81c\ubaa9\uc785\ub2c8\ub2e4.
lenient=\uc62c\ubc14\ub978 \ud615\uc2dd\uc758 HTML \uc624\ub958\ub97c \uacbd\uace0\ub85c \ubcf4\uace0\ud569\ub2c8\ub2e4.
packages.package=\ud328\ud0a4\uc9c0 \uc774\ub984\uc758 \uc124\uba85\uc744 \uc9c0\uc815\ud569\ub2c8\ub2e4.
exclude-sources=\uc124\uba85\uc11c\uc5d0\uc11c \uc81c\uc678\ud560 \uc18c\uc2a4 \ud30c\uc77c \ubaa9\ub85d\uc785\ub2c8\ub2e4.
examples-path=\uc608\uc81c \ud30c\uc77c\uc744 \ucc3e\uc744 \uacbd\ub85c\uc785\ub2c8\ub2e4.
date-in-footer=\ubc14\ub2e5\uae00\uc5d0 \ub0a0\uc9dc\ub97c \ud3ec\ud568\ud560\uc9c0 \uc9c0\uc815\ud569\ub2c8\ub2e4.
package-description-file=\ud328\ud0a4\uc9c0\uc758 \uc124\uba85\uc744 \ud3ec\ud568\ud55c \ud30c\uc77c
