################################################################################
##
##  Licensed to the Apache Software Foundation (ASF) under one or more
##  contributor license agreements.  See the NOTICE file distributed with
##  this work for additional information regarding copyright ownership.
##  The ASF licenses this file to You under the Apache License, Version 2.0
##  (the "License"); you may not use this file except in compliance with
##  the License.  You may obtain a copy of the License at
##
##      http://www.apache.org/licenses/LICENSE-2.0
##
##  Unless required by applicable law or agreed to in writing, software
##  distributed under the License is distributed on an "AS IS" BASIS,
##  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
##  See the License for the specific language governing permissions and
##  limitations under the License.
##
################################################################################

benchmark=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30d9\u30f3\u30c1\u30de\u30fc\u30af\u3092\u51fa\u529b\u3057\u307e\u3059
compiler.accessible=\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u306a SWF \u3092\u751f\u6210\u3057\u307e\u3059
compiler.source-path=ActionScript \u30af\u30e9\u30b9\u968e\u5c64\u306e\u30eb\u30fc\u30c8\u3092\u5f62\u6210\u3059\u308b\u30d1\u30b9\u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u4e00\u89a7
compiler.actionscript-file-encoding=ActionScript \u30d5\u30a1\u30a4\u30eb\u306e\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002AS3 \u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306b BOM \u304c\u306a\u3044\u5834\u5408\u3001\u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u306f\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u30a8\u30f3\u30b3\u30fc\u30c7\u30a3\u30f3\u30b0\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
compiler.isolate-styles=\u30b3\u30f3\u30d1\u30a4\u30eb\u5f8c\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u307e\u305f\u306f\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001\u305d\u308c\u81ea\u8eab\u304a\u3088\u3073\u81ea\u8eab\u306e\u5b50\u306b\u5f71\u97ff\u3059\u308b\u30b9\u30bf\u30a4\u30eb\u306e\u307f\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u3059
compiler.context-root=\u30b5\u30fc\u30d3\u30b9\u30c1\u30e3\u30f3\u30cd\u30eb\u306e\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306e {context.root} \u30c8\u30fc\u30af\u30f3\u3092\u7f6e\u304d\u63db\u3048\u308b\u30d1\u30b9
compiler.external-library-path=\u30b3\u30f3\u30d1\u30a4\u30eb\u5bfe\u8c61\u3067\u3042\u308b\u304c\u3001\u30ea\u30f3\u30af\u304b\u3089\u306f\u9664\u5916\u3055\u308c\u308b SWC \u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u4e00\u89a7
compiler.fonts.languages.language-range=SWF \u306b\u57cb\u3081\u8fbc\u307e\u308c\u308b\u30d5\u30a9\u30f3\u30c8\u30b0\u30ea\u30d5\u306e\u6570\u3092\u5236\u9650\u3059\u308b\u7bc4\u56f2
compiler.fonts.managers=\u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u306e\u30d5\u30a9\u30f3\u30c8\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30af\u30e9\u30b9\u3001\u30dd\u30ea\u30b7\u30fc\u306e\u89e3\u6c7a\u9806
compiler.fonts.local-fonts-snapshot=\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306b\u306f\u3001flex2.tools.FontSnapshot \u306b\u3088\u3063\u3066\u751f\u6210\u3055\u308c\u305f\u30b7\u30b9\u30c6\u30e0\u30d5\u30a9\u30f3\u30c8\u30c7\u30fc\u30bf\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
compiler.headless-server=Flex \u304c\u30c7\u30a3\u30b9\u30d7\u30ec\u30a4\u306a\u3057\u306e\u30b5\u30fc\u30d0\u30fc\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u8a2d\u5b9a\u3055\u308c\u308b\u30d5\u30e9\u30b0
compiler.include-libraries=SWF \u306b\u5b8c\u5168\u306b\u30a4\u30f3\u30af\u30eb\u30fc\u30c9\u3055\u308c\u308b\u30e9\u30a4\u30d6\u30e9\u30ea (SWC) \u306e\u4e00\u89a7
compiler.incremental=\u30a4\u30f3\u30af\u30ea\u30e1\u30f3\u30bf\u30eb\u30b3\u30f3\u30d1\u30a4\u30eb\u3092\u6709\u52b9\u306b\u3057\u307e\u3059
compiler.keep-all-type-selectors=\u4f7f\u7528\u3055\u308c\u3066\u3044\u306a\u3044 CSS \u30bf\u30a4\u30d7\u30bb\u30ec\u30af\u30bf\u30fc\u306e\u524a\u9664\u3092\u7121\u52b9\u306b\u3057\u307e\u3059
compiler.keep-generated-actionscript=MXML \u30b3\u30f3\u30d1\u30a4\u30eb\u6642\u306b\u751f\u6210\u3055\u308c\u305f\u4e00\u6642\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3057\u307e\u3059
compiler.keep-generated-signatures=AS3 \u30b3\u30f3\u30d1\u30a4\u30eb\u4e2d\u306b\u751f\u6210\u3055\u308c\u308b\u7f72\u540d\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u3059\u308b
compiler.keep-as3-metadata=SWF \u5185\u306b\u6307\u5b9a\u3055\u308c\u305f\u30e1\u30bf\u30c7\u30fc\u30bf\u3092\u4fdd\u6301\u3059\u308b
compiler.library-path=SWC \u30d5\u30a1\u30a4\u30eb\u307e\u305f\u306f SWC \u30d5\u30a1\u30a4\u30eb\u3092\u683c\u7d0d\u3059\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u4e00\u89a7
compiler.locale=\u56fd\u969b\u5316\u7528\u306b\u30ed\u30b1\u30fc\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059
compiler.mobile=\u30bf\u30fc\u30b2\u30c3\u30c8\u30e9\u30f3\u30bf\u30a4\u30e0\u304c\u30e2\u30d0\u30a4\u30eb\u30c7\u30d0\u30a4\u30b9\u3067\u3042\u308b\u3053\u3068\u3092\u6307\u5b9a\u3057\u307e\u3059
compiler.mxml.compatibility-version=\u4e92\u63db\u6027\u306e\u3042\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u6307\u5b9a\u3057\u307e\u3059 (compatibility-version=2.0.1 \u306a\u3069)
compiler.namespaces.namespace=MXML \u30a8\u30ec\u30e1\u30f3\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u305f\u3081\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30de\u30cb\u30d5\u30a7\u30b9\u30c8\u306b\u95a2\u9023\u4ed8\u3051\u308b URI \u3092\u6307\u5b9a\u3057\u307e\u3059
compiler.optimize=\u30ea\u30f3\u30af\u5f8c\u306e SWF \u306e\u6700\u9069\u5316\u3092\u6709\u52b9\u306b\u3057\u307e\u3059
compiler.preloader=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ea\u30ed\u30fc\u30c0\u30fc\u5c5e\u6027\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30d7\u30ea\u30ed\u30fc\u30c0\u30fc\u5024\u306f\u3001-compatibility-version >= 4.0 \u306e\u3068\u304d\u306b mx.preloaders.SparkDownloadProgressBar \u3068\u306a\u308a\u3001-compatibility-version < 4.0 \u306e\u3068\u304d\u306b mx.preloaders.DownloadProgressBar \u3068\u306a\u308a\u307e\u3059\u3002
compiler.profile=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u3084\u30e1\u30e2\u30ea\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u9069\u3057\u305f\u30e0\u30fc\u30d3\u30fc\u3092\u751f\u6210\u3057\u307e\u3059
compiler.services=Flex \u30c7\u30fc\u30bf\u30b5\u30fc\u30d3\u30b9\u8a2d\u5b9a\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u30d1\u30b9
compiler.omit-trace-statements=trace \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u7701\u7565\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5207\u308a\u66ff\u3048\u307e\u3059
compiler.report-invalid-styles-as-warnings=\u7121\u52b9\u306a\u30b9\u30bf\u30a4\u30eb\u3092\u8b66\u544a\u3068\u3057\u3066\u5831\u544a\u3057\u307e\u3059
compiler.report-missing-required-skin-parts-as-warnings=\u5fc5\u8981\u306a\u30b9\u30ad\u30f3\u30d1\u30fc\u30c4\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u5834\u5408\u306b\u30a8\u30e9\u30fc\u3067\u306f\u306a\u304f\u8b66\u544a\u3092\u751f\u6210\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
compiler.show-invalid-css-property-warnings=\u7121\u52b9\u306a CSS \u30d7\u30ed\u30d1\u30c6\u30a3\u306b\u95a2\u3059\u308b\u8b66\u544a\u3092\u5831\u544a\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5207\u308a\u66ff\u3048\u307e\u3059
compiler.show-binding-warnings=\u30c7\u30fc\u30bf\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30b3\u30fc\u30c9\u304b\u3089\u751f\u6210\u3055\u308c\u308b\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5207\u308a\u66ff\u3048\u307e\u3059
compiler.show-actionscript-warnings=\u6709\u52b9\u3067\u3042\u308b\u304c\u90e8\u5206\u7684\u306b\u6b63\u3057\u304f\u306a\u3044\u30b3\u30fc\u30c9\u3092\u691c\u51fa\u3059\u308b\u30e2\u30fc\u30c9\u3067 AS3 \u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u3092\u5b9f\u884c\u3057\u307e\u3059
compiler.show-dependency-warnings=\u30b3\u30f3\u30d1\u30a4\u30eb\u6642\u306b\u4f9d\u5b58\u95a2\u4fc2\u3092\u78ba\u8a8d\u3067\u304d\u306a\u304b\u3063\u305f\u5834\u5408\u306b\u3001\u8b66\u544a\u3092\u8868\u793a\u3057\u307e\u3059
compiler.show-deprecation-warnings=\u63a8\u5968\u3055\u308c\u306a\u3044 API \u3092\u4f7f\u7528\u3057\u305f\u5834\u5408\u306b\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5207\u308a\u66ff\u3048\u307e\u3059
compiler.show-shadowed-device-font-warnings=\u57cb\u3081\u8fbc\u307f\u30d5\u30a9\u30f3\u30c8\u540d\u304c\u30c7\u30d0\u30a4\u30b9\u30d5\u30a9\u30f3\u30c8\u540d\u306b\u5f71\u97ff\u3059\u308b\u5834\u5408\u306b\u3001\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5207\u308a\u66ff\u3048\u307e\u3059
compiler.show-unused-type-selector-warnings=\u4f7f\u7528\u3055\u308c\u3066\u3044\u306a\u3044 CSS \u30bf\u30a4\u30d7\u30bb\u30ec\u30af\u30bf\u30fc\u304b\u3089\u751f\u6210\u3055\u308c\u308b\u8b66\u544a\u3092\u8868\u793a\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5207\u308a\u66ff\u3048\u307e\u3059
compiler.signature-directory=\u751f\u6210\u3055\u308c\u305f as3 \u7f72\u540d\u304c\u4fdd\u5b58\u3055\u308c\u308b [\u76f8\u5bfe/\u7d76\u5bfe] \u30c7\u30a3\u30ec\u30af\u30c8\u30ea
compiler.strict=\u53b3\u5bc6\u306a\u30a8\u30e9\u30fc\u30c1\u30a7\u30c3\u30af\u30e2\u30fc\u30c9\u3067 AS3 \u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u3092\u5b9f\u884c\u3057\u307e\u3059
compiler.as3=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u3092\u5411\u4e0a\u3055\u305b\u3001\u30a8\u30e9\u30fc\u5831\u544a\u6a5f\u80fd\u3092\u5f37\u5316\u3059\u308b\u306b\u306f\u3001ActionScript 3 \u30af\u30e9\u30b9\u306b\u57fa\u3065\u304f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30e2\u30c7\u30eb\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30af\u30e9\u30b9\u306b\u57fa\u3065\u304f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30e2\u30c7\u30eb\u3067\u306f\u3001\u307b\u3068\u3093\u3069\u306e\u7d44\u307f\u8fbc\u307f\u95a2\u6570\u306f\u30af\u30e9\u30b9\u306e\u56fa\u5b9a\u30e1\u30bd\u30c3\u30c9\u3068\u3057\u3066\u5b9f\u88c5\u3055\u308c\u307e\u3059\u3002
compiler.es=\u30d7\u30ed\u30c8\u30bf\u30a4\u30d7\u30d7\u30ed\u30d1\u30c6\u30a3\u3092\u52d5\u7684\u306b\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u306b\u306f\u3001ECMAScript Edition 3 \u306e\u30d7\u30ed\u30c8\u30bf\u30a4\u30d7\u306b\u57fa\u3065\u304f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30e2\u30c7\u30eb\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30d7\u30ed\u30c8\u30bf\u30a4\u30d7\u306b\u57fa\u3065\u304f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30e2\u30c7\u30eb\u3067\u306f\u3001\u7d44\u307f\u8fbc\u307f\u95a2\u6570\u306f\u30d7\u30ed\u30c8\u30bf\u30a4\u30d7\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u52d5\u7684\u30d7\u30ed\u30d1\u30c6\u30a3\u3068\u3057\u3066\u5b9f\u88c5\u3055\u308c\u307e\u3059\u3002
compiler.theme=\u30c6\u30fc\u30de\u3068\u3057\u3066\u9069\u7528\u3059\u308b CSS \u307e\u305f\u306f SWC \u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u89a7
compiler.verbose-stacktraces=\u30c7\u30d0\u30c3\u30b0\u7528\u306b\u30b3\u30fc\u30eb\u30b9\u30bf\u30c3\u30af\u60c5\u5831\u3092 SWF \u306b\u4fdd\u5b58\u3057\u307e\u3059
compiler.memory-usage-factor=\u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u306e\u30e1\u30e2\u30ea\u4f7f\u7528\u7387\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f 1000 \u3067\u3059\u3002
compiler.conservative=\u5f93\u6765\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u4f7f\u7528\u3057\u3066\u30b3\u30f3\u30d1\u30a4\u30eb\u3055\u308c\u307e\u3059\u3002\u5927\u898f\u6a21\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5bfe\u3057\u3066\u306f\u63a8\u5968\u3055\u308c\u307e\u305b\u3093\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f false \u3067\u3059\u3002
compiler.warn-array-tostring-changes=Array.toString() \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306f\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
compiler.warn-assignment-within-conditional=\u6761\u4ef6\u5185\u306e\u4ee3\u5165\u3067\u3059\u3002
compiler.warn-bad-array-cast=\u7121\u52b9\u306a Array \u30ad\u30e3\u30b9\u30c8\u6f14\u7b97\u3067\u3042\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
compiler.warn-bad-bool-assignment=\u30d6\u30fc\u30eb\u5024\u304c\u5fc5\u8981\u3067\u3059\u304c\u3001\u975e\u30d6\u30fc\u30eb\u5024\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
compiler.warn-bad-date-cast=\u7121\u52b9\u306a Date \u30ad\u30e3\u30b9\u30c8\u6f14\u7b97\u3067\u3059\u3002
compiler.warn-bad-es3-type-method=\u4e0d\u660e\u306a\u30e1\u30bd\u30c3\u30c9\u3067\u3059\u3002
compiler.warn-bad-es3-type-prop=\u4e0d\u660e\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u3067\u3059\u3002
compiler.warn-bad-nan-comparison=NaN \u306e\u6bd4\u8f03\u304c\u7121\u52b9\u3067\u3059\u3002NaN \u3092\u542b\u3080\u6bd4\u8f03\u51e6\u7406\u306f\u3001NaN != NaN \u3068\u306a\u308b\u305f\u3081 false \u306b\u306a\u308a\u307e\u3059\u3002
compiler.warn-bad-null-assignment=null \u306b\u4ee3\u5165\u3067\u304d\u307e\u305b\u3093\u3002
compiler.warn-bad-null-comparison=null \u306e\u6bd4\u8f03\u304c\u7121\u52b9\u3067\u3059\u3002
compiler.warn-bad-undefined-comparison=undefined \u306e\u6bd4\u8f03\u304c\u975e\u8ad6\u7406\u7684\u3067\u3059\u3002\u578b\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5909\u6570 (\u307e\u305f\u306f * \u578b\u306e\u5909\u6570) \u306e\u307f undefined \u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
compiler.warn-boolean-constructor-with-no-args=Boolean() \u3092\u5f15\u6570\u306a\u3057\u3067\u547c\u3073\u51fa\u3059\u3068\u3001ActionScript 3.0 \u3067\u306f false \u304c\u8fd4\u3055\u308c\u307e\u3059\u3002ActionScript 2.0 \u3067\u306f Boolean() \u306b undefined \u304c\u8fd4\u3055\u308c\u3066\u3044\u307e\u3057\u305f\u3002
compiler.warn-changes-in-resolve=__resolve \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3057\u305f\u3002
compiler.warn-class-is-sealed=\u30af\u30e9\u30b9\u306f sealed \u3067\u3059\u3002\u3053\u306e\u30af\u30e9\u30b9\u306b\u30e1\u30f3\u30d0\u30fc\u3092\u52d5\u7684\u306b\u8ffd\u52a0\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
compiler.warn-const-not-initialized=\u5b9a\u6570\u304c\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
compiler.warn-constructor-returns-value=new \u5f0f\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u95a2\u6570\u306f\u5024\u3092\u8fd4\u3057\u307e\u3059\u3002\u7d50\u679c\u306f\u3001\u95a2\u6570\u306e\u65b0\u3057\u3044\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3067\u306f\u306a\u304f\u3001\u305d\u306e\u95a2\u6570\u306e\u623b\u308a\u5024\u306b\u306a\u308a\u307e\u3059\u3002
compiler.warn-deprecated-event-handler-error=EventHandler \u304c\u30ea\u30b9\u30ca\u30fc\u3068\u3057\u3066\u8ffd\u52a0\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
compiler.warn-deprecated-function-error=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044 ActionScript 2.0 \u306e\u95a2\u6570\u3067\u3059\u3002
compiler.warn-deprecated-property-error=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044 ActionScript 2.0 \u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3067\u3059\u3002
compiler.warn-duplicate-argument-names=\u540c\u3058\u540d\u524d\u306e\u5f15\u6570\u304c\u8907\u6570\u3042\u308a\u307e\u3059\u3002
compiler.warn-for-var-in-changes=ActionScript 3.0 \u3067\u306f\u3001\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3092 "for x in target" \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u5185\u3067\u30e9\u30f3\u30c0\u30e0\u306a\u9806\u756a\u3067\u7e70\u308a\u8fd4\u3057\u51e6\u7406\u3057\u307e\u3059\u3002
compiler.warn-import-hides-class=\u73fe\u5728\u306e\u30af\u30e9\u30b9\u3068\u540c\u3058\u540d\u524d\u3067\u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3068\u3001\u3053\u306e\u30b9\u30b3\u30fc\u30d7\u5185\u306e\u30af\u30e9\u30b9\u8b58\u5225\u5b50\u304c\u975e\u8868\u793a\u306b\u306a\u308a\u307e\u3059\u3002
compiler.warn-instance-of-changes=instanceof \u6f14\u7b97\u5b50\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
compiler.warn-internal-error=\u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u306e\u5185\u90e8\u30a8\u30e9\u30fc\u3067\u3059\u3002
compiler.warn-level-not-supported=_level \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3057\u305f\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001flash.display \u30d1\u30c3\u30b1\u30fc\u30b8\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
compiler.warn-missing-namespace-decl=\u540d\u524d\u7a7a\u9593\u306e\u5ba3\u8a00\u304c\u3042\u308a\u307e\u305b\u3093 (\u5909\u6570\u304c public \u3084 private \u306a\u3069\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093)\u3002
compiler.warn-negative-uint-literal=\u8ca0\u306e\u5024\u3092 uint \u30c7\u30fc\u30bf\u578b\u306b\u5272\u308a\u5f53\u3066\u308b\u3068\u3001\u5927\u304d\u3044\u6b63\u306e\u5024\u306b\u306a\u308a\u307e\u3059\u3002
compiler.warn-no-constructor=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
compiler.warn-no-explicit-super-call-in-constructor=super() \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u304c\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u5185\u3067\u547c\u3073\u51fa\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
compiler.warn-no-type-decl=\u578b\u5ba3\u8a00\u304c\u3042\u308a\u307e\u305b\u3093\u3002
compiler.warn-number-from-string-changes=ActionScript 3.0 \u3067\u306f\u3001\u7a7a\u767d\u6587\u5b57\u306f\u7121\u8996\u3055\u308c\u3001'' \u306f 0 \u3092\u8fd4\u3057\u307e\u3059\u3002ActionScript 2.0 \u3067\u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c '' \u3067\u3042\u308b\u304b\u7a7a\u767d\u6587\u5b57\u3092\u542b\u3080\u5834\u5408\u306b\u3001Number() \u306f NaN \u3092\u8fd4\u3057\u307e\u3059\u3002
compiler.warn-scoping-change-in-this=this \u30ad\u30fc\u30ef\u30fc\u30c9\u306e\u30b9\u30b3\u30fc\u30d7\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002\u30af\u30e9\u30b9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304b\u3089\u62bd\u51fa\u3057\u305f\u30af\u30e9\u30b9\u30e1\u30bd\u30c3\u30c9\u3067\u306f\u3001this \u3067\u5e38\u306b\u305d\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u53c2\u7167\u3057\u307e\u3059\u3002ActionScript 2.0 \u3067\u306f\u3001\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3057\u305f\u5834\u6240\u306b\u57fa\u3065\u3044\u3066 this \u3092\u52d5\u7684\u306b\u53c2\u7167\u3057\u307e\u3059\u3002
compiler.warn-slow-text-field-addition=TextField \u3067 += \u3092\u4f7f\u7528\u3059\u308b\u306e\u306f\u52b9\u679c\u7684\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
compiler.warn-unlikely-function-value=\u62ec\u5f27\u304c\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
compiler.warn-xml-class-has-changed=ActionScript 2.0 XML \u30af\u30e9\u30b9\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
debug-password=\u30c7\u30d0\u30c3\u30b0\u53ef\u80fd\u306a SWF \u306b\u542b\u3081\u308b\u30d1\u30b9\u30ef\u30fc\u30c9
default-background-color=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u80cc\u666f\u8272 (\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b3\u30fc\u30c9\u306b\u3088\u3063\u3066\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059)
default-frame-rate=SWF \u3067\u4f7f\u7528\u3059\u308b\u65e2\u5b9a\u306e\u30d5\u30ec\u30fc\u30e0\u30ec\u30fc\u30c8\u3002
default-script-limits=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u5b9f\u884c\u306e\u5236\u9650 (\u30eb\u30fc\u30c8\u5c5e\u6027\u306b\u3088\u3063\u3066\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u307e\u3059)
default-size=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30a4\u30ba (\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30eb\u30fc\u30c8\u5c5e\u6027\u306b\u3088\u3063\u3066\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u307e\u3059)
dependency-info=\u30af\u30e9\u30b9\u306e\u4f9d\u5b58\u95a2\u4fc2\u60c5\u5831\u3092\u51fa\u529b\u3057\u307e\u3059
dependency.minimize-dependency-set=SWC \u5185\u3067\u89e3\u6c7a\u3055\u308c\u3066\u3044\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u4ed6\u306e\u4f9d\u5b58 SWC \u5185\u3067\u89e3\u6c7a\u3055\u308c\u3066\u3044\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u30b5\u30d6\u30bb\u30c3\u30c8\u3067\u3042\u308b\u5834\u5408\u306f\u3001\u4f9d\u5b58\u30bb\u30c3\u30c8\u304b\u3089 SWC \u3092\u524a\u9664\u3057\u307e\u3059\u3002  
dependency.show-external-classes=SWC \u9593\u306e\u4f9d\u5b58\u95a2\u4fc2\u3092\u767a\u751f\u3055\u305b\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u30af\u30e9\u30b9\u3092\u8868\u793a\u3059\u308b\u306b\u306f\u3001true \u306b\u8a2d\u5b9a\u3057\u307e\u3059 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f false)\u3002
dependency.show-swcs=SWC \u540d\u306e\u4e00\u89a7\u3001\u30d5\u30eb\u30d1\u30b9\u306f\u5fc5\u8981\u3042\u308a\u307e\u305b\u3093\u3002\u4f9d\u5b58\u95a2\u4fc2\u60c5\u5831\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f SWC \u306b\u5bfe\u3057\u3066\u306e\u307f\u8868\u793a\u3055\u308c\u3001\u4f9d\u5b58\u95a2\u4fc2\u306e\u5206\u6790\u306b\u306f\u5f71\u97ff\u3092\u4e0e\u3048\u307e\u305b\u3093\u3002
dependency.show-types=\u30b9\u30af\u30ea\u30d7\u30c8\u30af\u30e9\u30b9\u306e\u4f9d\u5b58\u95a2\u4fc2\u30bf\u30a4\u30d7\u3092\u8868\u793a\u3059\u308b\u306b\u306f\u3001true \u306b\u8a2d\u5b9a\u3057\u307e\u3059 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f false)\u3002
dependency.types=SWC \u306e\u4f9d\u5b58\u95a2\u4fc2\u3092\u5224\u5225\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30af\u30e9\u30b9\u3092\u7d5e\u308a\u8fbc\u3080\u305f\u3081\u306e\u4f9d\u5b58\u95a2\u4fc2\u30bf\u30a4\u30d7\u306e\u4e00\u89a7\u3002\u53ef\u80fd\u306a\u5024\u306f i\u3001s\u3001n\u3001e \u3067\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u3059\u3079\u3066\u306e\u4f9d\u5b58\u95a2\u4fc2\u30bf\u30a4\u30d7\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
digest.rsl-file=\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u3092\u8a08\u7b97\u3059\u308b RSL \u306e\u5834\u6240
digest.swc-path=\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u3092\u66f4\u65b0\u3059\u308b swc \u30d5\u30a3\u30eb\u307e\u305f\u306f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30d1\u30b9
directory=SWC \u30d5\u30a1\u30a4\u30eb\u3067\u306f\u306a\u304f\u30aa\u30fc\u30d7\u30f3\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3068\u3057\u3066\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u51fa\u529b\u3057\u307e\u3059
dump-config=\u73fe\u5728\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u8a2d\u5b9a\u5024\u3092\u542b\u3080\u30d5\u30a1\u30a4\u30eb\u3092\u3001flex \u8a2d\u5b9a\u30d5\u30a1\u30a4\u30eb\u3068\u3057\u3066\u9069\u3057\u305f\u5f62\u5f0f\u3067\u66f8\u304d\u8fbc\u307f\u307e\u3059
externs=SWF \u306e\u69cb\u7bc9\u6642\u306b\u30ea\u30f3\u30af\u5bfe\u8c61\u304b\u3089\u9664\u5916\u3059\u308b\u30b7\u30f3\u30dc\u30eb\u306e\u4e00\u89a7
includes=SWF \u30d5\u30a1\u30a4\u30eb\u4f5c\u6210\u6642\u306b\u5e38\u306b\u30ea\u30f3\u30af\u3055\u308c\u308b\u30b7\u30f3\u30dc\u30eb\u306e\u4e00\u89a7\u3067\u3059
include-classes=\u51fa\u529b SWC \u306b\u542b\u3081\u308b\u30af\u30e9\u30b9\u306e\u4e00\u89a7
include-file=\u51fa\u529b SWC \u306b\u542b\u3081\u308b\u540d\u524d\u4ed8\u304d\u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u89a7
include-lookup-only=true \u306e\u5834\u5408\u3001lookupOnly=true \u306e\u30de\u30cb\u30d5\u30a7\u30b9\u30c8\u30a8\u30f3\u30c8\u30ea\u304c SWC \u30ab\u30bf\u30ed\u30b0\u306b\u542b\u307e\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f false \u3067\u3059\u3002
include-namespaces=\u30ea\u30b9\u30c8\u3055\u308c\u3066\u3044\u308b\u540d\u524d\u7a7a\u9593\u5185\u306e\u3059\u3079\u3066\u306e\u30af\u30e9\u30b9\u304c\u51fa\u529b SWC \u306b\u542b\u307e\u308c\u307e\u3059
include-resource-bundles=\u51fa\u529b SWC \u306b\u542b\u3081\u308b\u30ea\u30bd\u30fc\u30b9\u30d0\u30f3\u30c9\u30eb\u306e\u4e00\u89a7
include-sources=\u51fa\u529b SWC \u306b\u542b\u3081\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3068\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u89a7
include-stylesheet=\u51fa\u529b SWC \u306b\u542b\u3081\u308b\u540d\u524d\u4ed8\u304d\u30b9\u30bf\u30a4\u30eb\u30b7\u30fc\u30c8\u30ea\u30bd\u30fc\u30b9\u306e\u4e00\u89a7
file-specs=\u30b3\u30f3\u30d1\u30a4\u30eb\u5bfe\u8c61\u306e\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u89a7\u3067\u3001\u6700\u5f8c\u306b\u6307\u5b9a\u3057\u305f\u30d5\u30a1\u30a4\u30eb\u306f\u30bf\u30fc\u30b2\u30c3\u30c8\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059
frames.frame=\u30d5\u30ec\u30fc\u30e0\u306b\u30ea\u30f3\u30af\u3055\u308c\u308b\u4e00\u9023\u306e\u30af\u30e9\u30b9\u540d\u3092\u542b\u3080 SWF \u30d5\u30ec\u30fc\u30e0\u30e9\u30d9\u30eb\u3002
generate-frame-loader=IFlexModuleFactory \u304b\u3089\u6d3e\u751f\u3057\u305f\u30ed\u30fc\u30c0\u30fc\u30af\u30e9\u30b9\u3092\u751f\u6210\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5207\u308a\u66ff\u3048\u307e\u3059
help=\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u30b7\u30f3\u30bf\u30c3\u30af\u30b9\u306e\u60c5\u5831\u304a\u3088\u3073\u8a2d\u5b9a\u5909\u6570\u306e\u8aac\u660e\u306b\u3064\u3044\u3066\u306f\u3001\u691c\u7d22\u30b9\u30c8\u30ea\u30f3\u30b0\u307e\u305f\u306f\u6b21\u306e\u3044\u305a\u308c\u304b\u306e\u7279\u5225\u306a\u30ad\u30fc\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059 :\n   syntax   - \u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u306e\u4e00\u822c\u7684\u306a\u30b7\u30f3\u30bf\u30c3\u30af\u30b9\u3092\u8aac\u660e\u3057\u307e\u3059\n   list     - \u3059\u3079\u3066\u306e\u57fa\u672c\u7684\u306a\u8a2d\u5b9a\u5909\u6570\u3092\u4e00\u89a7\u8868\u793a\u3057\u307e\u3059\n   advanced - \u9ad8\u5ea6\u306a\u8a2d\u5b9a\u5909\u6570\u3092\u691c\u7d22\u3057\u307e\u3059\n   aliases  - \u5909\u6570\u306e\u77ed\u3044\u30a8\u30a4\u30ea\u30a2\u30b9\u3092\u4f7f\u7528\u3057\u3066\u30bd\u30fc\u30c8\u3057\u307e\u3059\n   details  - \u5404\u30a2\u30a4\u30c6\u30e0\u306e\u5b8c\u5168\u306a\u8a73\u7d30\u3092\u5e38\u306b\u8868\u793a\u3057\u307e\u3059\n\u305d\u306e\u4ed6\u306e\u30d8\u30eb\u30d7\u30ad\u30fc\u30ef\u30fc\u30c9\u306f\u3001\u5b8c\u5168\u307e\u305f\u306f\u90e8\u5206\u7684\u306b\u4e00\u81f4\u3059\u308b\u8a2d\u5b9a\u5909\u6570\u3001\u30a8\u30a4\u30ea\u30a2\u30b9\u3001\u8a2d\u5b9a\u5909\u6570\u306e\u8aac\u660e\u5185\u306b\u542b\u307e\u308c\u308b\u30c6\u30ad\u30b9\u30c8\u306e\u691c\u7d22\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\n\n\u4f8b\u3048\u3070\u3001'-help advanced aliases foo' \u3068\u5165\u529b\u3059\u308b\u3068\u3001'foo' \u3068\u3044\u3046\u30c6\u30ad\u30b9\u30c8\u3092\u542b\u3080\u3059\u3079\u3066\u306e\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3\uff08\u57fa\u672c\u304a\u3088\u3073\u9ad8\u5ea6\u306e\u4e21\u65b9\uff09\u304c\u30a8\u30a4\u30ea\u30a2\u30b9\u540d\u9806\u306b\u30bd\u30fc\u30c8\u3055\u308c\u3066\u8868\u793a\u3055\u308c\u307e\u3059\u3002\n\n\u500b\u5225\u306e\u8a2d\u5b9a\u5909\u6570\u306e\u8aac\u660e\u3067\u306f\u3001\u5fc5\u9808\u306e\u5024\u306f\u5c71\u30ab\u30c3\u30b3\u3067\u793a\u3055\u308c\u3001\u30aa\u30d7\u30b7\u30e7\u30f3\u5024\u306f\u89d2\u30ab\u30c3\u30b3\u3067\u793a\u3055\u308c\u307e\u3059\u3002[...] \u306f\u3001\u5024\u304c\u4efb\u610f\u306e\u9577\u3055\u306e\u30ea\u30b9\u30c8\u3067\u3042\u308b\u3053\u3068\u3092\u793a\u3059\u305f\u3081\u306b\u4f7f\u308f\u308c\u307e\u3059\u3002
lazy-init=ABC \u30d0\u30a4\u30c8\u30b3\u30fc\u30c9\u306e\u9045\u5ef6\u521d\u671f\u5316\u3092\u6709\u52b9 / \u7121\u52b9\u306b\u3057\u307e\u3059\u3002
link-report=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30ea\u30f3\u30af\u3055\u308c\u308b\u3059\u3079\u3066\u306e\u5b9a\u7fa9\u306b\u95a2\u3059\u308b XML \u5f62\u5f0f\u306e\u30ec\u30dd\u30fc\u30c8\u3092\u51fa\u529b\u3057\u307e\u3059\u3002
load-config=\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u542b\u3080\u30d5\u30a1\u30a4\u30eb\u3092\u30ed\u30fc\u30c9\u3057\u307e\u3059
load-externs=SWF \u306e\u69cb\u7bc9\u6642\u306b\u30ea\u30f3\u30af\u5bfe\u8c61\u304b\u3089\u9664\u5916\u3059\u308b <def>\u3001<pre>\u3001\u304a\u3088\u3073 <ext> \u30b7\u30f3\u30dc\u30eb\u3092\u542b\u3080 XML \u30d5\u30a1\u30a4\u30eb
metadata.contributor=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u6295\u7a3f\u8005\u306e\u540d\u524d
metadata.creator=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u4f5c\u6210\u8005\u306e\u540d\u524d
metadata.date=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u4f5c\u6210\u65e5
metadata.description=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u8aac\u660e
metadata.language=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u8a00\u8a9e (EN\u3001FR \u306a\u3069)
metadata.localized-description=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u3055\u308c\u305f RDF/XMP \u306e\u8aac\u660e
metadata.localized-title=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u3055\u308c\u305f RDF/XMP \u30bf\u30a4\u30c8\u30eb
metadata.publisher=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u767a\u884c\u8005\u306e\u540d\u524d
metadata.title=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30bf\u30a4\u30c8\u30eb
output=\u4f5c\u6210\u3059\u308b SWF \u30e0\u30fc\u30d3\u30fc\u306e\u30d5\u30a1\u30a4\u30eb\u540d
raw-metadata=SWF \u30e1\u30bf\u30c7\u30fc\u30bf\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b XML \u30c6\u30ad\u30b9\u30c8 (metadata.* \u306e\u8a2d\u5b9a\u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3057\u307e\u3059)
runtime-shared-libraries=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u8d77\u52d5\u3059\u308b\u524d\u306b\u30ed\u30fc\u30c9\u3055\u308c\u308b\u30e9\u30f3\u30bf\u30a4\u30e0\u5171\u6709\u30e9\u30a4\u30d6\u30e9\u30ea\u306e URL \u306e\u4e00\u89a7
size-report=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30ea\u30f3\u30af\u3055\u308c\u308b\u3059\u3079\u3066\u306e\u30b3\u30fc\u30c9\u3068\u30c7\u30fc\u30bf\u306e\u30b5\u30a4\u30ba\u306b\u95a2\u3059\u308b XML \u5f62\u5f0f\u306e\u30ec\u30dd\u30fc\u30c8\u3092\u51fa\u529b\u3057\u307e\u3059\u3002
use-network=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30ea\u30bd\u30fc\u30b9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306b\u3064\u3044\u3066 SWF \u306b\u30d5\u30e9\u30b0\u3092\u8a2d\u5b9a\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u5207\u308a\u66ff\u3048\u307e\u3059
version=\u30d7\u30ed\u30b0\u30e9\u30e0\u306e\u30d3\u30eb\u30c9\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u8868\u793a\u3057\u307e\u3059
warnings=\u8b66\u544a\u306e\u8868\u793a\u3092\u5207\u308a\u66ff\u3048\u307e\u3059

Syntax=\u30b7\u30f3\u30bf\u30c3\u30af\u30b9 : ${program} [\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3] [\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5f15\u6570]\n\n\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u4e0a\u3067 '-\u5909\u6570=\u5024,\u5024,\u5024' \u306e\u3088\u3046\u306b\u8a2d\u5b9a\u3057\u307e\u3059 \uff08\u5fc5\u8981\u306a\u5024\u306e\u6570\u306f\u5909\u6570\u306b\u3088\u3063\u3066\u7570\u306a\u308a\u307e\u3059\uff09\u3002\u30d6\u30fc\u30eb\u5024\u306e\u5834\u5408\u306f\u3001'-\u5909\u6570=true' \u3067\u6709\u52b9\u3001'-\u5909\u6570=false' \u3067\u7121\u52b9\u3001'-\u5909\u6570' \u306f'-\u5909\u6570=true' \u306e\u7701\u7565\u5f62\u3067\u3059\u3002\u5909\u6570\u306f\u3001'-variable='\uff08= \u306e\u5f8c\u306b\u5024\u306a\u3057\uff09\u3068\u8a2d\u5b9a\u3059\u308b\u3068\u3001\u30af\u30ea\u30a2\u3055\u308c\u307e\u3059\u3002\n\n\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5f15\u6570\u4e00\u89a7\u306f '${defaultVar}' \u5909\u6570\u306b\u76f8\u5f53\u3057\u307e\u3059\u3002 \u7279\u6b8a\u306a\u30b9\u30c8\u30ea\u30f3\u30b0 '--' \u306f\u3001\u540d\u524d\u4ed8\u304d\u306e\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u51e6\u7406\u3092\u7d42\u4e86\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u306e\u6b8b\u308a\u306e\u5024\u306f\u5f37\u5236\u7684\u306b\u30c7\u30d5\u30a9\u30eb\u30c8\u5f15\u6570\u3068\u3057\u3066\u89e3\u91c8\u3055\u308c\u307e\u3059\u3002\n\n\u4e00\u822c\u7684\u306b\u3001\u65e2\u5b9a\u306e\u5909\u6570\u306f 1 \u56de\u3060\u3051\u8a2d\u5b9a\u3057\u307e\u3059\u304c\u3001\u8aac\u660e\u306b 'repeatable' \u3068\u6ce8\u8a18\u304c\u3042\u308b\u4e00\u90e8\u306e\u5909\u6570\u306f\u8907\u6570\u56de\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001'-a=x,y,z' \u306f 'a' \u304c 'repeatable' \u306e\u5834\u5408\u3001'-a=x -a=y -a=z' \u3068\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002\u7e70\u308a\u8fd4\u3057\u53ef\u80fd\u306a\u5909\u6570\u306e\u4fbf\u5229\u306a\u7279\u6027\u306b\u3001\u7279\u6b8a\u306a\u30b7\u30f3\u30bf\u30c3\u30af\u30b9'-\u5909\u6570+=\u5024,\u5024' \u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001\u73fe\u5728\u306e\u5024\u4e00\u89a7\u3092\u7f6e\u304d\u63db\u3048\u305a\u306b\u73fe\u5728\u306e\u5024\u306b\u65b0\u898f\u306e\u5024\u30bb\u30c3\u30c8\u3092\u8ffd\u52a0\u3067\u304d\u307e\u3059\u3002\n\n\u8a2d\u5b9a\u5909\u6570\u306f\u3001\u5165\u529b\u3057\u3084\u3059\u3044\u77ed\u7e2e\u5f62\u306e\u30a8\u30a4\u30ea\u30a2\u30b9\u3092\u6301\u3063\u3066\u3044\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002\u968e\u5c64\u7684\u306a\u30c9\u30c3\u30c8\u306e\u4ed8\u3044\u305f\u5909\u6570\u540d\u306f\u3001'\u8449' \u306e\u540d\u524d\uff08\u56fa\u6709\u306e\u540d\u524d\u306e\u5834\u5408\uff09\u304b\u3089\u6d3e\u751f\u3059\u308b\u30a8\u30a4\u30ea\u30a2\u30b9\u304c\u81ea\u52d5\u7684\u306b\u4ed8\u3051\u3089\u308c\u307e\u3059\u3002\n\n\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u3067\u30d5\u30a1\u30a4\u30eb\u540d\u3092\u6307\u5b9a\u3059\u308b\u3068\u304d\u306f\u3001\u7d76\u5bfe\u30d1\u30b9\u3001\u307e\u305f\u306f\u73fe\u5728\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u306e\u76f8\u5bfe\u30d1\u30b9\u3092\u7528\u3044\u3066\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\n'${program} -help list' \u30b7\u30f3\u30bf\u30c3\u30af\u30b9\u3092\u4f7f\u7528\u3057\u3066\u5229\u7528\u53ef\u80fd\u306a\u8a2d\u5b9a\u5909\u6570\u306e\u4e00\u89a7\u3092\u898b\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002

AdvancedSyntax=\u30b7\u30f3\u30bf\u30c3\u30af\u30b9 : ${program} [\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3] [\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5f15\u6570]\n\n\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u4e0a\u3067\u6b21\u306e\u3088\u3046\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002'-\u5909\u6570=\u5024,\u5024,\u5024' \u307e\u305f\u306f '-\u5909\u6570 \u5024 \u5024'\uff08\u5fc5\u8981\u306a\u5024\u306e\u6570\u306f\u5909\u6570\u306b\u3088\u3063\u3066\u7570\u306a\u308a\u307e\u3059\uff09\u3002 \u30d6\u30fc\u30eb\u5024\u306e\u5834\u5408\u306f\u3001enabled with '-variable=true' and disabled with '-variable=false', with '-variable' being shorthand for '-variable=true'.\u5909\u6570\u306f\u3001'-variable='\uff08= \u306e\u5f8c\u306b\u5024\u306a\u3057\uff09\u3068\u8a2d\u5b9a\u3059\u308b\u3068\u3001\u30af\u30ea\u30a2\u3055\u308c\u307e\u3059\u3002\n\n\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5f15\u6570\u4e00\u89a7\u306f '${defaultVar}' \u5909\u6570\u306b\u76f8\u5f53\u3057\u307e\u3059\u3002 \u7279\u6b8a\u306a\u30b9\u30c8\u30ea\u30f3\u30b0 '--' \u306f\u3001\u540d\u524d\u4ed8\u304d\u306e\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u51e6\u7406\u3092\u7d42\u4e86\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u306e\u6b8b\u308a\u306e\u5024\u306f\u5f37\u5236\u7684\u306b\u30c7\u30d5\u30a9\u30eb\u30c8\u5f15\u6570\u3068\u3057\u3066\u89e3\u91c8\u3055\u308c\u307e\u3059\u3002\n\n\u4e00\u822c\u7684\u306b\u3001\u65e2\u5b9a\u306e\u5909\u6570\u306f 1 \u56de\u3060\u3051\u8a2d\u5b9a\u3057\u307e\u3059\u304c\u3001\u8aac\u660e\u306b 'repeatable' \u3068\u6ce8\u8a18\u304c\u3042\u308b\u4e00\u90e8\u306e\u5909\u6570\u306f\u8907\u6570\u56de\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001'-a=x,y,z' \u306f 'a' \u304c 'repeatable' \u306e\u5834\u5408\u3001'-a=x -a=y -a=z' \u3068\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002\u7e70\u308a\u8fd4\u3057\u53ef\u80fd\u306a\u5909\u6570\u306e\u4fbf\u5229\u306a\u7279\u6027\u3068\u3057\u3066\u3001\u7279\u6b8a\u306a\u30b7\u30f3\u30bf\u30c3\u30af\u30b9'-\u5909\u6570+=\u5024,\u5024' \u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3067\u3001\u73fe\u5728\u306e\u5024\u4e00\u89a7\u3092\u7f6e\u304d\u63db\u3048\u305a\u306b\u73fe\u5728\u306e\u5024\u306b\u65b0\u898f\u306e\u5024\u30bb\u30c3\u30c8\u3092\u8ffd\u52a0\u3067\u304d\u307e\u3059\u3002\n\n\u8a2d\u5b9a\u5909\u6570\u306f\u3001\u5165\u529b\u3057\u3084\u3059\u3044\u77ed\u7e2e\u5f62\u306e\u30a8\u30a4\u30ea\u30a2\u30b9\u3092\u6301\u3063\u3066\u3044\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002\u968e\u5c64\u7684\u306a\u30c9\u30c3\u30c8\u306e\u4ed8\u3044\u305f\u5909\u6570\u540d\u306f\u3001'\u8449' \u306e\u540d\u524d\uff08\u56fa\u6709\u306e\u540d\u524d\u306e\u5834\u5408\uff09\u304b\u3089\u6d3e\u751f\u3059\u308b\u30a8\u30a4\u30ea\u30a2\u30b9\u304c\u81ea\u52d5\u7684\u306b\u4ed8\u3051\u3089\u308c\u307e\u3059\u3002\n\n\u8a2d\u5b9a\u5024\u5185\u306b $${token} \u3068\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3055\u308c\u305f\u30b7\u30fc\u30b1\u30f3\u30b9\u304c\u3042\u308b\u5834\u5408\u3001\u30c8\u30fc\u30af\u30f3\u306e\u5024\u306b\u5c55\u958b\u3055\u308c\u307e\u3059\u3002 \u3059\u3079\u3066\u306e Java \u30d7\u30ed\u30d1\u30c6\u30a3\u306f\u30c8\u30fc\u30af\u30f3\u3068\u3057\u3066\u6271\u308f\u308c\u307e\u3059\u304c\u3001\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u3067 '+\u30c8\u30fc\u30af\u30f3=\u5024' \u3092\u4f7f\u7528\u3057\u3066\u30c8\u30fc\u30af\u30f3\u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002\u30c8\u30fc\u30af\u30f3\u306e\u7f6e\u304d\u63db\u3048\u306f\u3001\u30b7\u30f3\u30d7\u30eb\u306a\u30b9\u30c8\u30ea\u30f3\u30b0\u306b\u5236\u9650\u3055\u308c\u307e\u3059\u304c\u3001\u518d\u5e30\u7684\u306b\u5b9a\u7fa9\u53ef\u80fd\u3067\u3059\u3002\n\n\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u3067\u30d5\u30a1\u30a4\u30eb\u540d\u3092\u6307\u5b9a\u3059\u308b\u3068\u304d\u306f\u3001\u7d76\u5bfe\u30d1\u30b9\u3001\u307e\u305f\u306f\u73fe\u5728\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u306e\u76f8\u5bfe\u30d1\u30b9\u3092\u7528\u3044\u3066\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\n'${program} -help list' \u30b7\u30f3\u30bf\u30c3\u30af\u30b9\u3092\u4f7f\u7528\u3057\u3066\u5229\u7528\u53ef\u80fd\u306a\u8a2d\u5b9a\u5909\u6570\u306e\u4e00\u89a7\u3092\u898b\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002

HelpKeywords=\u30ad\u30fc\u30ef\u30fc\u30c9\u306f 'syntax','list','advanced','aliases','details',\u307e\u305f\u306f\u691c\u7d22\u8a9e\u53e5\u3067\u3059
Advanced=\u8a73\u7d30
Repeatable=\u53cd\u5fa9\u53ef\u80fd
Default=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5909\u6570
Alias=\u30a8\u30a4\u30ea\u30a2\u30b9
FullName=\u30d5\u30eb\u30cd\u30fc\u30e0
NoKeywordsMatched=\u4e00\u81f4\u3059\u308b\u30ad\u30fc\u30ef\u30fc\u30c9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
# note: do not localize the string -help, it has syntactic significance
Brief=${program} [options] [defaultVar]\n\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001'${program} -help' \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n

compiler.allow-source-path-overlap=source-path \u30a8\u30f3\u30c8\u30ea\u304c\u5225\u306e source-path \u30a8\u30f3\u30c8\u30ea\u306e\u30b5\u30d6\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3067\u3042\u308b\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001MXML \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u540d\u304c\u660e\u767d\u306b\u306a\u308a\u307e\u3059\u3002
compiler.debug=\u30c7\u30d0\u30c3\u30b0\u306b\u9069\u3057\u305f\u30e0\u30fc\u30d3\u30fc\u3092\u751f\u6210\u3057\u307e\u3059
compiler.define=\u30b0\u30ed\u30fc\u30d0\u30eb AS3 \u6761\u4ef6\u30b3\u30f3\u30d1\u30a4\u30eb\u5b9a\u7fa9\u3092\u5b9a\u7fa9\u3057\u307e\u3059 (-define CONFIG::debugging tru\u3001 \u307e\u305f\u306f flex-config.xml \u5185\u306e\u65e2\u5b58\u306e\u5b9a\u7fa9\u306b\u8ffd\u52a0\u3059\u308b\u5834\u5408\u306e -define+=CONFIG::debugging,true \u306a\u3069)
compiler.defaults-css-url=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30b9\u30bf\u30a4\u30eb\u30b7\u30fc\u30c8\u306e\u5834\u6240\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u8a2d\u5b9a\u3059\u308b\u3068\u3001 framework.swc \u30d5\u30a1\u30a4\u30eb\u306b\u3042\u308b defaults.css \u30b9\u30bf\u30a4\u30eb\u30b7\u30fc\u30c8\u306e\u6697\u9ed9\u7684\u306a\u4f7f\u7528\u304c\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3055\u308c\u307e\u3059\u3002
compiler.fonts.max-cached-fonts=\u30b5\u30fc\u30d0\u30fc\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u4fdd\u5b58\u3059\u308b\u30d5\u30a9\u30f3\u30c8\u306e\u6700\u5927\u6570\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f 20 \u3067\u3059\u3002
compiler.fonts.max-glyphs-per-face=\u5404\u30d5\u30a9\u30f3\u30c8\u306b\u3064\u3044\u3066\u30b5\u30fc\u30d0\u30fc\u306b\u30ad\u30e3\u30c3\u30b7\u30e5\u3067\u304d\u308b\u6587\u5b57\u306e\u30b0\u30ea\u30d5\u30a2\u30a6\u30c8\u30e9\u30a4\u30f3\u306e\u6700\u5927\u6570\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f 1000 \u3067\u3059\u3002
compiler.fonts.flash-type=\u57cb\u3081\u8fbc\u307f\u30d5\u30a9\u30f3\u30c8\u306e FlashType \u3092\u6709\u52b9\u306b\u3057\u3066\u3001\u5c0f\u3055\u3044\u30d5\u30a9\u30f3\u30c8\u3092\u898b\u3084\u3059\u304f\u3059\u308b
compiler.fonts.advanced-anti-aliasing=\u57cb\u3081\u8fbc\u307f\u30d5\u30a9\u30f3\u30c8\u306e\u9ad8\u5ea6\u306a\u30a2\u30f3\u30c1\u30a8\u30a4\u30ea\u30a2\u30b9\u3092\u6709\u52b9\u306b\u3057\u3066\u3001\u5c0f\u3055\u3044\u30d5\u30a9\u30f3\u30c8\u3092\u898b\u3084\u3059\u304f\u3057\u307e\u3059\u3002
compiler.use-resource-bundle-metadata=\u30ea\u30bd\u30fc\u30b9\u30d0\u30f3\u30c9\u30eb\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3092\u8abf\u3079\u307e\u3059\u3002
compiler.warn-duplicate-variable-def=\u5909\u6570\u306e\u5b9a\u7fa9\u304c\u91cd\u8907\u3057\u3066\u3044\u307e\u3059 
include-inheritance-dependencies-only=include-classes \u3067\u6307\u5b9a\u3055\u308c\u305f\u30af\u30e9\u30b9\u306e\u7d99\u627f\u306e\u4f9d\u5b58\u95a2\u4fc2\u306e\u307f\u304c\u542b\u307e\u308c\u307e\u3059 
resource-bundle-list=\u30ea\u30bd\u30fc\u30b9\u30d0\u30f3\u30c9\u30eb\u306e SWC \u30d5\u30a1\u30a4\u30eb\u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306b compc \u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u306b\u5165\u529b\u3059\u308b\u30ea\u30bd\u30fc\u30b9\u30d0\u30f3\u30c9\u30eb\u306e\u30ea\u30b9\u30c8\u3092\u30d5\u30a1\u30a4\u30eb\u306b\u51fa\u529b\u3057\u307e\u3059\u3002 
licenses.license=\u88fd\u54c1\u3068\u30b7\u30ea\u30a2\u30eb\u756a\u53f7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 
remove-unused-rsls=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u4f7f\u7528\u3055\u308c\u306a\u3044 RSL \u3092\u524a\u9664\u3057\u307e\u3059
runtime-shared-library-path=\u30ea\u30f3\u30af\u3059\u308b SWC\u3001\u8aad\u307f\u8fbc\u3080 RSL URL\u3001\u30dd\u30ea\u30b7\u30fc\u30d5\u30a1\u30a4\u30eb URL (\u30aa\u30d7\u30b7\u30e7\u30f3) \u304a\u3088\u3073\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc URL (\u30aa\u30d7\u30b7\u30e7\u30f3) \u3092\u6307\u5b9a\u3057\u307e\u3059 
runtime-shared-library-settings.application-domain=RSL \u306e\u8aad\u307f\u8fbc\u307f\u5148\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30c9\u30e1\u30a4\u30f3\u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3057\u307e\u3059\u3002\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306f\u3001"current"\u3001"default"\u3001"parent" \u307e\u305f\u306f "top-level" \u3067\u3059\u3002
runtime-shared-library-settings.force-rsls=\u5f37\u5236\u7684\u306b RSL \u3092\u8aad\u307f\u8fbc\u3093\u3067\u3001remove-unused-rsls \u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u4f7f\u7528\u306b\u3088\u308b\u524a\u9664\u3092\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3057\u307e\u3059
compute-digest=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e catalog.xml \u306b\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u3092\u66f8\u304d\u8fbc\u307f\u307e\u3059\u3002\u30e9\u30a4\u30d6\u30e9\u30ea\u304c\u30c9\u30e1\u30a4\u30f3\u9593\u306e rsl \u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u308b\u3068\u304d\u306b\u306f\u3001\u3053\u308c\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
static-link-runtime-shared-libraries=\u30c9\u30e1\u30a4\u30f3\u9593\u306e rsl \u306b\u3088\u3063\u3066\u6307\u5b9a\u3055\u308c\u305f\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u9759\u7684\u306b\u30ea\u30f3\u30af\u3057\u307e\u3059\u3002
verify-digests=\u5b9f\u884c\u6642\u306b\u30ed\u30fc\u30c9\u3055\u308c\u305f\u30e9\u30a4\u30d6\u30e9\u30ea\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002
target-player=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30bf\u30fc\u30b2\u30c3\u30c8\u3068\u3059\u308b\u30d7\u30ec\u30fc\u30e4\u30fc\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u3088\u308a\u65b0\u3057\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u5fc5\u8981\u3068\u3059\u308b\u6a5f\u80fd\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30b3\u30f3\u30d1\u30a4\u30eb\u3055\u308c\u307e\u305b\u3093\u3002\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u308b\u6700\u5c0f\u306e\u5024\u306f\u300c9.0.0\u300d\u3067\u3059\u3002
swf-version=\u30b3\u30f3\u30d1\u30a4\u30eb\u6e08 SWF \u30d5\u30a1\u30a4\u30eb\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
use-direct-blit=\u30a2\u30af\u30bb\u30e9\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3067\u304d\u308b\u5834\u5408\u306f\u3001\u753b\u9762\u3078\u306e\u30b0\u30e9\u30d5\u30a3\u30c3\u30af\u306e\u8ee2\u9001\u306b\u30cf\u30fc\u30c9\u30a6\u30a7\u30a2\u30a2\u30af\u30bb\u30e9\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
use-gpu=\u30a2\u30af\u30bb\u30e9\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3067\u304d\u308b\u5834\u5408\u306f\u3001\u30b0\u30e9\u30d5\u30a3\u30c3\u30af\u306e\u63cf\u753b\u6642\u306b GPU \u30b3\u30f3\u30dd\u30b8\u30c3\u30c8\u6a5f\u80fd\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
tools-locale=\u30a8\u30e9\u30fc\u3068\u8b66\u544a\u3092\u901a\u77e5\u3059\u308b\u969b\u306b\u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u3067\u4f7f\u7528\u3059\u308b\u30ed\u30b1\u30fc\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

# asdoc options
doc-classes=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306b\u542b\u3081\u308b\u30af\u30e9\u30b9\u306e\u4e00\u89a7\u3002
doc-namespaces=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306b\u542b\u3081\u308b\u540d\u524d\u7a7a\u9593\u306e\u4e00\u89a7\u3002
doc-sources=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306b\u542b\u3081\u308b\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u89a7\u3002
exclude-classes=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304b\u3089\u9664\u5916\u3059\u308b\u30af\u30e9\u30b9\u306e\u4e00\u89a7\u3002
exclude-dependencies=\u4f9d\u5b58\u95a2\u4fc2\u3092\u9664\u5916\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3059\u308b\u30d6\u30fc\u30eb\u3002
footer=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306b\u8868\u793a\u3059\u308b\u30d5\u30c3\u30bf\u30fc\u6587\u5b57\u5217\u3002
left-frameset-width=\u5de6\u30d5\u30ec\u30fc\u30e0\u306e\u5e45\u3002
main-title=\u30bf\u30a4\u30c8\u30eb\u30d0\u30fc\u306b\u8868\u793a\u3059\u308b\u30bf\u30a4\u30c8\u30eb\u3002
templates-path=\u30ab\u30b9\u30bf\u30e0\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306e\u30d1\u30b9\u3002
window-title=\u30d6\u30e9\u30a6\u30b6\u30fc\u30a6\u30a3\u30f3\u30c9\u30a6\u306b\u8868\u793a\u3059\u308b\u30bf\u30a4\u30c8\u30eb\u3002
lenient=\u9069\u683c\u306a\u5f62\u5f0f\u306e HTML \u30a8\u30e9\u30fc\u3092\u8b66\u544a\u3068\u3057\u3066\u5831\u544a\u3057\u307e\u3059\u3002
packages.package=\u30d1\u30c3\u30b1\u30fc\u30b8\u540d\u306e\u8aac\u660e\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
exclude-sources=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304b\u3089\u9664\u5916\u3059\u308b\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u89a7\u3002
examples-path=\u30b5\u30f3\u30d7\u30eb\u30d5\u30a1\u30a4\u30eb\u3092\u691c\u7d22\u3059\u308b\u30d1\u30b9\u3002
date-in-footer=\u30d5\u30c3\u30bf\u30fc\u306b\u65e5\u4ed8\u3092\u542b\u3081\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
package-description-file=\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u8aac\u660e\u3092\u542b\u3080\u30d5\u30a1\u30a4\u30eb\u3002
