################################################################################
##
##  Licensed to the Apache Software Foundation (ASF) under one or more
##  contributor license agreements.  See the NOTICE file distributed with
##  this work for additional information regarding copyright ownership.
##  The ASF licenses this file to You under the Apache License, Version 2.0
##  (the "License"); you may not use this file except in compliance with
##  the License.  You may obtain a copy of the License at
##
##      http://www.apache.org/licenses/LICENSE-2.0
##
##  Unless required by applicable law or agreed to in writing, software
##  distributed under the License is distributed on an "AS IS" BASIS,
##  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
##  See the License for the specific language governing permissions and
##  limitations under the License.
##
################################################################################

benchmark=Benchmark for outputresultat
compiler.accessible=Opret tilg\u00e6ngelig SWF
compiler.source-path=Liste over stielementer, der danner roden af ActionScript-klassehierarkier
compiler.actionscript-file-encoding=Angiver actionscript-filkodning. Hvis der ikke findes nogen BOM i AS3-kildefilerne, bruger kompileringsprogrammet denne filkodning.
compiler.isolate-styles=Giver det kompilerede program eller modul mulighed for at v\u00e6lge typografier, der kun har indflydelse p\u00e5 sig selv og underordnede
compiler.context-root=Sti til erstatning af {context.root} tokens til tjenestekanalers slutpunkter
compiler.external-library-path=Liste over SWC-filer eller -mapper, der skal kompileres, men udelades i sammenk\u00e6dning
compiler.fonts.languages.language-range=Et interval, der begr\u00e6nser antallet af skriftglyffer, som integreres i SWF
compiler.fonts.managers=Kompileringsprogrammets klasser for skrifttypestyring, i r\u00e6kkef\u00f8lge for politikfortolkning
compiler.fonts.local-fonts-snapshot=Fil, der indeholder systemskrifttypedata, der er fremstillet af flex2.tools.FontSnapshot.
compiler.headless-server=Et flag, der skal angives, n\u00e5r Flex k\u00f8rer p\u00e5 en server uden display
compiler.include-libraries=En liste over biblioteker (SWC'er), der skal medtages helt i SWF'en
compiler.incremental=Aktiverer trinvis kompilering
compiler.keep-all-type-selectors=Deaktiverer fjernelse af ubrugte CSS-typev\u00e6lgere
compiler.keep-generated-actionscript=Gem midlertidige kildefiler, der er oprettet under MXML-kompilering
compiler.keep-generated-signatures=Gem signaturfiler, der er oprettet under AS3-kompilering
compiler.keep-as3-metadata=Bevar de angivne metadata i SWF'en
compiler.library-path=Liste over SWC-filer eller mapper, der indeholder SWC-filer
compiler.locale=Angiver landestandarden til internationalisering
compiler.mobile=angiver, at m\u00e5let p\u00e5 k\u00f8rselstidspunktet er en mobil enhed
compiler.mxml.compatibility-version=Angiver en kompatibilitetsversion. F.eks. -compatibility-version=2.0.1
compiler.namespaces.namespace=Angiver URI, der skal tilknyttes et manifest af komponenter til brug som MXML-elementer
compiler.optimize=Aktiver SWF-optimering efter sammenk\u00e6dning
compiler.preloader=Angiver standardv\u00e6rdien til programmets attribut for forh\u00e5ndsindl\u00e6sning. Hvis den ikke angives, er standardv\u00e6rdien mx.preloaders.SparkDownloadProgressBar n\u00e5r -compatibility-version >= 4.0 og mx.preloaders.DownloadProgressBar n\u00e5r -compatibility-version < 4.0.
compiler.profile=Opret en film, der er velegnet til profilering af ydeevne og hukommelse
compiler.services=Sti til Flex Data Services-konfigurationsfil
compiler.omit-trace-statements=v\u00e6lg, om sporingsudsagn skal udelades
compiler.report-invalid-styles-as-warnings=aktiverer rapportering af ugyldige typografier som advarsler
compiler.report-missing-required-skin-parts-as-warnings=Brug denne mulighed til at generere en advarsel frem for en fejlmeddelslse, n\u00e5r det registreres, at der mangler en n\u00f8dvendig del af et tema (skin).
compiler.show-invalid-css-property-warnings=v\u00e6lg, om advarsler vedr. ugyldige css-egenskaber skal rapporteres
compiler.show-binding-warnings=Angiv, om advarsler fra databindingskode skal vises eller skjules
compiler.show-actionscript-warnings=K\u00f8rer AS3-kompileringsprogrammet i en tilstand, der finder gyldig, men potentielt forkert kode
compiler.show-dependency-warnings=Vis advarsler, n\u00e5r afh\u00e6ngigheder ikke kan fastl\u00e6gges p\u00e5 kompileringstidspunktet
compiler.show-deprecation-warnings=Angiv, om brug af for\u00e6ldede API'er skal udl\u00f8se en advarsel eller ej
compiler.show-shadowed-device-font-warnings=Angiver, om advarsler skal vises, n\u00e5r et integreret skrifttypenavn overskygger et enhedsskrifttypenavn
compiler.show-unused-type-selector-warnings=Angiv, om advarsler, der udl\u00f8ses af ubrugte CSS-typev\u00e6lgere, skal vises eller skjules
compiler.signature-directory=[relative/absolute] mappe, hvor genererede as3-signaturer gemmes
compiler.strict=K\u00f8rer AS3-kompileringsprogrammet i streng fejlkontroltilstand.
compiler.as3=Brug den ActionScript 3-klassebaserede objektmodel for at opn\u00e5 st\u00f8rre ydeevne og bedre fejlrapportering. I den klassebaserede objektmodel bliver de fleste indbyggede funktioner implementeret som faste klassemetoder.
compiler.es=Brug ECMAScript edition 3-prototypebaseret objektmodel til dynamisk tilsides\u00e6ttelse af prototypeegenskaber. I den prototypebaserede objektmodel bliver de indbyggede funktioner implementeret som dynamiske egenskaber for prototypeobjekter.
compiler.theme=Liste over CSS- eller SWC-filer, der skal anvendes som tema
compiler.verbose-stacktraces=Gem callstack-oplysninger i SWF til fejlfinding
compiler.memory-usage-factor=Angiver kompileringsprogrammets hukommelsesforbrugsfaktor, som har standardv\u00e6rdien 1000.
compiler.conservative=Bruger den konservative algoritme til kompilering. Frar\u00e5des til st\u00f8rre programmer. Standardv\u00e6rdien er falsk.
compiler.warn-array-tostring-changes=Formatet Array.toString() er \u00e6ndret.
compiler.warn-assignment-within-conditional=Betinget tildeling.
compiler.warn-bad-array-cast=Array-\u00e6ndringshandlingen kan v\u00e6re ugyldig.
compiler.warn-bad-bool-assignment=Ikke-boolesk v\u00e6rdi bruges, hvor boolesk v\u00e6rdi forventes.
compiler.warn-bad-date-cast=Ugyldig Date-\u00e6ndringshandling.
compiler.warn-bad-es3-type-method=Ukendt metode.
compiler.warn-bad-es3-type-prop=Ukendt egenskab:
compiler.warn-bad-nan-comparison=Ugyldig sammenligning med NaN. Enhver sammenligning, der involverer NaN, evalueres til falsk, fordi NaN != NaN.
compiler.warn-bad-null-assignment=Umulig tildeling af null.
compiler.warn-bad-null-comparison=Ugyldig sammenligning med null.
compiler.warn-bad-undefined-comparison=Ulogisk sammenligning uden definition. Kun variabler uden type (eller variabler af typen *) kan v\u00e6re udefineret.
compiler.warn-boolean-constructor-with-no-args=Boolean() uden argumenter returnerer falsk i ActionScript 3.0. Boolean() returnerede udefineret i ActionScript 2.0.
compiler.warn-changes-in-resolve=__resolve underst\u00f8ttes ikke l\u00e6ngere.
compiler.warn-class-is-sealed=Klassen er forseglet. Medlemmer kan ikke f\u00f8jes dynamisk til den.
compiler.warn-const-not-initialized=Konstanten er ikke initialiseret.
compiler.warn-constructor-returns-value=Funktionen, der bruges i et nyt udtryk, returnerer en v\u00e6rdi. Resultatet returneres af funktionen og er ikke en ny forekomst af denne funktion.
compiler.warn-deprecated-event-handler-error=EventHandler blev ikke tilf\u00f8jet som en lyttefunktion.
compiler.warn-deprecated-function-error=Ikke-underst\u00f8ttet ActionScript 2.0-funktion.
compiler.warn-deprecated-property-error=Ikke-underst\u00f8ttet ActionScript 2.0-egenskab.
compiler.warn-duplicate-argument-names=Der er mere end \u00e9t argument med samme navn.
compiler.warn-for-var-in-changes=ActionScript 3.0 gentages i tilf\u00e6ldig r\u00e6kkef\u00f8lge for et objekts egenskaber i et "for x in target"-udsagn.
compiler.warn-import-hides-class=Import af en pakke med samme navn som den aktuelle klasse skjuler klassens id i dette omr\u00e5de.
compiler.warn-instance-of-changes=Brug af operatoren instanceof.
compiler.warn-internal-error=Intern fejl i kompileringsprogrammet.
compiler.warn-level-not-supported=_level underst\u00f8ttes ikke l\u00e6ngere. Du kan finde flere oplysninger i pakken flash.display.
compiler.warn-missing-namespace-decl=Erkl\u00e6ring af navneomr\u00e5de mangler (variabel er m\u00e5ske ikke defineret som offentlig, privat osv.).
compiler.warn-negative-uint-literal=En negativ v\u00e6rdi bliver til en stor positiv v\u00e6rdi, n\u00e5r den tildeles enhedsdatatypen.
compiler.warn-no-constructor=Konstrukt\u00f8r mangler.
compiler.warn-no-explicit-super-call-in-constructor=Udsagnet super() blev ikke kaldt i konstrukt\u00f8ren.
compiler.warn-no-type-decl=Typeerkl\u00e6ring mangler.
compiler.warn-number-from-string-changes=I ActionScript 3.0 ignoreres mellemrum, og '' returnerer 0. Number() returnerer NaN i ActionScript 2.0, n\u00e5r parameteren er '' eller indeholder mellemrum.
compiler.warn-scoping-change-in-this=\u00c6ndring af omr\u00e5de for dette n\u00f8gleord. Klassemetoder, der udtr\u00e6kkes fra en forekomst af en klasse, vil altid returnere resultatet til denne forekomst. I ActionScript 2.0 bliver dette sl\u00e5et op dynamisk p\u00e5 basis af det sted, hvor metoden kaldes fra.
compiler.warn-slow-text-field-addition=Utilstr\u00e6kkelig brug af += p\u00e5 TextField.
compiler.warn-unlikely-function-value=Parenteser kan mangle.
compiler.warn-xml-class-has-changed=Mulig brug af ActionScript 2.0 XML-klasse.
debug-password=Den adgangskode, der medtages i SWF'er, hvor fejlfinding kan foretages
default-background-color=Standardbaggrundsfarve (kan overskrives af programkode)
default-frame-rate=Billedhastighedens standard, der bruges i SWF.
default-script-limits=Standardgr\u00e6nser for scriptafvikling (kan tilsides\u00e6ttes af rodattributter)
default-size=Programmets standardst\u00f8rrelse (kan tilsides\u00e6ttes af rodattributter i programmet)
dependency-info=Oplysninger om outputklasses afh\u00e6ngighed
dependency.minimize-dependency-set=fjerner en SWC fra afh\u00e6ngighedss\u00e6ttet hvis scripterne der fortolkes i SWC'en, er et unders\u00e6t af de scripts der fortolkes i en anden afh\u00e6ngig SWC.  
dependency.show-external-classes=v\u00e6lg true hvis du vil se de scriptklasser der medf\u00f8rer tv\u00e6r-SWC-afh\u00e6ngigheder (standardindstillingen er false).
dependency.show-swcs=liste over SWC-navne, der kr\u00e6ves ikke en fuld sti. Afh\u00e6ngighedsoplysninger vises kun for de specificerede SWC\u2019er. Dette p\u00e5virker ikke afh\u00e6ngighedsanalysen.
dependency.show-types=v\u00e6lg true hvis du vil se scriptklassernes afh\u00e6ngighedstyper (standardindstillingen er false).
dependency.types=en liste over afh\u00e6ngigheder til at afgr\u00e6nse de klasser der bruges til at afg\u00f8re SWC-afh\u00e6ngigheder. De gyldige v\u00e6rdier er i, s, n og e. Som standard bruges alle afh\u00e6ngighedstyper.
digest.rsl-file=Placering af RSL til beregning af digest
digest.swc-path=Sti til SWC-fil eller -mappe, hvor digest opdateres
directory=Bibliotekets output er en \u00e5ben mappe i stedet for en SWC-fil
dump-config=Skriv en fil, der indeholder alle aktuelle konfigurationsv\u00e6rdier i et format, der kan bruges som en Flex-konfigurationsfil
externs=En liste over symboler, der ikke skal sammenk\u00e6des, n\u00e5r en SWF-fil oprettes
includes=En liste over symboler, der altid skal sammenk\u00e6des, n\u00e5r en SWF-fil oprettes
include-classes=En liste over klasser, der skal medtages i SWC-output
include-file=En liste over navne p\u00e5 filer, der skal medtages i SWC-output
include-lookup-only=Hvis v\u00e6rdien er sand, medtages manifestelementer med lookupOnly=true i SWC-kataloget. Standardv\u00e6rdien er falsk.
include-namespaces=Alle klasser p\u00e5 listen over navneomr\u00e5der medtages i SWC-output
include-resource-bundles=En liste over ressourcebundles, der skal medtages i SWC-output
include-sources=En liste over mapper og kildefiler, der skal medtages i SWC-output
include-stylesheet=En liste over navngivne ressourcer med typografiark, der skal medtages i SWC-output
file-specs=En liste over kildefiler, der skal kompileres, hvor den sidste fil p\u00e5 listen bruges som m\u00e5lprogrammet
frames.frame=En SWF-rammeetiket med en sekvens af klassenavne, der k\u00e6des til rammen.
generate-frame-loader=Sl\u00e5 oprettelse af en IFlexModuleFactory-baseret indl\u00e6sningsklasse til og fra
help=Du kan f\u00e5 oplysninger om kommandolinjesyntaks og beskrivelser af konfigurationsvariabler ved at angive en s\u00f8gestreng eller et af f\u00f8lgende specialn\u00f8gleord:\n   syntax - beskriver den generelle syntaks p\u00e5 kommandolinjen\n   list - viser en liste over alle grundl\u00e6ggende konfigurationsvariabler\n   advanced - viser ogs\u00e5 avancerede konfigurationsvariabler\n   aliases - sorterer ved hj\u00e6lp af kort alias for variablen\n   details - viser altid alle oplysninger om hvert element\nAlle andre hj\u00e6lpen\u00f8gleord viser en komplet eller delvis konfigurationsvariabel, det alias eller den tekst, der s\u00f8ges efter i beskrivelsen af konfigurationsvariablen.\n\n For eksempel viser '-help advanced aliases foo' alle konfigurationsparametre (b\u00e5de grundl\u00e6ggende og avancerede), der indeholder teksten 'foo', sorteret efter aliasnavn.\n\nI beskrivelsen af de enkelte konfigurationsvariabler er de obligatoriske v\u00e6rdier m\u00e6rket med vinkelparenteser, mens de valgfrie v\u00e6rdier er m\u00e6rket med firkantede parenteser. Notationen [...] bruges til at angive, at v\u00e6rdierne er en liste af arbitr\u00e6r l\u00e6ngde.
lazy-init=Aktiver/deaktiver lazy-initialisering af ABC-bytekode
link-report=Opret output med XML-formateret rapport over alle definitioner, der er sammenk\u00e6det med programmet.
load-config=Indl\u00e6s en fil, der indeholder konfigurationsindstillinger
load-externs=En XML-fil, der indeholder symbolerne <def>, <pre> og <ext>, der ikke skal sammenk\u00e6des, n\u00e5r en SWF-fil oprettes
metadata.contributor=En bidragyders navn, der skal gemmes i SWF-metadata
metadata.creator=En opretters navn, der skal gemmes i SWF-metadata
metadata.date=Den oprettelsesdato, der skal gemmes i SWF-metadata
metadata.description=Den standardbeskrivelse, der skal gemmes i SWF-metadata
metadata.language=Det sprog, der skal gemmes i SWF-metadata (f.eks. EN, DA)
metadata.localized-description=En oversat RDF/XMP-beskrivelse, der skal gemmes i SWF-metadata
metadata.localized-title=En oversat RDF/XMP-titel, der skal gemmes i SWF-metadata
metadata.publisher=En udgivers navn, der skal gemmes i SWF-metadata
metadata.title=Den standardtitel, der skal gemmes i SWF-metadata
output=Filnavnet p\u00e5 den SWF-film, der skal oprettes.
raw-metadata=XML-tekst, der skal gemmes i SWF-metadata (tilsides\u00e6tter konfigurationen metadata.*)
runtime-shared-libraries=En liste over URL-adresser p\u00e5 delte biblioteker, der skal indl\u00e6ses p\u00e5 k\u00f8rselstidspunktet, f\u00f8r programmet startes
size-report=Output til en XML-formateret rapport med oplysninger om st\u00f8rrelsen af al koden samt data, der er knyttet til applikationen.
use-network=Sl\u00e5r SWF-flag for adgang til netv\u00e6rksressourcer til og fra
version=Vis buildversionen af programmet
warnings=Sl\u00e5r visning af advarsler til og fra

Syntax=Anvendelse: ${program} [configuration options] [default arguments]\n\nKonfigurationen kan ske via kommandolinjen ved at tilf\u00f8je '-variabel=value,value,value'. (Antallet af obligatoriske v\u00e6rdier afh\u00e6nger af den konkrete variabel). Booleske parametre kan aktiveres med '-variabel=true' og deaktiveres med '-variabel=false', hvor '-variabel' desuden er en forkortelse af '-variabel=true'. Variabler kan ryddes ved at angive '-variabel=' uden nogen v\u00e6rdi efter lighedstegnet.\n\nStandardargumentlisten svarer til at angive variablen '$defaultVar'. Specialstrengen '--' kan bruges til at afslutte behandlingen af navngivne konfigurationsparametre og tvinge eventuelle resterende v\u00e6rdier p\u00e5 kommandolinjen til at blive fortolket som standardargumenter\n\nGenerelt kan en given variabel kun angives \u00e9n gang, men et par variabler kan angives flere gange, hvis der st\u00e5r 'Kan gentages' i deres beskrivelse. Eksempel: '-a=x,y,z' kan ogs\u00e5 angives som '-a=x -a=y -a=z', hvis 'a' kan gentages. En st\u00f8rre fordel ved variabler, der kan gentages, er specialsyntaksen '-variabel+=value,value' der f\u00f8jer de nye v\u00e6rdier til den nuv\u00e6rende v\u00e6rdi i stedet for at erstatte den nuv\u00e6rende v\u00e6rdiliste.\n\nKonfigurationsvariabler kan have korte aliaser, s\u00e5 de er nemme at skrive. Hierarkisk prikkede variabelnavne f\u00e5r automatisk oprettet et alias til deres 'leaf'-navn, hvis det er entydigt.\n\nFilnavne skal angives p\u00e5 kommandolinjen som enten en absolut sti eller relativt i forhold til den aktuelle mappe.\n\nBrug $program -help list' til at f\u00e5 vist en liste over tilg\u00e6ngelige konfigurationsvariabler.

AdvancedSyntax=Anvendelse: ${program} [configuration options] [default arguments]\n\nKonfigurationen kan ske via kommandolinjen ved at tilf\u00f8je '-variabel=value,value,value' eller '-variabel value value'. (Antallet af obligatoriske v\u00e6rdier afh\u00e6nger af den konkrete variabel). Booleske parametre kan aktiveres med '-variabel=true' og deaktiveres med '-variabel=false', hvor '-variabel' desuden er en forkortelse af '-variabel=true'. Variabler kan ryddes ved at angive '-variabel=' uden nogen v\u00e6rdi efter lighedstegnet.\n\nStandardargumentlisten svarer til at angive variablen '$defaultVar'. Specialstrengen '--' kan bruges til at afslutte behandlingen af navngivne konfigurationsparametre og tvinge eventuelle resterende v\u00e6rdier p\u00e5 kommandolinjen til at blive fortolket som standardargumenter\n\nGenerelt kan en given variabel kun angives \u00e9n gang, men et par variabler kan angives flere gange, hvis der st\u00e5r 'Kan gentages' i deres beskrivelse. Eksempel: '-a=x,y,z' kan ogs\u00e5 angives som '-a=x -a=y -a=z', hvis 'a' kan gentages. En st\u00f8rre fordel ved variabler, der kan gentages, er specialsyntaksen '-variabel+=value,value' der f\u00f8jer de nye v\u00e6rdier til den nuv\u00e6rende v\u00e6rdi i stedet for at erstatte den nuv\u00e6rende v\u00e6rdiliste.\n\nKonfigurationsvariabler kan have korte aliaser, der er nemme at skrive. Hierarkisk prikkede variabelnavne f\u00e5r automatisk oprettet et alias til deres 'leaf'-navn, hvis det er entydigt.\n\nHvis en sekvens, der er formateret som $$token, findes i en konfigurationsv\u00e6rdi, udvides den til tokenv\u00e6rdien. Alle Java-egenskaber behandles som tokens, men tokens kan ogs\u00e5 angives ved hj\u00e6lp af '+token=value' p\u00e5 kommandolinjen. Tokenerstatning er begr\u00e6nset til simple strenge, men kan v\u00e6re rekursivt defineret.\n\nFilnavne skal angives p\u00e5 kommandolinjen som enten en absolut sti eller relativt i forhold til den aktuelle mappe.\n\nBrug $program -help list' til at f\u00e5 vist en liste over tilg\u00e6ngelige konfigurationsvariabler.

HelpKeywords=N\u00f8gleordene er 'syntax', 'list', 'advanced', 'aliases', 'details' eller et s\u00f8geudtryk
Advanced=Avanceret
Repeatable=Kan gentages
Default=Standardvariabel
Alias=Alias
FullName=Det fulde navn
NoKeywordsMatched=Ingen n\u00f8gleord blev fundet.
# note: do not localize the string -help, it has syntactic significance
Brief=${program} [options] [defaultVar]\nBrug '${program} -help' til at f\u00e5 flere oplysninger.\n\n

compiler.allow-source-path-overlap=Unders\u00f8ger, om et kildestielement er en undermappe i et andet kildestielement. Det er med til at g\u00f8re pakkenavne p\u00e5 MXML-komponenter utvetydige.
compiler.debug=Opretter en film, der er velegnet til fejlfinding
compiler.define=Definer en global AS3-betinget kompileringsdefinition, f.eks. -define=CONFIG::debugging,true eller -define+=CONFIG::debugging,true (f\u00f8jes til eksisterende definitioner i flex-config.xml) 
compiler.defaults-css-url=Definerer placeringen af standardtypografiarket. Angivelse af denne parameter tilsides\u00e6tter den indirekte brug af typografiarket defaults.css i filen framework.swc.
compiler.fonts.max-cached-fonts=Angiver det maksimale antal skrifttyper, der skal bevares i servercachen. Standardv\u00e6rdien er 20.
compiler.fonts.max-glyphs-per-face=Angiver det maksimale antal tegnglyfkonturlinjer, der skal bevares i servercachen for hver skrifttype. Standardv\u00e6rdien er 1000.
compiler.fonts.flash-type=Giver FlashType af integrerede skrifttyper, som g\u00f8r sm\u00e5 skrifttyper skarpere.
compiler.fonts.advanced-anti-aliasing=Giver avanceret anti-aliasing af integrerede skrifttyper, som g\u00f8r sm\u00e5 skrifttyper skarpere.
compiler.use-resource-bundle-metadata=Fastl\u00e6gger, om ressourcebundles skal medtages i programmet.
compiler.warn-duplicate-variable-def=Dobbelt variabeldefinition 
include-inheritance-dependencies-only=medtag kun nedarvede afh\u00e6ngigheder fra klasser, der er specificeret med include-classes 
resource-bundle-list=Udskriver en liste over ressourcebundles til en fil, der bruges som input til compc-kompileringsprogrammet, n\u00e5r en SWC-fil til ressourcebundle skal oprettes. 
licenses.license=Angiver et produkt og et serienummer. 
remove-unused-rsls=fjern RSL'er, der ikke bruges af applikationen
runtime-shared-library-path=specificerer en SWC, der linkes mod, en RSL-URL, der indl\u00e6ses, og en valgfri politikfil-URL og valgfri URL-adresser i reserve 
runtime-shared-library-settings.application-domain=tilsides\u00e6t programdom\u00e6net, som en RSL er overf\u00f8rt til. V\u00e6rdierne current, default, parent og top-level underst\u00f8ttes.
runtime-shared-library-settings.force-rsls=tving et RSL til at blive indl\u00e6st, og tilsides\u00e6t fjernelsen, der for\u00e5rsages af muligheden remove-unused-rsls 
compute-digest=Skriver digest til catalog.xml i et bibliotek. Det er p\u00e5kr\u00e6vet, n\u00e5r biblioteket bruges i handlingen -runtime-shared-libraries-path.
static-link-runtime-shared-libraries=Statisk sammenk\u00e6dning af de biblioteker, der er angivet i parameteren -runtime-shared-libraries-path.
verify-digests=Kontrollerer, om de korrekte biblioteker indl\u00e6ses p\u00e5 k\u00f8rselstidspunktet.
target-player=Angiver versionen af den afspiller, som er programmets m\u00e5l. Funktioner, der kr\u00e6ver en nyere version, kompileres ikke ind i programmet. Den mindste underst\u00f8ttede v\u00e6rdi er "9.0.0".
swf-version=angiver versionen af den kompilerede SWF-fil.
use-direct-blit=Brug hardware-acceleration til at blokere overf\u00f8rsel af grafik til sk\u00e6rmen, hvor det er muligt.
use-gpu=Brug GPU-kompositionsfunktionerne, n\u00e5r der tegnes grafik, hvis det er muligt.
tools-locale=angiver den landestandard, som anvendes af kompileringsprogrammet ved rapportering af fejl og advarsler.

# asdoc options
doc-classes=liste over klasser der skal medtages i dokumentationen.
doc-namespaces=liste over navneomr\u00e5der der skal medtages i dokumentationen.
doc-sources=liste over kildefiler der skal medtages i dokumentationen.
exclude-classes=liste over klasser der skal udelukkes fra dokumentationen.
exclude-dependencies=boolesk parameter der angiver om afh\u00e6ngigheder skal udelukkes.
footer=fodnotestreng der skal vises i dokumentationen.
left-frameset-width=venstre rammes bredde.
main-title=titel der skal vises i titellinjen.
templates-path=sti til egne skabeloner.
window-title=titel der skal vises i browservinduet.
lenient=Rapporter HTML-fejl med korrekt format som advarsler.
packages.package=indeholder en beskrivelse af et pakkenavn.
exclude-sources=liste over kildefiler der skal udelukkes fra dokumentationen.
examples-path=sti til det sted hvor der skal ledes efter eksempelfilerne.
date-in-footer=angiver om datoen skal inkluderes i fodnoten.
package-description-file=filen indeholder beskrivelse af pakkerne.
