################################################################################
##
##  Licensed to the Apache Software Foundation (ASF) under one or more
##  contributor license agreements.  See the NOTICE file distributed with
##  this work for additional information regarding copyright ownership.
##  The ASF licenses this file to You under the Apache License, Version 2.0
##  (the "License"); you may not use this file except in compliance with
##  the License.  You may obtain a copy of the License at
##
##      http://www.apache.org/licenses/LICENSE-2.0
##
##  Unless required by applicable law or agreed to in writing, software
##  distributed under the License is distributed on an "AS IS" BASIS,
##  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
##  See the License for the specific language governing permissions and
##  limitations under the License.
##
################################################################################

benchmark=benchmarking av utdataprestanda
compiler.accessible=generera en tillg\u00e4nglig SWF
compiler.source-path=lista \u00f6ver s\u00f6kv\u00e4gselement som formar ActionSkript-rotklasshierarkier
compiler.actionscript-file-encoding=specificerar \u00e5tg\u00e4rdsskriptskodning. Om det inte finns n\u00e5gon BOM i AS3-k\u00e4llfilerna anv\u00e4nder kompilatorn denna filkodning.
compiler.isolate-styles=leder till att det kompilerade programmet eller den kompilerade modulen kan st\u00e4lla in stilar som endast p\u00e5verkar programmet/modulen och underordnade
compiler.context-root=s\u00f6kv\u00e4g f\u00f6r att ers\u00e4tta {context.root}-token f\u00f6r servicekanalsslutpunkter
compiler.external-library-path=lista \u00f6ver SWC-filer elle kataloger att kompilera mot, men utel\u00e4mna vid l\u00e4nkning
compiler.fonts.languages.language-range=ett intervall f\u00f6r att begr\u00e4nsa antalet inb\u00e4ddade teckensnitt i SWF
compiler.fonts.managers=Kompilerarteckensnittsklasser, i policy-uppl\u00f6sningsordning
compiler.fonts.local-fonts-snapshot=Fil som inneh\u00e5ller teckensnittsdata fr\u00e5n flex2.tools.FontSnapshot.
compiler.headless-server=en flagga att ange n\u00e4r Flesx k\u00f6rs p\u00e5 en server utan visning
compiler.include-libraries=en lista \u00f6ver bibliotekt (SWC) att inkludera i SWF
compiler.incremental=aktiverar inkrementell kompilering
compiler.keep-all-type-selectors=inaktiverar anv\u00e4ndning av oanv\u00e4nda CSS-typv\u00e4ljare
compiler.keep-generated-actionscript=sparar tempor\u00e4ra k\u00e4llfiler genererade under MXML-kompilering
compiler.keep-generated-signatures=sparar signaturfiler genererade under AS3-kompilering
compiler.keep-as3-metadata=sparar specificerade metadata i SWF
compiler.library-path=lista \u00f6ver SWC-filer eller katalgoer som inneh\u00e5ller SWC-filer
compiler.locale=specificerar nationellla inst\u00e4llningar
compiler.mobile=anger att m\u00e5lk\u00f6rningen \u00e4r en mobil enhet
compiler.mxml.compatibility-version=anger en kompatibilitetsversion, t.ex. -compatibility-version=2.0.1
compiler.namespaces.namespace=Specificera en URI att kopplas till manifesta komponenter f\u00f6r anv\u00e4ndning som MXML-element
compiler.optimize=Aktivera postl\u00e4nks SWF-optimering
compiler.preloader=Anger standardv\u00e4rdet f\u00f6r programmets f\u00f6rhandsladdarattribut. Om det inte anges, \u00e4r standardv\u00e4rdet f\u00f6r f\u00f6rhandsladdaren mx.preloaders.SparkDownloadProgressBar n\u00e4r -compatibility-version >= 4.0 and mx.preloaders.DownloadProgressBar n\u00e4r -compatibility-version < 4.0.
compiler.profile=genererar en film som passar f\u00f6r prestanda- och minnesprofilering
compiler.services=s\u00f6kv\u00e4g till Flex Data Services-konfigurationsfil
compiler.omit-trace-statements=v\u00e4xla mellan visade och dolda sp\u00e5rningsuttryck
compiler.report-invalid-styles-as-warnings=inneb\u00e4r att ogiltiga stilar kan rapporteras som varningar
compiler.report-missing-required-skin-parts-as-warnings=Anv\u00e4nd det h\u00e4r alternativet om du vill ha ett varningsmeddelande ist\u00e4llet f\u00f6r ett felmeddelande n\u00e4r det uppt\u00e4cks att en obligatorisk skaldel saknas.
compiler.show-invalid-css-property-warnings=v\u00e4xla mellan rapportering eller ingen rapportering av ogiltiga css-egenskapsvarningar 
compiler.show-binding-warnings=v\u00e4xla mellan visning eller ingen visning av genererade varningar fr\u00e5n databindning
compiler.show-actionscript-warnings=k\u00f6r AS3-kompilatorn i ett l\u00e4ge som uppt\u00e4cker godk\u00e4nd men potentiellt felaktig kod
compiler.show-dependency-warnings=visar varningar n\u00e4r beroenden inte kan fastst\u00e4llas under kompileringen
compiler.show-deprecation-warnings=anger om anv\u00e4ndning av ersatta API:er ska generera en varning
compiler.show-shadowed-device-font-warnings=v\u00e4xlar mellan visning eller ingen visning av varningar n\u00e4r ett inb\u00e4ddat teckensnittsnamn skuggar ett enhetsteckensnittsnamn
compiler.show-unused-type-selector-warnings=v\u00e4xlar mellan visning eller ingen visning av genererade varningar fr\u00e5n oanv\u00e4nda CSS-typv\u00e4ljare
compiler.signature-directory=en [relative/absolute]-katalog d\u00e4r genererade as3-signaturer sparas
compiler.strict=k\u00f6r AS3-kompilatorn i strikt fels\u00f6kningslg\u00e4e
compiler.as3=anv\u00e4nder ActionScript 3-klassbaserade objektmodeller f\u00f6r b\u00e4ttre prestanda och felrapportering. I klassbaserade objektmodeller implementeras de flesta inbyggda funktioner som fasta klassmetoder.
compiler.es=anv\u00e4nder ECMAScript version 3 prototypbaserade objektmodeller som till\u00e5ter dynamiskt \u00e5sidos\u00e4ttande av prototypegenskaper. I prototypbaserade objektmodeller implementeras de flesta inbyggda funktioner som dynamiska egenskaper hos prototypobjekt.
compiler.theme=listar CSS eller SWC-filer
compiler.verbose-stacktraces=sparar anropsstacksinformation
compiler.memory-usage-factor=specificerar kompilatorns minnesutnyttjande, standardv\u00e4rdet \u00e4r 1000.
compiler.conservative=anv\u00e4nder den konservativa algoritmen f\u00f6r att kompilea. Rekommenderas inte f\u00f6r stora program. standardv\u00e4rdet \u00e4r falskt.
compiler.warn-array-tostring-changes=Array.toString()-format har \u00e4ndrats.
compiler.warn-assignment-within-conditional=Tilldelning i villkorligt
compiler.warn-bad-array-cast=Ogiltig Array-\u00e5tg\u00e4rd.
compiler.warn-bad-bool-assignment=Icke-booleskt v\u00e4rde anv\u00e4nds d\u00e4r Booleskt v\u00e4rde f\u00f6rv\u00e4ntades.
compiler.warn-bad-date-cast=Ogiltig datum\u00e5tg\u00e4rd
compiler.warn-bad-es3-type-method=Ok\u00e4nd metod.
compiler.warn-bad-es3-type-prop=Ok\u00e4nd egenskap:
compiler.warn-bad-nan-comparison=Ologisk j\u00e4mf\u00f6relse med NaN. Eventuell j\u00e4mf\u00f6relse med NaN utv\u00e4rderas till falskt eftersom NaN != NaN.
compiler.warn-bad-null-assignment=Om\u00f6jlig tilldelning till null.
compiler.warn-bad-null-comparison=Ologisk j\u00e4mf\u00f6relse med null.
compiler.warn-bad-undefined-comparison=Ologisk j\u00e4mf\u00f6relse med odefinierad.  Endast oskrivna variabler kan vara odefinierade.
compiler.warn-boolean-constructor-with-no-args=Boolean() utan argument returnerar falskt i ActionScript 3.0.  Boolean() utan argument returnerar odefiinerat i ActionScript 2,0.
compiler.warn-changes-in-resolve=__resolve st\u00f6ds inte l\u00e4ngre.
compiler.warn-class-is-sealed=Klass \u00e4r f\u00f6rseglad. Kan inte ha medlemmar adderade dynamiskt.
compiler.warn-const-not-initialized=Inte initierad.
compiler.warn-constructor-returns-value=Funktion anv\u00e4nd i nya uttryck returnerar ett v\u00e4rde.  Resultatet blir vad funktionen returnerar, snarare \u00e4n nya instanser av funktionen
compiler.warn-deprecated-event-handler-error=EventHandler lades inte till som lyssnare.
compiler.warn-deprecated-function-error=Ok\u00e4nd ActionScript 2.0-funktion.
compiler.warn-deprecated-property-error=Ok\u00e4nd ActionScript 2.0-egenskap.
compiler.warn-duplicate-argument-names=Mer \u00e4n ett argument med samma namn.
compiler.warn-for-var-in-changes=ActionScript 3.0 itirerar \u00f6ver objektets egenskaper i slumpm\u00e4ssig ordning.
compiler.warn-import-hides-class=Import av ett paket med samma namn som aktuell klass d\u00f6ljer klassidentifieraren.
compiler.warn-instance-of-changes=Anv\u00e4nd operatorn instanceof.
compiler.warn-internal-error=Internt fel i kompilatorn.
compiler.warn-level-not-supported=__level st\u00f6de inte l\u00e4ngre. Mer information finns i hj\u00e4lpen till flash.display-paketet.
compiler.warn-missing-namespace-decl=Saknad namnutrymmesdeklaration (t.ex. variabeln definierad som publik, privat etc).
compiler.warn-negative-uint-literal=Negativt v\u00e4rde blir stort positivt v\u00e4rde n\u00e4r det tilldelas till en uint-datatyp.
compiler.warn-no-constructor=Konstruktor saknas.
compiler.warn-no-explicit-super-call-in-constructor=super()-uttrycket anropades inte i konstruktorn.
compiler.warn-no-type-decl=Typdeklaration saknas.
compiler.warn-number-from-string-changes=In ActionScript 3.0, blanksteg ignoreras och '' returnerar 0. Number() returnerar NaN i ActionScript 2.0 \u00a8n\u00e4r parametern \u00e4r'' eller inneh\u00e5ller blanksteg.
compiler.warn-scoping-change-in-this=\u00c4ndra omfattning f\u00f6r deta nyckelord.  Klassmetoder extraherade fr\u00e5n en instans l\u00f6ses alltid tillbaka till instansen.  I ActionScript 2.0 s\u00f6ks detta upp dynamiskt.
compiler.warn-slow-text-field-addition=Ineffektiv anv\u00e4ndning av += on a TextField.
compiler.warn-unlikely-function-value=Eventuellt saknade parenteser.
compiler.warn-xml-class-has-changed=M\u00f6jlig anv\u00e4ndning av ActionScript 2.0 XML-klassen.
debug-password=det l\u00f6senord som ska inkluderas i en fels\u00f6kningsbara SWF:er
default-background-color=standardbakgrundsf\u00e4rg (kan \u00e5sidos\u00e4ttas med programkod)
default-frame-rate=standardramhastighet som anv\u00e4nds i SWF.
default-script-limits=standardskriptexekveringsgr\u00e4nser (kan \u00e5sidos\u00e4ttas av rotattribut)
default-size=standardprogramstorlek (kan \u00e5sidos\u00e4ttas av rotattribut i programmet)
dependency-info=utdataklassberoende information
dependency.minimize-dependency-set=tar bort en SWC fr\u00e5n beroendeupps\u00e4ttningen om skripten som k\u00f6rts i SWC \u00e4r en underupps\u00e4ttning av skripten som k\u00f6rts i en annan beroende SWC.  
dependency.show-external-classes=ange som sant om du vill se skriptklasserna som orsaker SWC-beroenden (standard \u00e4r falskt).
dependency.show-swcs=lista \u00f6ver SWC-namn. Ingen fullst\u00e4ndig s\u00f6kv\u00e4g kr\u00e4vs. Beroendeinformationen visas endast f\u00f6r de SWC:er som inte p\u00e5verkar beroendeanalysen.
dependency.show-types=ange som sant om du vill se skriptklassernas beroendetyper (standard \u00e4r falskt).
dependency.types=en lista \u00f6ver beroendetyper f\u00f6r begr\u00e4nsning av klasserna som anv\u00e4nds f\u00f6r att best\u00e4mma SWC-beroenden. M\u00f6jliga v\u00e4rden \u00e4r: i, s, n och e. Som standard anv\u00e4nds alla beroendetyper.
digest.rsl-file=plats f\u00f6r den RSL som ber\u00e4knar sammanfattningen av
digest.swc-path=s\u00f6kv\u00e4g f\u00f6r den SWC-fil eller katalog d\u00e4r sammanfattningen kommer att uppdateras
directory=ange biblioteket som en \u00f6ppen katalog snarare \u00e4n en SWC-fil
dump-config=skriv en fil som inneh\u00e5ller alla aktuella konfigurationsv\u00e4rden i ett format som passar att anv\u00e4ndas som en flex config-fil
externs=en lista \u00f6ver symboler att utel\u00e4mna fr\u00e5n l\u00e4nkning n\u00e4r du bygger en SWF
includes=en lista \u00f6ver symboler att l\u00e4nka till n\u00e4r du bygger en SWF
include-classes=en lista \u00f6ver klasser som ska ing\u00e5 i den utg\u00e5ende SWC-filen
include-file=en lista \u00f6ver namngivna filer som ska ing\u00e5 i den utg\u00e5ende SWC-filen
include-lookup-only=om sant, inkluderas manifest-poster med lookupOnly=true i SWC-katalogen. Falskt \u00e4r standard.
include-namespaces=alla klasser i de listande namnomr\u00e5derna inkluderas i SWC-utdatafilen
include-resource-bundles=en lista \u00f6ver resurspaket som ska ing\u00e5 i SWC-utdatafilen
include-sources=en lista \u00f6ver kataloger och k\u00e4llfiler som ska ing\u00e5 i SWC-utdatafilen
include-stylesheet=en lista \u00f6ver namngivna formatmallsresurser som ska ing\u00e5 i SWC-utdatafilen
file-specs=en lista \u00f6ver k\u00e4llfiler att kompilera, den sista specificerade filen kommer att anv\u00e4ndas som m\u00e5lprogram
frames.frame=En SWF-rametikett med en f\u00f6ljd av klassnamn som kommer att l\u00e4nkas till ramen.
generate-frame-loader=v\u00e4xlar mellan att generera en IFlexModuleFactory-h\u00e4rledd laddningsklass
help=Ange en s\u00f6kstr\u00e4ng eller n\u00e5got av f\u00f6ljande nyckelord f\u00f6r information om kommandoradssyntax och konfigurationsvariabler:\n\\ syntax \u2013 beskrivning av allm\u00e4n kommandoradssyntax\n\\ list \u2013 visar en lista \u00f6ver allm\u00e4nna konfigurationsvariabler\n\\ advanced \u2013 matchar \u00e4ven avancerade konfigurationsvariabler\n\\ aliases \u2013 sortera med variablernas kortalias.\n\\ details \u2013 visar alltid all information om varje post\nAndra nyckelord som tillhandah\u00e5lls anv\u00e4nds f\u00f6r s\u00f6kning (fullst\u00e4ndiga tr\u00e4ffar eller deltr\u00e4ffar) efter konfigurationsvariabel, alias eller text i beskrivningen av konfigurationsvariablerna.\n\n"-help advanced alias foo" visar alla konfigurationsalterativ (b\u00e5de grundl\u00e4ggande och avancerade) som inneh\u00e5ller "foo". Dessa sorteras utifr\u00e5n aliasnamnet.\n\nI beskrivningen av konfigurationsvariabler anges n\u00f6dv\u00e4ndiga v\u00e4rden med hakparentes medan valfria v\u00e4rden anges med vinkelparentes. Notationen [...] visar att v\u00e4rdena \u00e4r en lista med godtycklig l\u00e4ngd.
lazy-init=Aktivera/inaktivera ABC-bitkodsinitiering
link-report=Utger en XML-formaterad rapport av alla definitioner l\u00e4nkade till programmet.
load-config=laddar en fil som inneh\u00e5ller konfigurationsalternativ
load-externs=en XML-fil som inneh\u00e5ller <def>, <pre>, och <ext> symboler som kan uteslutas fr\u00e5n l\u00e4nkning n\u00e4r man bygger en SWF
metadata.contributor=En deltagares namn att lagra i SWF-metadata
metadata.creator=En skapare namn att lagra i SWF-metadata
metadata.date=Datum att lagra i SWF-metadata
metadata.description=Standardbeskrivning att lagra i SWF-metadata
metadata.language=Spr\u00e5k att lagra i SWF-metadata (t.ex. EN, FR)
metadata.localized-description=En lokaliserad RDF/XMP-besrivning att lagra i SWF-metadata
metadata.localized-title=En lokaliserad RDF/XMP-titel att lagra i SWF-metadata
metadata.publisher=En publicerares namn att lagra i SWF-metadata
metadata.title=Standardtitel att lagra i SWF-metadata
output=filnamnet p\u00e5 SWF-filmen
raw-metadata=XML-text att lagra i SWF-metadata (\u00e5sidos\u00e4tter metadata.*-konfiguration)
runtime-shared-libraries=en lista \u00f6ver delade URL:er f\u00f6r delade k\u00f6rtidsbibliotek som ska laddas innan programmet startar
size-report=Skapar en XML-formaterad rapport med uppgifter om storleken p\u00e5 alla koder och data som \u00e4r l\u00e4nkade till programmet.
use-network=v\u00e4xlar mellan att ange om SWF ska flaggas f\u00f6r \u00e5tkomst till n\u00e4tverksresurser eller inte
version=visar programmets versionsnummer
warnings=v\u00e4xlar visningen av varningar

Syntax=Anv\u00e4ndning: ${program} [konfigurationsalternativ] [standardargument]\n\nKonfigurationsalternativen kan st\u00e4llas in fr\u00e5n kommandoraden i enlighet med "-variabel=v\u00e4rde,v\u00e4rde,v\u00e4rde". Antalet v\u00e4rden varierar fr\u00e5n variabel till variabel. Aktivera Booleska operatorer med "-variabel=true" och inaktivera dem med "-variabel false" ("-variable" \u00e4r en f\u00f6rkortning av "variabel=true"). Rensa variablerna med hj\u00e4lp av inst\u00e4llningen "-variabel=" utan n\u00e5got v\u00e4rde efter likhetstecknet.\n\nStandardargumentlistan motsvarar en inst\u00e4llning av variabeln ${defaultVar}. Specialstr\u00e4ngen -- anv\u00e4nds f\u00f6r att avbryta behandling av namngivna konfigurationsalternativ och f\u00f6r att tvinga programmet att tolka kvarvarande v\u00e4rden p\u00e5 kommandoraden som standardargument.\n\nI de flesta fall kan en variabel endast st\u00e4llas in en g\u00e5ng, men vissa variabler kan st\u00e4llas in flera g\u00e5nger om de anges som upprepningsbara i beskrivningen. -a=x,y,z kan \u00e4ven anges som -a=x -a=y -a=z n\u00e4r a \u00e4r upprepningsbar. F\u00f6rdelen med upprepningsbara variabler \u00e4r att v\u00e4rden l\u00e4ggs till befintliga v\u00e4rden ist\u00e4llet f\u00f6r att ers\u00e4tta den befintliga v\u00e4rdelistan n\u00e4r syntaxen -variabel+=v\u00e4rde,v\u00e4rde anv\u00e4nds.\n\nVissa konfigurationsvariabler har f\u00f6rkortningar som alias, vilka g\u00e5r snabbare att skriva in. Hierarkiska prickade variabelnamn f\u00e5r automatiskt alias som genereras f\u00f6r deras 'leaf'-namn, f\u00f6rutsatt att det \u00e4r unikt.\n\nOm en sekvens formaterad som $${token} hittas i ett konfigurationsv\u00e4rde, expanderas det till tokenv\u00e4rdet. Alla Java-egenskaper behandlas som token, men token kan \u00e4ven anges med +token=v\u00e4rde p\u00e5 kommandoraden.  Tokeners\u00e4ttning \u00e4r begr\u00e4nsat till enkla str\u00e4ngar, men kan definieras rekursivt.\n\nFilnamn som specificerats p\u00e5 kommandoraden m\u00e5ste antingen vara absoluta s\u00f6kv\u00e4gar eller relativa i f\u00f6rh\u00e5llande till den aktuella katalogen.\n\nAnv\u00e4nd '${program} -help list f\u00f6r att lista tillg\u00e4ngliga konfigurationsvariabler.

AdvancedSyntax=Anv\u00e4ndning: ${program} [konfigurationsalternativ] [standardargument]\n\nKonfigurationsalternativen kan st\u00e4llas in fr\u00e5n kommandoraden i enlighet med "-variabel=v\u00e4rde,v\u00e4rde,v\u00e4rde" eller "-variabel, v\u00e4rde, v\u00e4rde (antalet v\u00e4rden varierar fr\u00e5n variabel till variabel). Aktivera Booleska operatorer med "-variabel=true" och inaktivera dem med "-variabel false" ("-variabel" \u00e4r en f\u00f6rkortning av "-variabel=true"). Rensa variablerna med hj\u00e4lp av inst\u00e4llningen "-variabel=" utan n\u00e5got v\u00e4rde efter likhetstecknet.\n\nStandardargumentlistan motsvarar en inst\u00e4llning av variabeln ${defaultVar}. Specialstr\u00e4ngen -- anv\u00e4nds f\u00f6r att avbryta behandling av namngivna konfigurationsalternativ och f\u00f6r att tvinga programmet att tolka kvarvarande v\u00e4rden p\u00e5 kommandoraden som standardargument.\n\nI de flesta fall kan en variabel endast st\u00e4llas in en g\u00e5ng, men vissa variabler kan st\u00e4llas in flera g\u00e5nger om de anges som upprepningsbara i beskrivningen. "A=x,y,z" kan \u00e4ven anges som "-a=x -a=y -a=z" n\u00e4r a \u00e4r upprepningsbar. F\u00f6rdelen med upprepningsbara variabler \u00e4r att v\u00e4rden l\u00e4ggs till befintliga v\u00e4rden ist\u00e4llet f\u00f6r att ers\u00e4tta den befintliga v\u00e4rdelistan n\u00e4r syntaxen -variabel+=v\u00e4rde,v\u00e4rde anv\u00e4nds.\n\nVissa konfigurationsvariabler har f\u00f6rkortningar som alias, vilka g\u00e5r snabbare att skriva in. Hierarkiska prickade variabelnamn f\u00e5r automatiskt alias som genereras f\u00f6r deras "leaf"-namn, f\u00f6rutsatt att det \u00e4r unikt.\n\nOm en sekvens formaterad som $${token} hittas i ett konfigurationsv\u00e4rde, expanderas det till tokenv\u00e4rdet. Alla Java-egenskaper behandlas som token, men token kan \u00e4ven anges med "+token=v\u00e4rde" p\u00e5 kommandoraden. Tokeners\u00e4ttning \u00e4r begr\u00e4nsat till enkla str\u00e4ngar, men kan definieras rekursivt.\n\nFilnamn som specificerats p\u00e5 kommandoraden m\u00e5ste antingen vara absoluta s\u00f6kv\u00e4gar eller relativa i f\u00f6rh\u00e5llande till den aktuella katalogen.\n\nAnv\u00e4nd "${program} -help list" f\u00f6r att lista tillg\u00e4ngliga konfigurationsvariabler.

HelpKeywords=nyckelorden \u00e4r 'syntax', 'lista', 'avancerad', 'alias', 'detaljer', eller en s\u00f6kterm
Advanced=avancerat
Repeatable=upprepningsbar
Default=standardvariabel
Alias=alias
FullName=fullst\u00e4ndigt namn
NoKeywordsMatched=inga matchande nyckelord.
# note: do not localize the string -help, it has syntactic significance
Brief=${program} [alternativ] [defaultVar]\nAnv\u00e4nd '${program} -help' f\u00f6r mer information.\n\n

compiler.allow-source-path-overlap=kontrollerar om k\u00e4lls\u00f6kv\u00e4gsposten \u00e4r en underkatalog i k\u00e4lls\u00f6kv\u00e4gsposten. Hj\u00e4lper att g\u00f6ra paketnamn av MXML-komponenter entydiga.
compiler.debug=genererar en film som passar f\u00f6r fels\u00f6kning
compiler.define=definiera en global villkorlig AS3-kompileringsdefinition, t.ex. -define=CONFIG::debugging,true eller -define+=CONFIG::debugging,true (f\u00f6r att bifoga till befintliga definitioner i flex-config.xml) 
compiler.defaults-css-url=definierar standardformatmallens plats. Detta alternativ \u00e5sidos\u00e4tter det implicita anv\u00e4ndandet av formatmallen defaults.css i filen framework.swc.
compiler.fonts.max-cached-fonts=anger maximalt antal teckensnitt i servercacheminnet.  Standardv\u00e4rdet \u00e4r 20.
compiler.fonts.max-glyphs-per-face=anger maximalt antal tecken att h\u00e5lla cacheminnet f\u00f6r respektive teckensnitt. Standardv\u00e4rdet \u00e4r 1000.
compiler.fonts.flash-type=aktiverar FlashType f\u00f6r inb\u00e4ddade teckensnitt, vilket ger st\u00f6rre tydlighet f\u00f6r sm\u00e5 teckensnitt.
compiler.fonts.advanced-anti-aliasing=aktiverar avancerad kantutj\u00e4mning f\u00f6r inb\u00e4ddade teckensnitt, vilket ger st\u00f6rre tydlighet f\u00f6r sm\u00e5 teckensnitt.
compiler.use-resource-bundle-metadata=fastst\u00e4ller om resurspaket ska inkluderas i programmet
compiler.warn-duplicate-variable-def=Duplicerad variabeldefinition 
include-inheritance-dependencies-only=ta endast med \u00e4rvda beroenden f\u00f6r klasser som har specificerats med include-klasser 
resource-bundle-list=skriver ut en lista med resurspaket till en fil f\u00f6r inmatning i compc-kompilatorn f\u00f6r att skapa en resurspakets-SWC-fil. 
licenses.license=specificerar en produkt och ett serienummer. 
remove-unused-rsls=ta bort RSL:er som inte anv\u00e4nds av programmet
runtime-shared-library-path=specificera en SWC att l\u00e4nka till, en RSL-URL att l\u00e4sa in, med en valfri URL till policyfil och eventuella failover-URL:er 
runtime-shared-library-settings.application-domain=\u00e5sidos\u00e4tt den programdom\u00e4n som en RSL blir inl\u00e4st till. V\u00e4rden som st\u00f6ds \u00e4r current, default, parent och top-level.
runtime-shared-library-settings.force-rsls=tvinga en RSL att l\u00e4sas in, \u00e4ven om alternativet remove-unused-rsls har anv\u00e4nts f\u00f6r att ta bort den
compute-digest=skriver en sammanfattning till ett biblioteks catalog.xml. Detta \u00e4r n\u00f6dv\u00e4ndigt n\u00e4r biblioteket kommer att anv\u00e4ndas i alternativet -runtime-shared-libraries-path.
static-link-runtime-shared-libraries=l\u00e4nkar statiskt de bibliotek som har angetts i s\u00f6kv\u00e4gsalternativet f\u00f6r delade realtidsbibliotek.
verify-digests=verifierar att de bibliotek som laddas i k\u00f6rtid \u00e4r de korrekta.
target-player=specificerar versionen f\u00f6r den spelare som programmet \u00e4r inriktat p\u00e5. De funktioner som kr\u00e4ver en senare version kompileras inte i programmet. Det l\u00e4gsta supportv\u00e4rdet \u00e4r "9.0.0".
swf-version=anger versionen av den kompilerade SWF-filen.
use-direct-blit=Anv\u00e4nd maskinvaruacceleration f\u00f6r att snabbt \u00f6verf\u00f6ra grafik till sk\u00e4rmen, om s\u00e5dan acceleration \u00e4r tillg\u00e4nglig.
use-gpu=Anv\u00e4nd funktioner f\u00f6r GPU-komposition n\u00e4r du skapar grafik, om s\u00e5dan acceleration \u00e4r tillg\u00e4nglig.
tools-locale=anger de nationella inst\u00e4llningarna som ska anv\u00e4ndas vid fel- och varningsmeddelanden.

# asdoc options
doc-classes=lista \u00f6ver klasser som ska finnas med i dokumentationen.
doc-namespaces=lista \u00f6ver namnutrymmen som ska finnas med i dokumentationen.
doc-sources=lista \u00f6ver k\u00e4llfiler som ska finnas med i dokumentationen.
exclude-classes=lista \u00f6ver klasser som inte ska finnas med i dokumentationen.
exclude-dependencies=booleskt v\u00e4rde som anger huruvida beroenden ska undantas.
footer=sidfotsstr\u00e4ng som ska visas i dokumentationen.
left-frameset-width=bredden p\u00e5 v\u00e4nster ram
main-title=namn som visas i namnlisten.
templates-path=s\u00f6kv\u00e4g f\u00f6r anpassade mallar.
window-title=namnet som visas i webbl\u00e4sarf\u00f6nstret.
lenient=Korrekt formaterade HTML-fel visas som varningar.
packages.package=anger en beskrivning p\u00e5 ett paketnamn.
exclude-sources=lista \u00f6ver k\u00e4llfiler som inte ska finnas med dokumentationen.
examples-path=s\u00f6kv\u00e4g f\u00f6r exempelfilerna
date-in-footer=anger huruvida datumet ska finnas med p\u00e5 sidfoten.
package-description-file=fil som inneh\u00e5ller beskrivning av paket.
