################################################################################
##
##  Licensed to the Apache Software Foundation (ASF) under one or more
##  contributor license agreements.  See the NOTICE file distributed with
##  this work for additional information regarding copyright ownership.
##  The ASF licenses this file to You under the Apache License, Version 2.0
##  (the "License"); you may not use this file except in compliance with
##  the License.  You may obtain a copy of the License at
##
##      http://www.apache.org/licenses/LICENSE-2.0
##
##  Unless required by applicable law or agreed to in writing, software
##  distributed under the License is distributed on an "AS IS" BASIS,
##  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
##  See the License for the specific language governing permissions and
##  limitations under the License.
##
################################################################################

benchmark=Benchmark for utdataytelse
compiler.accessible=generer en tilgjengelig SWF
compiler.source-path=liste over baneelementer som danner roten av ActionScript-klassehierarkier
compiler.actionscript-file-encoding=angir filkoding for actionscript. Hvis det ikke finnes en BOM i AS3-kildefilene, bruker kompilatoren denne filkodingen.
compiler.isolate-styles=gj\u00f8r den kompilerte applikasjonen eller modulen i stand til \u00e5 angi stiler som kun p\u00e5virker den selv og dens underordnede.
compiler.context-root=bane som skal erstatte {context.root} spesialtegn for endepunkt for tjenestekanal
compiler.external-library-path=Liste over SWC-filer eller kataloger som det skal kompileres mot, men som skal utelates fra lenking
compiler.fonts.languages.language-range=et omr\u00e5de for \u00e5 begrense antall skriftsymboler som innebygges i SWFen
compiler.fonts.managers=Behandlingsklasser for kompilatorskrift, i policyl\u00f8sningsrekkef\u00f8lge
compiler.fonts.local-fonts-snapshot=Fil som inneholder systemskriftdata som produseres av flex2.tools.FontSnapshot.
compiler.headless-server=et flagg som angis n\u00e5r Flex kj\u00f8rer p\u00e5 en server som ikke har skjerm
compiler.include-libraries=en liste over biblioteker (SWCer) som skal inkluderes fullstendig i SWFen
compiler.incremental=aktiverer trinnvis kompilering
compiler.keep-all-type-selectors=deaktiverer utrensking av ubrukte CSS-typevelgere
compiler.keep-generated-actionscript=lagre midlertidige kildefiler som er generert under MXML-kompilering
compiler.keep-generated-signatures=lagre signaturfiler som er generert under AS3-kompilering
compiler.keep-as3-metadata=behold angitte metadata i SWF
compiler.library-path=liste over SWC-filer eller kataloger som inneholder SWC-filer
compiler.locale=angir de lokale innstillingene for internasjonalisering
compiler.mobile=angir at m\u00e5l for kj\u00f8retid er en mobil enhet
compiler.mxml.compatibility-version=angir en kompatibilitetsversjon, f.eks. -compatibility-version=2.0.1
compiler.namespaces.namespace=Angi en URI som skal knyttes til et manifest av komponenter som skal brukes som MXML-elementer
compiler.optimize=Aktiver SWF-optimalisering etter lenking
compiler.preloader=Angir standardverdien for programmets forh\u00e5ndslasterattributt. Dersom dette ikke er angitt, er standardverdien for forh\u00e5ndslasting mx.preloaders.SparkDownloadProgressBar n\u00e5r kompatibilitetsversjonen >= 4.0, og mx.preloaders.DownloadProgressBar n\u00e5r kompatibilitetsversjonen < 4.0.
compiler.profile=genererer en film som egner seg til profilering av ytelse og minne
compiler.services=bane til konfigurasjonsfil for Flex Data Services
compiler.omit-trace-statements=aktiver/deaktiver utelatelse av sporingssegmenter
compiler.report-invalid-styles-as-warnings=aktiverer rapportering av ugyldige stiler som advarsler
compiler.report-missing-required-skin-parts-as-warnings=Du kan bruke dette alternativet til \u00e5 generere en advarsel i stedet for en feil n\u00e5r en manglende, p\u00e5krevd skalldel oppdages
compiler.show-invalid-css-property-warnings=aktiver/deaktiver rapportering av varsler om ugyldig css-egenskap
compiler.show-binding-warnings=aktiver/deaktiver visning av advarsler som er generert fra databindingskode
compiler.show-actionscript-warnings=kj\u00f8rer AS3-kompilatoren i en modus som oppdager lovlig, men potensielt feil kode
compiler.show-dependency-warnings=vis advarsler n\u00e5r avhengigheter ikke kan fastsettes under kompilering
compiler.show-deprecation-warnings=aktiver/deaktiver bruken av advarsler for avskrevne APIer
compiler.show-shadowed-device-font-warnings=aktiver/deaktiver bruken av advarsler n\u00e5r innebygd skriftnavn er en skygge av et enhetsskriftnavn
compiler.show-unused-type-selector-warnings=aktiver/deaktiver om advarsler skal vises for ubrukte CSS-typevelgere
compiler.signature-directory=[relativ/absolutt] katalog der genererte as3-signaturer lagres
compiler.strict=kj\u00f8rer AS3-kompilatoren i streng feilsjekkingsmodus.
compiler.as3=Bruk ActionScript 3-klassebaserte objektmodellen for h\u00f8yere ytelse og bedre feilrapportering. I den klassebaserte objektmodellen er de fleste innebygde funksjonene implementert som faste klassemetoder.
compiler.es=Bruke ECMAScript edition 3-prototypebasert objektmodell for \u00e5 tillate dynamisk overstyring av egenskaper for prototype. I den prototypebaserte objektmodellen er de fleste innebygde funksjonene implementert som dynamiske egenskaper for prototypeobjekter.
compiler.theme=liste over CSS- eller SWC-filer som skal brukes som et tema
compiler.verbose-stacktraces=lagre kallstakkinformasjon i SWF for feils\u00f8king
compiler.memory-usage-factor=angir minnebrukfaktoren for kompilatoren, standard er 1000.
compiler.conservative=Bruker den konservative algoritmen for \u00e5 kompilere. Anbefales ikke for st\u00f8rre programmer. Standard er false.
compiler.warn-array-tostring-changes=Array.toString()-formatet er endret.
compiler.warn-assignment-within-conditional=Tilordning innen betinget.
compiler.warn-bad-array-cast=Muligens ugyldig Array-plasseringsoperasjon
compiler.warn-bad-bool-assignment=Ikke-boolsk verdi ble brukt n\u00e5r det ble forventet en boolsk verdi.
compiler.warn-bad-date-cast=Ugyldig Date-plasseringsoperasjon
compiler.warn-bad-es3-type-method=Ukjent metode.
compiler.warn-bad-es3-type-prop=Ukjent egenskap.
compiler.warn-bad-nan-comparison=Ugyldig sammenligning med NaN. Alle sammenligningsoperasjoner som inneholder NaN, evalueres til false fordi NaN != NaN.
compiler.warn-bad-null-assignment=Umulig tilordning til null.
compiler.warn-bad-null-comparison=Ulogisk sammenligning med null.
compiler.warn-bad-undefined-comparison=Ulogisk sammenligning med udefinert. Bare ikke-typeangitte variabler (eller variabler av typen *) kan v\u00e6re udefinert.
compiler.warn-boolean-constructor-with-no-args=Boolean() uten argumenter returnerer usann i ActionScript 3.0. Boolean() returnerte udefinert i ActionScript 2.0.
compiler.warn-changes-in-resolve=__resolve st\u00f8ttes ikke lenger.
compiler.warn-class-is-sealed=Klassen er forseglet. Medlemmer kan ikke legges til dynamisk.
compiler.warn-const-not-initialized=Konstant er ikke initialisert.
compiler.warn-constructor-returns-value=Funksjon brukt i nye uttrykk, returnerer en verdi. Resultatet vil v\u00e6re det som funksjonen returnerer, i stedet for en ny forekomst av funksjonen.
compiler.warn-deprecated-event-handler-error=EventHandler ble ikke lagt til som et lytteobjekt.
compiler.warn-deprecated-function-error=ActionScript 2.0-funksjon som ikke st\u00f8ttes.
compiler.warn-deprecated-property-error=ActionScript 2.0-egenskap som ikke st\u00f8ttes.
compiler.warn-duplicate-argument-names=Mer enn ett argument med samme navn.
compiler.warn-for-var-in-changes=ActionScript 3.0 gjentas over egenskapene til et objekt innen en "for x in m\u00e5l"-setning i tilfeldig rekkef\u00f8lge.
compiler.warn-import-hides-class=Import av en pakke med samme navn som gjeldende klasse, vil skjule klasseidentifikatoren i dette omr\u00e5det.
compiler.warn-instance-of-changes=Bruk av instanceof-operatoren.
compiler.warn-internal-error=Intern feil i kompilatoren.
compiler.warn-level-not-supported=_level st\u00f8ttes ikke lenger. Se flash.display-pakken for ytterligere informasjon.
compiler.warn-missing-namespace-decl=Mangler deklarasjon for navneomr\u00e5det (for eksempel er ikke variabelen definert til \u00e5 v\u00e6re public, private osv.).
compiler.warn-negative-uint-literal=Negative verdi blir en stor positive verdi n\u00e5r tilordnet til en uint-datatype.
compiler.warn-no-constructor=Mangler konstrukt\u00f8r.
compiler.warn-no-explicit-super-call-in-constructor=super()-uttrykket ble ikke kalt i instrukt\u00f8ren.
compiler.warn-no-type-decl=Mangler typedeklarasjon.
compiler.warn-number-from-string-changes=I ActionScript 3.0 ignoreres mellomromstegn og '' returnerer 0. Number() returnerer NaN i ActionScript 2.0 n\u00e5r parameteren er '' eller inneholder mellomromstegn.
compiler.warn-scoping-change-in-this=Endring av omfang for dette n\u00f8kkelordet. Klassemetodene som er trukket ut fra en forekomst av en klasse, vil alltid l\u00f8se dette tilbake til forekomsten. I ActionScript 2.0 sl\u00e5s dette opp dynamisk basert p\u00e5 hvor metoden ble aktivert fra.
compiler.warn-slow-text-field-addition=Ineffektiv bruk av += for et TextField.
compiler.warn-unlikely-function-value=Mulig manglende parenteser.
compiler.warn-xml-class-has-changed=Mulig bruk av ActionScript 2.0-XML-klassen.
debug-password=Passordet som skal inkluderes i SWFene som kan feils\u00f8kes
default-background-color=Standard bakgrunnsfarge (kan overstyres av programkoden)
default-frame-rate=Standard bildefrekvens som skal brukes i SWFen.
default-script-limits=Standardgrenser for skriptkj\u00f8ring (kan overstyres av rotattributter)
default-size=Standard programst\u00f8rrelse (kan overstyres av rotattributter i programmet)
dependency-info=Informasjon om avhengighet for utdataklasse
dependency.minimize-dependency-set=fjerner en SWC fra avhengigheten som er angitt, hvis skript som er l\u00f8st i SWC-filen er et undersett av skript som er l\u00f8st i en annen, avhengig SWC.  
dependency.show-external-classes=sett til sant for \u00e5 vise skriptklasser som for\u00e5rsaker avhengigheter mellom SWC-filer (standard er usant).
dependency.show-swcs=liste over SWC-navn, fullstendig bane er ikke p\u00e5krevd. Informasjon om avhengighet vises kun for de bestemte SWC-filene, og p\u00e5virker ikke avhengighetsanalysen.
dependency.show-types=sett til sant for \u00e5 vise avhengighetstyper av skriptklasser (standard er usant).
dependency.types=en liste over avhengighetstyper som brukes til \u00e5 begrense klassene som brukes til \u00e5 finne SWC-avhengigheter. Mulige verdier er i, s, n og e. Standard er \u00e5 bruke alle avhengighetstyper.
digest.rsl-file=Plassering for RSL for \u00e5 beregne sammendraget for
digest.swc-path=bane for SWX-filen eller katalogen der sammendraget blir oppdatert
directory=legg ut biblioteket som en \u00e5pen katalog i stedet for en SWC-fil
dump-config=skriv en fil som inneholder alle gjeldende angitte konfigurasjonsverdier med et format som passer til bruk som en config-fil for flex
externs=En liste over symboler som skal utelates fra lenking under bygging av en SWF
includes=En liste over symboler som alltid skal lenkes inn under bygging av en SWF
include-classes=En liste over klasser som skal inkluderes i utdata-SWCen
include-file=En liste over navngitte filer som skal inkluderes i utdata-SWCen
include-lookup-only=hvis true, inkluderes manifestoppf\u00f8ringer med lookupOnly=true i SWC-katalogen. Standard er false.
include-namespaces=Alle klassene i de viste navneomr\u00e5dene er inkludert i utdata-SWCen
include-resource-bundles=En liste med ressursbunter som skal inkluderes i utdata-SWCen
include-sources=En liste over kataloger og kildefiler som skal inkluderes i utdata-SWCen
include-stylesheet=En liste over navngitte stilarkressurser som skal inkluderes i utdata-SWCen
file-specs=En liste over kildefiler som skal kompileres. Den siste filen som angis brukes som m\u00e5lprogram.
frames.frame=En SWF-rammeetikett med en sekvens av klassenavn som vil bli koblet til rammen.
generate-frame-loader=Aktiver/deaktiver generering av en IFlexModuleFactory-levert innlastingsklasse
help=Hvis du vil ha informasjon om syntaks for kommandolinjen og beskrivelse av konfigurasjonsvariabler, angir du en s\u00f8kestreng eller ett av f\u00f8lgende spesialn\u00f8kkelord:\n   syntax - beskriv den generelle syntaksen for kommandolinjen\n   list - vis en liste over alle grunnleggende konfigurasjonsvariabler\n   advanced - sammenlign ogs\u00e5 avanserte konfigurasjonsvariabler\n   aliases  - sorter ved hjelp av det korte aliaset for variabelen\n   details  - vis alltid alle detaljene for hvert element\nAndre hjelpen\u00f8kkelord som angis, brukes til sammenligning med en fullstendig eller delvis konfigurasjonsvariabel, et alias eller en tekst for \u00e5 s\u00f8ke i beskrivelsen av konfigurasjonsvariabelen.\n\n\u00ab-help advanced aliases foo\u00bb viser for eksempel alle konfigurasjonsalternativer (b\u00e5de grunnleggende og avanserte) som inneholder teksten \u00abfoo\u00bb, sortert etter aliasnavn.\n\nI beskrivelsen av enkelte konfigurasjonsvariabler, er obligatoriske verdier merket med vinkelparenteser, og valgfrie verdier er merket med klammeparenteser. Notasjonen [...] brukes for \u00e5 indikere at verdiene er en liste med vilk\u00e5rlig lengde.
lazy-init=Aktiver/deaktiver forsinket initialisering av ABC-bytekode
link-report=Generer en XML-formatert rapport for alle definisjoner koblet til programmet.
load-config=Last inn en fil som inneholder konfigurasjonalternativer
load-externs=En XML-fil som inneholder symbolene <def>, <pre> og <ext> som skal utelates fra lenkingen under bygging av en SWF
metadata.contributor=Navnet p\u00e5 bidragsyteren som skal lagres i SWF-metadataene
metadata.creator=Navnet p\u00e5 opphavspersonen som skal lagres i SWF-metadataene
metadata.date=Opprettelsesdatoen som skal lagres i SWF-metadataene
metadata.description=Standardbeskrivelsen som skal lagres i SWF-metadataene
metadata.language=Spr\u00e5ket som skal lagres i SWF-metadataene (dvs. EN, NO)
metadata.localized-description=En lokalisert RDF/XMP-beskrivelse som skal lagres i SWF-metadataene
metadata.localized-title=En lokalisert RDF/XMP-tittel som skal lagres i SWF-metadataene
metadata.publisher=Navnet p\u00e5 utgiveren som skal lagres i SWF-metadataene
metadata.title=Standardtittelen som skal lagres i SWF-metadataene
output=Filnavnet p\u00e5 SWF-filen som skal opprettes.
raw-metadata=XML-tekst som skal lagres i SWF-metadataene (overstyrer metadata.*-konfigurasjon)
runtime-shared-libraries=En liste over URL-adresser for delt bibliotek under kj\u00f8retid som skal lastes inn f\u00f8r programmet starter
size-report=Produserer en rapport i XML-format som angir st\u00f8rrelsen p\u00e5 all kode og alle data som er koblet til programmet.
use-network=aktivere/deaktivere om SWF skal flagges for tilgang til nettverksressurser
version=vis build-versjonen av programmet
warnings=aktiver/deaktiver visning av advarsler

Syntax=Bruk: ${program} [configuration options] [default arguments]\n\nKonfigurasjonsalternativer kan angis p\u00e5 kommandolinjen som \u00ab-variable=value,value,value\u00bb. (Antall verdier som kreves, avhenger av variabelen.) Boolske alternativer kan aktiveres med  \u00ab-variable=true\u00bb og deaktiveres med \u00ab-variable=false\u00bb, der \u00ab-variable\u00bb er en forkortelse for \u00ab-variable=true\u00bb. Variabler kan t\u00f8mmes ved \u00e5 angi \u00ab-variable=\u00bb uten en verdi etter likhetstegnet.\n\nStandardargumentlisten tilsvarer \u00e5 angi \u00ab${defaultVar}\u00bb-variabelen. Spesialstrengen \u00ab--\u00bb kan brukes til \u00e5 avslutte behandling av navngitte konfigurasjonsalternativer, og tvinge gjenv\u00e6rende verdier p\u00e5 kommandolinjen til \u00e5 tolkes som standardargumenter.\n\nGenerelt kan en bestemt variabel kun angis \u00e9n gang, men enkelte variabler kan angis flere ganger hvis det er angitt i beskrivelsen at de kan gjentas. Dette vil si at \u00ab-a=x,y,z\u00bb ogs\u00e5 kan angis som \u00ab-a=x -a=y -a=z\u00bb hvis a kan gjentas. Et nyttigere trekk ved variabler som kan gjentas, er at ved \u00e5 bruke den spesielle syntaksen \u00ab-variable+=value,value\u00bb, legges de nye verdiene som angis, til gjeldende verdi i stedet for \u00e5 erstatte gjeldende verdiliste.\n\nKonfigurasjonsvariabler har noen ganger forkortede aliaser som gj\u00f8r dem lettere \u00e5 skrive. Det blir automatisk generert et alias for bladnavnet for hierarkiske stiplede variabelnavn, hvis det er entydig.\n\nFilnavn som er angitt p\u00e5 kommandolinjen, m\u00e5 v\u00e6re en absolutt bane eller relativ til gjeldende katalog.\n\nBruk \u00ab${program}\u00bb -help list for \u00e5 vise tilgjengelige konfigurasjonsvariabler.

AdvancedSyntax=Bruk: ${program} [configuration options] [default arguments]\n\nKonfigurasjonsalternativer kan angis p\u00e5 kommandolinjen som \u00ab-variable=value,value,value\u00bb eller \u00ab-variable value value\u00bb. (Antall verdier som kreves, avhenger av variabelen.) Boolske alternativer kan aktiveres med  \u00ab-variable=true\u00bb og deaktiveres med -\u00abvariable=false\u00bb, der \u00ab-variable\u00bb er en forkortelse for \u00ab-variable=true\u00bb.  Variabler kan t\u00f8mmes ved \u00e5 angi \u00ab-variable=\u00bb uten en verdi etter likhetstegnet.\n\nStandardargumentlisten tilsvarer \u00e5 angi \u00ab${defaultVar}\u00bb-variabelen. Spesialstrengen \u00ab--\u00bb kan brukes til \u00e5 avslutte behandling av navngitte konfigurasjonsalternativer, og tvinge gjenv\u00e6rende verdier p\u00e5 kommandolinjen til \u00e5 tolkes som standardargumenter.\n\nGenerelt kan en bestemt variabel kun angis \u00e9n gang, men enkelte variabler kan angis flere ganger hvis det er angitt i beskrivelsen at de kan gjentas. Dette vil si at \u00ab-a=x,y,z\u00bb ogs\u00e5 kan angis som \u00ab-a=x -a=y -a=z\u00bb hvis a kan gjentas. Et nyttigere trekk ved variabler som kan gjentas, er at ved \u00e5 bruke den spesielle syntaksen \u00ab-variable+=value,value\u00bb, legges de nye verdiene som angis, til gjeldende verdi i stedet for \u00e5 erstatte gjeldende verdiliste.\n\nKonfigurasjonsvariabler har noen ganger forkortede aliaser for at de skal v\u00e6re lettere \u00e5 skrive. Det blir automatisk generert et alias for bladnavnet for hierarkiske stiplede variabelnavn, hvis det er entydig.\n\nHvis en sekvens som er formatert som $$token, blir funnet i en konfigurasjonsverdi, blir den utvidet til verdien av spesialtegnet. Alle Java-egenskaper behandles som spesialtegn, men spesialtegn kan ogs\u00e5 angis ved \u00e5 bruke \u00ab+token=value\u00bb p\u00e5 kommandolinjen. Spesialtegnerstatning er begrenset til enkle strenger, men kan v\u00e6re definert rekursivt.\n\nFilnavn som er angitt p\u00e5 kommandolinjen, m\u00e5 v\u00e6re en absolutt bane eller relativ til gjeldende katalog.\n\nBruk \u00ab${program} -help list\u00bb for \u00e5 vise tilgjengelige konfigurasjonsvariabler.

HelpKeywords=N\u00f8kkelord er syntax, list, advanced, aliases, details eller en s\u00f8keterm
Advanced=avansert
Repeatable=Kan gjentas
Default=Standardverdi
Alias=alias
FullName=fullt navn
NoKeywordsMatched=Ingen samsvarende n\u00f8kkelord.
# note: do not localize the string -help, it has syntactic significance
Brief=${program} [alternativer] [defaultVar]\nBruk ${program} -help for ytterligere informasjon.\n\n

compiler.allow-source-path-overlap=Kontrollerer om en kildebaneoppf\u00f8ring er en underkatalog i en annen kildebaneoppf\u00f8ring. Det hjelper \u00e5 gj\u00f8re pakkenavnene for MXML-komponentene entydige.
compiler.debug=Genererer en film som egner seg til feils\u00f8king
compiler.define=Definer en global AS3-betinget kompileringsdefinisjon, for eksempel -define=CONFIG::debugging,true eller -define+=CONFIG::debugging,true (for \u00e5 legge til for eksisterende definisjoner i Flex-config.xml) 
compiler.defaults-css-url=Definerer en plassering for standard stilark. Hvis du angir dette alternativet, overstyres den implisitte bruken av stilarket Defaults.css i filen Framework.swc.
compiler.fonts.max-cached-fonts=Angir maksimum antall skrifter som skal beholdes i serverhurtigbufferen. Standardverdien er 20.
compiler.fonts.max-glyphs-per-face=Angir maksimum antall omriss for tegnsymboler som skal beholdes i serverhurtigbufferen for hvert skriftsnitt. Standardverdien er 1 000.
compiler.fonts.flash-type=aktiverer FlashType for innebygde skrifter, som gir bedre skarphet for sm\u00e5 skrifter.
compiler.fonts.advanced-anti-aliasing=Aktiverer avansert anti-aliasing for innebygde skrifter, som gir bedre skarphet for sm\u00e5 skrifter.
compiler.use-resource-bundle-metadata=fastsl\u00e5r om ressursbunter skal inkluderes i programmet.
compiler.warn-duplicate-variable-def=Duplisert variabeldefinisjon 
include-inheritance-dependencies-only=inkluder kun arveavhengigheter for klasser angitt med include-classes 
resource-bundle-list=skriver en liste over ressursbunter i en fil for inndata til compc-kompilatoren for \u00e5 opprette en ressursbunt-SWC-fil. 
licenses.license=Angir et produkt og et serienummer. 
remove-unused-rsls=fjern RSL-er som ikke brukes av programmet
runtime-shared-library-path=angir en SWC \u00e5 koble mot, en RSL-URL \u00e5 laste inn, med en valgfri policyfil-URL og valgfrie failover-URL-er 
runtime-shared-library-settings.application-domain=overstyr programdomenet en RSL lastes inn i. St\u00f8ttede verdier er "current", "default", "parent" og "top-level".
runtime-shared-library-settings.force-rsls=tving innlasting av en RSL s\u00e5 fjerningen som ble for\u00e5rsaket ved bruk av alternativet remove-unused-rsls, overstyres
compute-digest=skriver et sammendrag til Catalog.xml for et bibliotek. Dette er n\u00f8dvendig n\u00e5r biblioteket brukes i alternativet -runtime-shared-library-path.
static-link-runtime-shared-libraries=koble statisk bibliotekene angitt av alternativet -runtime-shared-library-path.
verify-digests=kontrollerer at bibliotekene som lastes inn under kj\u00f8ring, er de riktige.
target-player=angir versjonen av spillere som programmet har som m\u00e5lsetning. Funksjoner som krever en senere versjon, kompileres ikke inn i programmet. Minimumsverdien som st\u00f8ttes, er "9.0.0".
swf-version=angir versjonen til kompilert SWF-fil.
use-direct-blit=Bruk maskinvareakselerasjon til en blit-operasjon, hvis maskinvareakselerasjon er tilgjengelig.
use-gpu=Bruk GPU-sammensetningsfunksjoner n\u00e5r du tegner grafikk, hvis slik akselerasjon er tilgjengelig.
tools-locale=angir lokal innstilling som brukes av kompilatoren ved rapportering av feil og advarsler.

# asdoc options
doc-classes=liste over klasser som skal inkluderes i dokumentasjonen.
doc-namespaces=liste over navneomr\u00e5der som skal inkluderes i dokumentasjonen.
doc-sources=liste over kildefiler som skal inkluderes i dokumentasjonen.
exclude-classes=liste over klasser som skal utelates fra dokumentasjonen.
exclude-dependencies=boolean-variabel som angir om avhengigheter skal utelates.
footer=bunntekststreng som skal vises i dokumentasjonen.
left-frameset-width=bredde p\u00e5 venstre ramme.
main-title=tittel som skal vises i tittellinjen.
templates-path=bane for egendefinerte maler.
window-title=tittel som skal vises i nettleservinduet.
lenient=Rapporter feil i god HTML som advarsler.
packages.package=angir en beskrivelse av et pakkenavn.
exclude-sources=liste over kildefiler som skal utelates fra dokumentasjonen.
examples-path=bane til eksempelfiler.
date-in-footer=angir om dato skal vises i bunntekst.
package-description-file=fil som inneholder beskrivelse av pakker.
