################################################################################
##
##  Licensed to the Apache Software Foundation (ASF) under one or more
##  contributor license agreements.  See the NOTICE file distributed with
##  this work for additional information regarding copyright ownership.
##  The ASF licenses this file to You under the Apache License, Version 2.0
##  (the "License"); you may not use this file except in compliance with
##  the License.  You may obtain a copy of the License at
##
##      http://www.apache.org/licenses/LICENSE-2.0
##
##  Unless required by applicable law or agreed to in writing, software
##  distributed under the License is distributed on an "AS IS" BASIS,
##  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
##  See the License for the specific language governing permissions and
##  limitations under the License.
##
################################################################################

benchmark=g\u00e9n\u00e9rer une analyse des performances
compiler.accessible=g\u00e9n\u00e9rer un fichier SWF accessible
compiler.source-path=liste des \u00e9l\u00e9ments de chemin formant les racines d'arborescences de classes ActionScript
compiler.actionscript-file-encoding=indique l'encodage de fichier ActionScript. Si aucune nomenclature n'est d\u00e9finie dans les fichiers source AS3, le compilateur utilise cet encodage.
compiler.isolate-styles=active l'application ou le module compil\u00e9 pour d\u00e9finir des styles qui n'affectent que lui et ses enfants.
compiler.context-root=chemin de remplacement des jetons {context.root} pour les extr\u00e9mit\u00e9s de canaux de service
compiler.external-library-path=liste des fichiers ou r\u00e9pertoires SWC de r\u00e9f\u00e9rence pour la compilation et \u00e0 omettre de la liaison
compiler.fonts.languages.language-range=plage limitant le nombre de glyphes de polices incorpor\u00e9s dans le fichier SWF
compiler.fonts.managers=Classes du gestionnaire de polices du compilateur, par ordre de r\u00e9solution de strat\u00e9gie
compiler.fonts.local-fonts-snapshot=Fichier contenant les donn\u00e9es de polices syst\u00e8me g\u00e9n\u00e9r\u00e9es par flex2.tools.FontSnapshot.
compiler.headless-server=indicateur \u00e0 d\u00e9finir lorsque Flex est ex\u00e9cut\u00e9 sur un serveur sans \u00e9cran
compiler.include-libraries=liste des biblioth\u00e8ques (SWC) \u00e0 inclure enti\u00e8rement dans le fichier SWF
compiler.incremental=active la compilation incr\u00e9mentielle
compiler.keep-all-type-selectors=d\u00e9sactive le nettoyage des s\u00e9lecteurs de type CSS inutilis\u00e9s.
compiler.keep-generated-actionscript=enregistrer les fichiers source temporaires g\u00e9n\u00e9r\u00e9s au cours de la compilation MXML
compiler.keep-generated-signatures=enregistrer les fichiers de signature g\u00e9n\u00e9r\u00e9s lors de la compilation AS3
compiler.keep-as3-metadata=conserver les m\u00e9tadonn\u00e9es sp\u00e9cifi\u00e9es dans le fichier SWF
compiler.library-path=liste des fichiers SWC ou des r\u00e9pertoires contenant des fichiers SWC
compiler.locale=indique la langue pour l'internationalisation
compiler.mobile=indique que la cible d\u2019ex\u00e9cution est un p\u00e9riph\u00e9rique mobile.
compiler.mxml.compatibility-version=sp\u00e9cifie une version de compatibilit\u00e9, par exemple, compatibility-version=2.0.1.
compiler.namespaces.namespace=Sp\u00e9cifiez un URI \u00e0 associer \u00e0 un fichier manifest de composants \u00e0 utiliser en tant qu'\u00e9l\u00e9ments MXML
compiler.optimize=Activer l'optimisation SWF apr\u00e8s liaison
compiler.preloader=Sp\u00e9cifie la valeur par d\u00e9faut de l\u2019attribut preloader de l\u2019application. Si elle n\u2019est pas sp\u00e9cifi\u00e9e, la valeur de preloader par d\u00e9faut est mx.preloaders.SparkDownloadProgressBar lorsque la version de compatibilit\u00e9 est \u00e9gale ou ult\u00e9rieure \u00e0 4.0 et mx.preloaders.DownloadProgressBar lorsqu'elle est ant\u00e9rieure \u00e0 4.0.
compiler.profile=g\u00e9n\u00e9rer un film adapt\u00e9 \u00e0 la cr\u00e9ation de profils de performances et de m\u00e9moires
compiler.services=chemin d'acc\u00e8s au fichier de configuration de Flex Data Services
compiler.omit-trace-statements=basculer vers l'omission des instructions trace
compiler.report-invalid-styles-as-warnings=active le rapport de styles non valides en tant qu'avertissements
compiler.report-missing-required-skin-parts-as-warnings=Cette option permet de g\u00e9n\u00e9rer un avertissement au lieu d'une erreur lorsqu'un \u00e9l\u00e9ment d'habillage requis manquant est d\u00e9tect\u00e9.
compiler.show-invalid-css-property-warnings=basculer vers le rapport d'avertissements de propri\u00e9t\u00e9 css non valides
compiler.show-binding-warnings=basculer vers l'affichage des avertissements g\u00e9n\u00e9r\u00e9s par le code de liaison des donn\u00e9es
compiler.show-actionscript-warnings=ex\u00e9cute le compilateur AS3 dans un mode d\u00e9tectant un code l\u00e9gal mais potentiellement incorrect.
compiler.show-dependency-warnings=afficher les avertissements lorsqu'il est impossible de d\u00e9terminer les d\u00e9pendances au moment de la compilation
compiler.show-deprecation-warnings=basculer vers la g\u00e9n\u00e9ration d'un avertissement suite \u00e0 l'utilisation d'API d\u00e9conseill\u00e9es
compiler.show-shadowed-device-font-warnings=bascule vers l'affichage des avertissements lorsque le nom d'une police incorpor\u00e9e ombre un nom de police du p\u00e9riph\u00e9rique.
compiler.show-unused-type-selector-warnings=basculer vers l'affichage des avertissements g\u00e9n\u00e9r\u00e9s par les s\u00e9lecteurs de type CSS inutilis\u00e9s
compiler.signature-directory=r\u00e9pertoire [relatif/absolu] o\u00f9 sont enregistr\u00e9es les signatures as3 g\u00e9n\u00e9r\u00e9es
compiler.strict=ex\u00e9cute le compilateur AS3 en mode de v\u00e9rification des erreurs strict.
compiler.as3=utilisez le mod\u00e8le d'objet reposant sur la classe ActionScript 3 pour optimiser les performances et les rapports d'erreurs. Dans ce mod\u00e8le d'objet, la plupart des fonctions int\u00e9gr\u00e9es est impl\u00e9ment\u00e9e en tant que m\u00e9thodes de classes fixes.
compiler.es=utilisez le mod\u00e8le d'objet reposant sur le prototype ECMAScript Edition 3 afin de permettre le remplacement dynamique des propri\u00e9t\u00e9s de prototype. Dans ce mod\u00e8le d'objet, les fonctions int\u00e9gr\u00e9es sont impl\u00e9ment\u00e9es en tant que propri\u00e9t\u00e9s dynamiques des objets prototype.
compiler.theme=liste des fichiers CSS ou SWC \u00e0 appliquer comme th\u00e8me
compiler.verbose-stacktraces=enregistrer les informations de pile des appels dans le fichier SWF \u00e0 des fins de d\u00e9bogage
compiler.memory-usage-factor=indique le facteur d'utilisation de la m\u00e9moire du compilateur, la valeur par d\u00e9faut \u00e9tant 1000.
compiler.conservative=utilise l'algorithme de compilation standard. D\u00e9conseill\u00e9 pour les applications complexes. Le param\u00e8tre par d\u00e9faut est false.
compiler.warn-array-tostring-changes=Le format Array.toString() a \u00e9t\u00e9 modifi\u00e9.
compiler.warn-assignment-within-conditional=Attribution au sein d'un \u00e9l\u00e9ment conditionnel.
compiler.warn-bad-array-cast=Op\u00e9ration de projection de r\u00e9seau potentiellement incorrecte.
compiler.warn-bad-bool-assignment=Une valeur non bool\u00e9enne a \u00e9t\u00e9 utilis\u00e9e alors qu'une valeur bool\u00e9enne \u00e9tait attendue.
compiler.warn-bad-date-cast=Op\u00e9ration de projection de donn\u00e9es incorrecte.
compiler.warn-bad-es3-type-method=M\u00e9thode inconnue.
compiler.warn-bad-es3-type-prop=Propri\u00e9t\u00e9 inconnue.
compiler.warn-bad-nan-comparison=Comparaison illogique \u00e0 NaN. Toute op\u00e9ration de comparaison impliquant NaN aboutit au r\u00e9sultat false car NaN != NaN.
compiler.warn-bad-null-assignment=Attribution impossible \u00e0 la valeur nulle.
compiler.warn-bad-null-comparison=Comparaison illogique \u00e0 une valeur nulle.
compiler.warn-bad-undefined-comparison=Comparaison illogique \u00e0 un \u00e9l\u00e9ment non d\u00e9fini. Seules des variables sans type (ou de type *) peuvent \u00eatre non d\u00e9finies.
compiler.warn-boolean-constructor-with-no-args=L'\u00e9l\u00e9ment Boolean() sans arguments renvoie false dans ActionScript 3.0 tandis qu'il renvoie undefined dans ActionScript 2.0.
compiler.warn-changes-in-resolve=__resolve n'est plus pris en charge.
compiler.warn-class-is-sealed=La classe est scell\u00e9e. Il est impossible d'y ajouter des membres de mani\u00e8re dynamique.
compiler.warn-const-not-initialized=Constante non initialis\u00e9e.
compiler.warn-constructor-returns-value=Une fonction utilis\u00e9e dans une nouvelle expression renvoie une valeur. Le r\u00e9sultat correspond \u00e0 ce que la fonction renvoie au lieu d'une nouvelle instance de la fonction.
compiler.warn-deprecated-event-handler-error=EventHandler n'a pas \u00e9t\u00e9 ajout\u00e9 en tant que port d'\u00e9coute.
compiler.warn-deprecated-function-error=Fonction ActionScript 2.0 non prise en charge.
compiler.warn-deprecated-property-error=Propri\u00e9t\u00e9 ActionScript 2.0 non prise en charge.
compiler.warn-duplicate-argument-names=Plusieurs arguments portent le m\u00eame nom.
compiler.warn-for-var-in-changes=ActionScript 3.0 effectue une it\u00e9ration sur les propri\u00e9t\u00e9s d'un objet dans le cadre d'une instruction de type "pour x dans la cible" dans un ordre al\u00e9atoire.
compiler.warn-import-hides-class=L'importation d'un paquet portant le m\u00eame nom que la classe active masquera l'identificateur de la classe dans cette \u00e9tendue.
compiler.warn-instance-of-changes=Utilisation de l'instance de l'op\u00e9rateur.
compiler.warn-internal-error=Erreur interne dans le compilateur.
compiler.warn-level-not-supported=_level n'est plus pris en charge. Pour plus de d\u00e9tails, consultez le paquet flash.display.
compiler.warn-missing-namespace-decl=D\u00e9claration d'espace de noms manquante (par ex., la variable n'est pas d\u00e9finie comme \u00e9tant publique, priv\u00e9e, etc.).
compiler.warn-negative-uint-literal=Une valeur n\u00e9gative devient une grande valeur positive lorsqu'elle est attribu\u00e9e \u00e0 un type de donn\u00e9es uint.
compiler.warn-no-constructor=Constructeur manquant.
compiler.warn-no-explicit-super-call-in-constructor=L'instruction super() n'a pas \u00e9t\u00e9 appel\u00e9e dans le constructeur.
compiler.warn-no-type-decl=D\u00e9claration de type manquante.
compiler.warn-number-from-string-changes=Dans ActionScript 3.0, les espaces sont ignor\u00e9s et '' renvoie 0. Number() renvoie NaN dans ActionScript 2.0 lorsque le param\u00e8tre est '' ou lorsqu'il contient un espace.
compiler.warn-scoping-change-in-this=Modification dans l'\u00e9tendue de ce mot-cl\u00e9. Les m\u00e9thodes de classe extraites \u00e0 partir d'une instance d'une classe aboutiront toujours \u00e0 cette instance. Dans ActionScript 2.0, la recherche se fait de mani\u00e8re dynamique depuis de l'emplacement \u00e0 partir duquel la m\u00e9thode est appel\u00e9e.
compiler.warn-slow-text-field-addition=Utilisation inefficace de += sur une entr\u00e9e TextField.
compiler.warn-unlikely-function-value=Parenth\u00e8ses \u00e9ventuellement manquantes.
compiler.warn-xml-class-has-changed=Utilisation possible de la classe XML ActionScript 2.0.
debug-password=mot de passe \u00e0 inclure dans les fichiers SWF \u00e0 d\u00e9boguer
default-background-color=couleur d'arri\u00e8re-plan par d\u00e9faut (peut \u00eatre \u00e9cras\u00e9e par le code de l'application)
default-frame-rate=vitesse de d\u00e9filement des images par d\u00e9faut \u00e0 utiliser dans le fichier SWF.
default-script-limits=limites d'ex\u00e9cution par d\u00e9faut du script (peuvent \u00eatre \u00e9cras\u00e9es par les attributs root)
default-size=taille par d\u00e9faut de l'application (peut \u00eatre \u00e9cras\u00e9e par les attributs root de l'application)
dependency-info=g\u00e9n\u00e9rer les informations de d\u00e9pendance de classe
dependency.minimize-dependency-set=supprime un fichier SWC du jeu de d\u00e9pendances si les scripts r\u00e9solus dans ce fichier constituent un sous-ensemble des scripts r\u00e9solus dans un autre fichier SWC d\u00e9pendant.  
dependency.show-external-classes=d\u00e9finir sur true pour afficher les classes de script entra\u00eenant les d\u00e9pendances inter-SWC (la valeur par d\u00e9faut est false).
dependency.show-swcs=liste des noms SWC, un chemin complet n'est pas requis. Les informations de d\u00e9pendance s'affichent uniquement pour les noms SWC sp\u00e9cifi\u00e9s ; aucun impact ne survient sur l'analyse de d\u00e9pendance.
dependency.show-types=d\u00e9finir sur true pour afficher les types de d\u00e9pendances de classes de script (la valeur par d\u00e9faut est false).
dependency.types=une liste de types de d\u00e9pendance r\u00e9duisant les classes utilis\u00e9es pour d\u00e9terminer les d\u00e9pendances SWC. Les valeurs possibles sont i,s,n et e. Par d\u00e9faut, tous les types de d\u00e9pendances sont utilis\u00e9s.
digest.rsl-file=emplacement de l'attribut RSL permettant de calculer la valeur de pr\u00e9traitement de
digest.swc-path=chemin du fichier ou r\u00e9pertoire SWC o\u00f9 la valeur sera mise \u00e0 jour.
directory=g\u00e9n\u00e9rer la biblioth\u00e8que sous forme d'un r\u00e9pertoire ouvert au lieu d'un fichier SWC
dump-config=\u00e9crire un fichier contenant toutes les valeurs de configuration d\u00e9finies existantes dans un format pouvant \u00eatre utilis\u00e9 comme fichier de configuration Flex
externs=liste des symboles \u00e0 omettre de la liaison lors de la construction d'un fichier SWF
includes=liste des symboles vers laquelle un lien doit pointer lors de la construction d'un fichier SWF
include-classes=liste de classes \u00e0 inclure dans le fichier SWC g\u00e9n\u00e9r\u00e9
include-file=liste de fichiers nomm\u00e9s \u00e0 inclure dans le SWC g\u00e9n\u00e9r\u00e9
include-lookup-only=si la valeur est true, les entr\u00e9es Manifest pour lesquelles lookupOnly=true sont incorpor\u00e9es au catalogue SWC. La valeur par d\u00e9faut est false.
include-namespaces=toutes les classes dans les espaces de noms r\u00e9pertori\u00e9s sont incluses dans le fichier SWC g\u00e9n\u00e9r\u00e9.
include-resource-bundles=liste d'ensembles de ressources \u00e0 inclure dans le fichier SWC g\u00e9n\u00e9r\u00e9
include-sources=liste de r\u00e9pertoires et de fichiers sources \u00e0 inclure dans le fichier SWC g\u00e9n\u00e9r\u00e9
include-stylesheet=liste de ressources de feuilles de style nomm\u00e9es \u00e0 inclure dans le fichier SWC g\u00e9n\u00e9r\u00e9
file-specs=liste des fichiers source \u00e0 compiler, le dernier fichier sp\u00e9cifi\u00e9 devant servir d'application cible
frames.frame=Libell\u00e9 d'image SWF dot\u00e9 d'une s\u00e9quence de noms de classes qui seront li\u00e9s \u00e0 l'image.
generate-frame-loader=activer/d\u00e9sactiver la g\u00e9n\u00e9ration d'une classe de chargeur IFlexModuleFactory-derived
help=Pour obtenir des informations sur la syntaxe de ligne de commande et des descriptions de variables de configuration, sp\u00e9cifiez une cha\u00eene de recherche ou un des mots cl\u00e9s suivants  :\n   syntax   - permet de d\u00e9crire la syntaxe g\u00e9n\u00e9rale de la ligne de commande\n   list     - permet d'afficher une liste de toutes les variables de configuration de base\n   advanced - permet d'obtenir les variables de configuration avanc\u00e9es\n   aliases  - permet de trier \u00e0 l'aide des alias abr\u00e9g\u00e9s de la variable\n   details  - permet de toujours afficher les d\u00e9tails complets de chaque \u00e9l\u00e9ment\nLes autres mots cl\u00e9s d'aide permettent de trouver une variable de configuration compl\u00e8te ou partielle, un alias ou du texte dans la description de la variable de configuration.\n\nPar exemple '-help advanced aliases foo' permet d'afficher toutes les options de configuration (de base et avanc\u00e9es) qui contiennent le texte 'foo', tri\u00e9es par nom d'alias.\n\nDans la description de chaque variable de configuration, les valeurs requises sont signal\u00e9es par des crochets en chevron ouvrant et les valeurs facultatives sont signal\u00e9es par des crochets. La notation [...] indique que les valeurs sont une liste de longueur arbitraire.
lazy-init=Activer/D\u00e9sactiver l'initialisation non stricte de code en octets ABC
link-report=G\u00e9n\u00e8re un rapport au format XML de toutes les d\u00e9finitions li\u00e9es dans l'application.
load-config=charger un fichier contenant des options de configuration
load-externs=fichier XML contenant les symboles <def>, <pre> et <ext> \u00e0 omettre de la liaison lors de la construction d'un fichier SWF
metadata.contributor=Nom de collaborateur \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF
metadata.creator=Nom de cr\u00e9ateur \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF
metadata.date=Date de cr\u00e9ation \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF
metadata.description=Description par d\u00e9faut \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF
metadata.language=Langue \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF (par ex., EN, FR)
metadata.localized-description=Description RDF/XMP traduite \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF
metadata.localized-title=Titre RDF/XMP traduit \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF
metadata.publisher=Nom d'\u00e9diteur \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF
metadata.title=Titre par d\u00e9faut \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF
output=nom de fichier du film SWF \u00e0 cr\u00e9er
raw-metadata=texte XML \u00e0 stocker dans les m\u00e9tadonn\u00e9es SWF (remplace la configuration metadata.*)
runtime-shared-libraries=liste des URL de biblioth\u00e8ques d'ex\u00e9cution partag\u00e9es \u00e0 charger avant le d\u00e9marrage de l'application
size-report=Produit un rapport au format XML d\u00e9taillant la taille de tous les codes et donn\u00e9es li\u00e9s dans l'application.
use-network=activer/d\u00e9sactiver l'indication du fichier SWF pour l'acc\u00e8s aux ressources r\u00e9seau
version=afficher la version de construction du programme
warnings=activer/d\u00e9sactiver l'affichage des avertissements

Syntax=Utilisation: ${program} [configuration options] [default arguments]\n\nLes options de configuration peuvent \u00eatre d\u00e9finies sur la ligne de commande sous la forme suivante '-variable=value,value,value'. (Le nombre de valeurs requises d\u00e9pend de la variable.) Les options bool\u00e9ennes peuvent \u00eatre activ\u00e9es avec '-variable=true' et d\u00e9sactiv\u00e9es avec '-variable=false', '-variable' \u00e9tant l'abr\u00e9viation de '-variable=true'. Les variables peuvent \u00eatre effac\u00e9es en d\u00e9finissant '-variable=' sans valeur \u00e0 la suite du signe \u00e9gal.\n\nLa liste des arguments par d\u00e9faut revient \u00e0 d\u00e9finir la variable '${defaultVar}'. La cha\u00eene sp\u00e9ciale '--' peut \u00eatre utilis\u00e9e pour mettre fin au processus des options de configuration nomm\u00e9es et pour forcer les valeurs restantes sur la ligne de commande \u00e0 \u00eatre interpr\u00e9t\u00e9es comme arguments par d\u00e9faut.\n\nEn g\u00e9n\u00e9ral, une variable donn\u00e9e ne peut \u00eatre d\u00e9finie qu'une seule fois, mais certaines variables peuvent \u00eatre d\u00e9finies plusieurs fois si elles sont signal\u00e9es comme 'repeatable' dans leur description. En d'autres termes, '-a=x,y,z' peut \u00e9galement \u00eatre d\u00e9finie comme '-a=x -a=y -a=z' si 'a' est indiqu\u00e9 comme "repeatable". Une caract\u00e9ristique plus utile des variables pouvant se r\u00e9p\u00e9ter est illustr\u00e9e avec l'utilisation de la syntaxe sp\u00e9ciale '-variable+=value,value', les nouvelles valeurs d\u00e9finies seront ajout\u00e9es \u00e0 la valeur actuelle, au lieu de remplacer la liste des valeurs actuelles.\n\nLes variables de configuration poss\u00e8dent parfois des alias abr\u00e9g\u00e9s afin de les taper plus facilement. Les noms de variables avec points hi\u00e9rarchiques sont automatiquement dot\u00e9s d'un alias g\u00e9n\u00e9r\u00e9 pour leur nom 'leaf', s'il est unique.\n\nLes noms de fichiers sp\u00e9cifi\u00e9s sur la ligne de commande doivent \u00eatre un chemin absolu ou relatif par rapport au r\u00e9pertoire courant.\n\nUtilisez '${program} -help list' pour r\u00e9pertorier les variables de configuration disponibles.

AdvancedSyntax=Utilisation : ${program} [configuration options] [default arguments]\n\nLes options de configuration peuvent \u00eatre d\u00e9finies sur la ligne de commande sous la forme suivante '-variable=value,value,value' ou '-variable value value'. (Le nombre de valeurs requises d\u00e9pend de la variable.) Les options bool\u00e9ennes peuvent \u00eatre activ\u00e9es avec '-variable=true' et d\u00e9sactiv\u00e9es avec '-variable=false', '-variable' \u00e9tant l'abr\u00e9viation de '-variable=true'. Les variables peuvent \u00eatre effac\u00e9es en d\u00e9finissant '-variable=' sans valeur \u00e0 la suite du signe \u00e9gal.\n\nLa liste des arguments par d\u00e9faut revient \u00e0 d\u00e9finir la variable '${defaultVar}'. La cha\u00eene sp\u00e9ciale '--' peut \u00eatre utilis\u00e9es pour mettre fin au processus des options de configuration nomm\u00e9es et pour forcer les valeurs restantes sur la ligne de commande \u00e0 \u00eatre interpr\u00e9t\u00e9es comme arguments par d\u00e9faut.\n\nEn g\u00e9n\u00e9ral, une variable donn\u00e9e ne peut \u00eatre d\u00e9finie qu'une seule fois, mais certaines variables peuvent \u00eatre d\u00e9finies plusieurs fois si elles sont signal\u00e9es comme 'repeatable' dans leur description. En d'autres termes, '-a=x,y,z' peut \u00e9galement \u00eatre d\u00e9finie comme '-a=x -a=y -a=z' si 'a' est indiqu\u00e9 comme "repeatable". Une caract\u00e9ristique plus utile des variables pouvant se r\u00e9p\u00e9ter est illustr\u00e9e avec l'utilisation de la syntaxe sp\u00e9ciale '-variable+=value,value', les nouvelles valeurs d\u00e9finies seront ajout\u00e9es \u00e0 la valeur actuelle, au lieu de remplacer la liste des valeurs actuelles.\n\nLes variables de configuration poss\u00e8dent parfois des alias abr\u00e9g\u00e9s afin de les taper plus facilement. Les noms de variables avec points hi\u00e9rarchiques sont automatiquement dot\u00e9s d'un alias g\u00e9n\u00e9r\u00e9 pour leur nom 'leaf', s'il est unique.\n\nSi une s\u00e9quence au format $${token} est pr\u00e9sente dans une valeur de configuration, elle est d\u00e9velopp\u00e9e jusqu'\u00e0 la valeur du jeton. Toutes les propri\u00e9t\u00e9s Java sont trait\u00e9es comme des jetons, mais ces derniers peuvent \u00e9galement \u00eatre d\u00e9finis avec '+token=value' sur la ligne de commande. Le remplacement d'un jeton est limit\u00e9 aux cha\u00eenes simples, mais peut \u00eatre d\u00e9fini de fa\u00e7on r\u00e9cursive.\n\nLes noms de fichiers sp\u00e9cifi\u00e9s sur la ligne de commande doivent \u00eatre un chemin absolu ou relatif par rapport au r\u00e9pertoire courant.\n\nUtilisez '${program} -help list' pour r\u00e9pertorier les variables de configuration disponibles.

HelpKeywords=les mots-cl\u00e9s sont syntax, list, advanced, aliases, details ou un mot \u00e0 rechercher
Advanced=avanc\u00e9
Repeatable=se r\u00e9p\u00e9tant
Default=variable par d\u00e9faut
Alias=alias
FullName=nom complet
NoKeywordsMatched=aucun mot-cl\u00e9 concordant.
# note: do not localize the string -help, it has syntactic significance
Brief=${program} [options] [defaultVar]\nPour plus de d\u00e9tails, utilisez ${program} -help.\n\n

compiler.allow-source-path-overlap=v\u00e9rifie si une entr\u00e9e source-path correspond \u00e0 un sous-r\u00e9pertoire d'une autre entr\u00e9e source-path. Cela permet de rendre les noms de paquets de composants MXML non ambigus.
compiler.debug=g\u00e9n\u00e8re un film adapt\u00e9 au d\u00e9bogage
compiler.define=cr\u00e9er une d\u00e9finition de compilation conditionnelle AS3 globale telle que : define=CONFIG::debugging,true ou -define+=CONFIG::debugging,true (\u00e0 ajouter aux d\u00e9finitions existantes dans flex-config.xml) 
compiler.defaults-css-url=d\u00e9finit l'emplacement de la feuille de style par d\u00e9faut. La d\u00e9finition de cette option remplace l'utilisation implicite de la feuille de style defaults.css dans le fichier framework.swc.
compiler.fonts.max-cached-fonts=d\u00e9finit le nombre maximum de polices \u00e0 conserver dans la m\u00e9moire cache du serveur. La valeur par d\u00e9faut est 20.
compiler.fonts.max-glyphs-per-face=d\u00e9finit le nombre maximum de contours de glyphe de caract\u00e8re \u00e0 conserver dans la m\u00e9moire cache du serveur pour chaque police. La valeur par d\u00e9faut est 1 000.
compiler.fonts.flash-type=active FlashType pour les polices incorpor\u00e9es, ce qui am\u00e9liore la lisibilit\u00e9 des polices de petite taille.
compiler.fonts.advanced-anti-aliasing=active le lissage avanc\u00e9 pour les polices incorpor\u00e9es, ce qui am\u00e9liore la lisibilit\u00e9 des polices de petite taille.
compiler.use-resource-bundle-metadata=d\u00e9termine si les ensembles de ressources sont inclus dans l'application.
compiler.warn-duplicate-variable-def=D\u00e9finition de variable en double 
include-inheritance-dependencies-only=inclure seulement les d\u00e9pendances d'h\u00e9ritage des classes sp\u00e9cifi\u00e9es avec inclure-classes 
resource-bundle-list=imprime dans un fichier une liste d'ensembles de ressources \u00e0 entrer dans le compilateur compc afin de cr\u00e9er un fichier SWC d'ensemble de ressources. 
licenses.license=indique un produit et un num\u00e9ro de s\u00e9rie. 
remove-unused-rsls=supprimer mes RSL qui ne sont pas en cours d'utilisation par l'application
runtime-shared-library-path=sp\u00e9cifie un SWC auquel se lier, une URL RSL \u00e0 charger avec une URL de fichier de politique facultatif et des URL de basculement facultatives 
runtime-shared-library-settings.application-domain=remplace le domaine d\u2019application dans lequel un RSL est charg\u00e9. Les valeurs prises en charge sont \u00ab\u00a0actif\u00a0\u00bb, \u00ab\u00a0par d\u00e9faut\u00a0\u00bb, \u00ab\u00a0parent\u00a0\u00bb et \u00ab\u00a0sup\u00e9rieur\u00a0\u00bb.
runtime-shared-library-settings.force-rsls=forcer le chargement d'une RSL, rempla\u00e7ant la substitution g\u00e9n\u00e9r\u00e9e par l'utilisation de l'option supprimer_rsl_inutilis\u00e9es
compute-digest=\u00e9crit une valeur de pr\u00e9traitement dans le fichier catalog.xml d'une biblioth\u00e8que. Cela est n\u00e9cessaire si vous d\u00e9signez la biblioth\u00e8que dans l'option -runtime-shared-libraries-path.
static-link-runtime-shared-libraries=\u00e9tablit un lien statique avec les biblioth\u00e8ques d\u00e9sign\u00e9es par l'option -runtime-shared-libraries-path.
verify-digests=v\u00e9rifie si les biblioth\u00e8ques charg\u00e9es au moment de l'ex\u00e9cution sont celles qui conviennent.
target-player=sp\u00e9cifie la version du lecteur cibl\u00e9 par l'application. Les fonctionnalit\u00e9s exigeant une version ult\u00e9rieure ne seront pas compil\u00e9es dans l'application. La version minimale prise en charge est la version 9.0.0.
swf-version=indique la version du fichier SWF compil\u00e9.
use-direct-blit=Utilisez l\u2019acc\u00e9l\u00e9ration mat\u00e9rielle pour afficher les graphiques \u00e0 l\u2019\u00e9cran, lorsqu\u2019elle est disponible.
use-gpu=Utilisez les fonctionnalit\u00e9s de composition GPU lors de l\u2019affichage de graphiques, lorsque cette acc\u00e9l\u00e9ration est disponible.
tools-locale=sp\u00e9cifie les param\u00e8tres r\u00e9gionaux utilis\u00e9s par le compilateur lorsque des erreurs et des avertissements sont signal\u00e9s.

# asdoc options
doc-classes=liste de classes \u00e0 inclure \u00e0 la documentation.
doc-namespaces=liste d'espaces de noms \u00e0 inclure \u00e0 la documentation.
doc-sources=liste de fichiers source \u00e0 inclure \u00e0 la documentation.
exclude-classes=liste de classes \u00e0 exclure de la documentation.
exclude-dependencies=bool\u00e9en sp\u00e9cifiant s'il faut exclure les d\u00e9pendances.
footer=cha\u00eene de bas de page \u00e0 afficher dans la documentation.
left-frameset-width=largeur du frame gauche.
main-title=titre \u00e0 afficher dans la barre de titre.
templates-path=chemin pour les mod\u00e8les personnalis\u00e9s.
window-title=titre \u00e0 afficher dans la fen\u00eatre de navigateur.
lenient=Rapporter des erreurs au format HTML en avertissements.
packages.package=sp\u00e9cifie une description pour un nom de package.
exclude-sources=liste de fichiers source \u00e0 exclure de la documentation.
examples-path=chemin auquel rechercher les fichiers d'exemples.
date-in-footer=sp\u00e9cifie s'il faut inclure la date au bas de page.
package-description-file=fichier contenant la description des packages.
